{"title": "Alexander the Great", "section_titles": ["Introduction", "Early life", "Heir of Philip II", "King of Macedon", "Conquest of the Persian Empire", "Indian campaign", "Last years in Persia", "Death and succession", "Character", "Battle record", "Legacy", "Historiography", "See also", "Annotations", "References", "Sources", "Further reading", "External links"], "section_texts": ["\n\n\n\n\n\n\n'''Alexander III of Macedon''' (, ; 20/21 July 356 BC – 10/11 June 323 BC), commonly known as '''Alexander the Great''', was a king of the ancient Greek kingdom of Macedon. A member of the Argead dynasty, he was born in Pella—a city in Ancient Greece—in 356 BC. He succeeded his father King Philip II to the throne at the age of 20, and spent most of his ruling years conducting a lengthy military campaign throughout Western Asia and Northeastern Africa. By the age of thirty, he had created one of the largest empires in history, stretching from Greece to northwestern India. He was undefeated in battle and is widely considered to be one of history's greatest and most successful military commanders.\nmosaic from Pompeii, an alleged reproduction of a Philoxenus of Eretria or Apelles' painting, 4th century BC.\nDuring his youth, Alexander was tutored by Aristotle until the age of 16. His father Philip was assassinated in 336 BC at the wedding of Cleopatra of Macedon, Alexander's sister, and Alexander assumed the throne of the Kingdom of Macedon. After sacking the city of Thebes, Alexander was awarded the generalship of Greece. He used his authority to launch his father's pan-Hellenic project, which involved him assuming the leadership position to all the Greeks in their conquest of Persia.\n\nIn 334 BC he invaded the Achaemenid Empire (Persian Empire) and began a series of campaigns that lasted 10 years. Following his conquest of Asia Minor (modern-day Turkey), Alexander broke the power of Persia in a series of decisive battles, including those at Issus and Gaugamela. He subsequently overthrew King Darius III and conquered the Achaemenid Empire in its entirety. At that point, his empire stretched from the Adriatic Sea to the Indus River. Alexander endeavored to reach the \"ends of the world and the Great Outer Sea\" and invaded India in 326 BC, achieving an important victory over King Porus at the Battle of the Hydaspes. He eventually turned back at the Beas River due to the demand of his homesick troops, dying in Babylon in 323 BC; the city he planned to establish as his capital. He did not manage to execute a series of planned campaigns that would have begun with an invasion of Arabia. In the years following his death, a series of civil wars tore his empire apart.\n\nAlexander's legacy includes the cultural diffusion and syncretism which his conquests engendered, such as Greco-Buddhism and Hellenistic Judaism. He founded more than twenty cities that bore his name, most notably Alexandria in Egypt. Alexander's settlement of Greek colonists and the resulting spread of Greek culture resulted in Hellenistic civilization, which developed through the Roman Empire into modern Western culture. The Greek language became the lingua franca of the region and was the predominant language of the Byzantine Empire up until its end in the mid-15th century AD.  Greek-speaking communities in central and far eastern Anatolia survived until the Greek genocide and the population exchange in the 1920s. Alexander became legendary as a classical hero in the mould of Achilles, featuring prominently in the history and mythic traditions of both Greek and non-Greek cultures. His military achievements and enduring, unprecedented success in battle made him the measure against which many later military leaders would compare themselves. Military academies throughout the world still teach his tactics.\n\n\n", "\n===Lineage and childhood===\nThe Kingdom of Macedon in 336 BC, birthplace of Alexander\nAlexander was born in Pella, the capital of the Kingdom of Macedon, on the sixth day of the ancient Greek month of Hekatombaion, which probably corresponds to 20 July 356 BC (although the exact date is uncertain). He was the son of the king of Macedon, Philip II, and his fourth wife, Olympias, daughter of Neoptolemus I, king of Epirus. Although Philip had seven or eight wives, Olympias was his principal wife for some time, likely because she gave birth to Alexander.\n\nRoman medallion depicting Olympias, Alexander's mother\nSeveral legends surround Alexander's birth and childhood. According to the ancient Greek biographer Plutarch, on the eve of the consummation of her marriage to Philip, Olympias dreamed that her womb was struck by a thunderbolt that caused a flame to spread \"far and wide\" before dying away. Sometime after the wedding, Philip is said to have seen himself, in a dream, securing his wife's womb with a seal engraved with a lion's image. Plutarch offered a variety of interpretations for these dreams: that Olympias was pregnant before her marriage, indicated by the sealing of her womb; or that Alexander's father was Zeus. Ancient commentators were divided about whether the ambitious Olympias promulgated the story of Alexander's divine parentage, variously claiming that she had told Alexander, or that she dismissed the suggestion as impious.\n\nOn the day Alexander was born, Philip was preparing a siege on the city of Potidea on the peninsula of Chalcidice. That same day, Philip received news that his general Parmenion had defeated the combined Illyrian and Paeonian armies and that his horses had won at the Olympic Games. It was also said that on this day, the Temple of Artemis in Ephesus, one of the Seven Wonders of the World, burnt down. This led Hegesias of Magnesia to say that it had burnt down because Artemis was away, attending the birth of Alexander. Such legends may have emerged when Alexander was king, and possibly at his instigation, to show that he was superhuman and destined for greatness from conception.\n\n''Alexander and Bucephalus'' by Domenico Maria Canuti, 17th century\nIn his early years, Alexander was raised by a nurse, Lanike, sister of Alexander's future general Cleitus the Black. Later in his childhood, Alexander was tutored by the strict Leonidas, a relative of his mother, and by Lysimachus of Acarnania. Alexander was raised in the manner of noble Macedonian youths, learning to read, play the lyre, ride, fight, and hunt.\nWhen Alexander was ten years old, a trader from Thessaly brought Philip a horse, which he offered to sell for thirteen talents. The horse refused to be mounted, and Philip ordered it away. Alexander, however, detecting the horse's fear of its own shadow, asked to tame the horse, which he eventually managed. Plutarch stated that Philip, overjoyed at this display of courage and ambition, kissed his son tearfully, declaring: \"My boy, you must find a kingdom big enough for your ambitions. Macedon is too small for you\", and bought the horse for him. Alexander named it Bucephalas, meaning \"ox-head\". Bucephalas carried Alexander as far as India. When the animal died (because of old age, according to Plutarch, at age thirty), Alexander named a city after him, Bucephala.\n\n===Education===\nWhen Alexander was 13, Philip began to search for a tutor, and considered such academics as Isocrates and Speusippus, the latter offering to resign from his stewardship of the Academy to take up the post. In the end, Philip chose Aristotle and provided the Temple of the Nymphs at Mieza as a classroom. In return for teaching Alexander, Philip agreed to rebuild Aristotle's hometown of Stageira, which Philip had razed, and to repopulate it by buying and freeing the ex-citizens who were slaves, or pardoning those who were in exile.\n\nMieza was like a boarding school for Alexander and the children of Macedonian nobles, such as Ptolemy, Hephaistion, and Cassander. Many of these students would become his friends and future generals, and are often known as the \"Companions\". Aristotle taught Alexander and his companions about medicine, philosophy, morals, religion, logic, and art. Under Aristotle's tutelage, Alexander developed a passion for the works of Homer, and in particular the ''Iliad''; Aristotle gave him an annotated copy, which Alexander later carried on his campaigns.\n\nAlexander was able to quote Euripides from memory.\n\nDuring his youth, Alexander was also acquainted with Persian exiles at the Macedonian court, who received the protection of Philip II for several years as they opposed Artaxerxes III. Among them were Artabazos II and his daughter Barsine, possible future mistress of Alexander, who resided at the Macedonian court from 352 to 342 BC, as well as Amminapes, future satrap of Alexander, or a Persian nobleman named Sisines. This gave the Macedonian court a good knowledge of Persian issues, and may even have influenced some of the innovations in the management of the Macedonian state.\n\nSuda writes that Anaximenes of Lampsacus was one of Alexander's teachers, and that Anaximenes also accompanied Alexander on his campaigns.\n", "\n===Regency and ascent of Macedon===\n\n\nPhilip II of Macedon, Alexander's father\n\nAt the age of 16, Alexander's education under Aristotle ended. Philip II had waged war against the Thracians to the north, which left Alexander in charge as regent and heir apparent.\n\nDuring Philip's absence, the Thracian tribe of Maedi revolted against Macedonia. Alexander responded quickly and drove them from their territory. The territory was colonized, and a city, named Alexandropolis, was founded.\n\nUpon Philip's return, Alexander was dispatched with a small force to subdue the revolts in southern Thrace. Campaigning against the Greek city of Perinthus, Alexander reportedly saved his father's life. Meanwhile, the city of Amphissa began to work lands that were sacred to Apollo near Delphi, a sacrilege that gave Philip the opportunity to further intervene in Greek affairs. While Philip was occupied in Thrace, Alexander was ordered to muster an army for a campaign in southern Greece. Concerned that other Greek states might intervene, Alexander made it look as though he was preparing to attack Illyria instead. During this turmoil, the Illyrians invaded Macedonia, only to be repelled by Alexander.\n\nPhilip and his army joined his son in 338 BC, and they marched south through Thermopylae, taking it after stubborn resistance from its Theban garrison. They went on to occupy the city of Elatea, only a few days' march from both Athens and Thebes. The Athenians, led by Demosthenes, voted to seek alliance with Thebes against Macedonia. Both Athens and Philip sent embassies to win Thebes's favour, but Athens won the contest. Philip marched on Amphissa (ostensibly acting on the request of the Amphictyonic League), capturing the mercenaries sent there by Demosthenes and accepting the city's surrender. Philip then returned to Elatea, sending a final offer of peace to Athens and Thebes, who both rejected it.\nBattle of Chaeronea\nAs Philip marched south, his opponents blocked him near Chaeronea, Boeotia. During the ensuing Battle of Chaeronea, Philip commanded the right wing and Alexander the left, accompanied by a group of Philip's trusted generals. According to the ancient sources, the two sides fought bitterly for some time. Philip deliberately commanded his troops to retreat, counting on the untested Athenian hoplites to follow, thus breaking their line. Alexander was the first to break the Theban lines, followed by Philip's generals. Having damaged the enemy's cohesion, Philip ordered his troops to press forward and quickly routed them. With the Athenians lost, the Thebans were surrounded. Left to fight alone, they were defeated.\n\nAfter the victory at Chaeronea, Philip and Alexander marched unopposed into the Peloponnese, welcomed by all cities; however, when they reached Sparta, they were refused, but did not resort to war. At Corinth, Philip established a \"Hellenic Alliance\" (modelled on the old anti-Persian alliance of the Greco-Persian Wars), which included most Greek city-states except Sparta. Philip was then named ''Hegemon'' (often translated as \"Supreme Commander\") of this league (known by modern scholars as the League of Corinth), and announced his plans to attack the Persian Empire.\n\n===Exile and return===\nWhen Philip returned to Pella, he fell in love with and married Cleopatra Eurydice in 338 BC, the niece of his general Attalus. The marriage made Alexander's position as heir less secure, since any son of Cleopatra Eurydice would be a fully Macedonian heir, while Alexander was only half-Macedonian. During the wedding banquet, a drunken Attalus publicly prayed to the gods that the union would produce a legitimate heir.\n\n\n\nIn 337 BC, Alexander fled Macedon with his mother, dropping her off with her brother, King Alexander I of Epirus in Dodona, capital of the Molossians. He continued to Illyria, where he sought refuge with one or more Illyrian kings, perhaps with Glaukias, and was treated as a guest, despite having defeated them in battle a few years before. However, it appears Philip never intended to disown his politically and militarily trained son. Accordingly, Alexander returned to Macedon after six months due to the efforts of a family friend, Demaratus, who mediated between the two parties.\n\nIn the following year, the Persian satrap (governor) of Caria, Pixodarus, offered his eldest daughter to Alexander's half-brother, Philip Arrhidaeus. Olympias and several of Alexander's friends suggested this showed Philip intended to make Arrhidaeus his heir. Alexander reacted by sending an actor, Thessalus of Corinth, to tell Pixodarus that he should not offer his daughter's hand to an illegitimate son, but instead to Alexander. When Philip heard of this, he stopped the negotiations and scolded Alexander for wishing to marry the daughter of a Carian, explaining that he wanted a better bride for him. Philip exiled four of Alexander's friends, Harpalus, Nearchus, Ptolemy and Erigyius, and had the Corinthians bring Thessalus to him in chains.\n", "\n===Accession===\n\nPausanius assassinates Philip II, Alexander's father, during his procession into the theatre\nThe emblema of the Stag Hunt Mosaic, , from Pella; the figure on the right is possibly Alexander the Great due to the date of the mosaic along with the depicted upsweep of his centrally-parted hair (''anastole''); the figure on the left wielding a double-edged axe (associated with Hephaistos) is perhaps Hephaestion, one of Alexander's loyal companions.\nIn summer 336 BC, while at Aegae attending the wedding of his daughter Cleopatra to Olympias's brother, Alexander I of Epirus, Philip was assassinated by the captain of his bodyguards, Pausanias. As Pausanias tried to escape, he tripped over a vine and was killed by his pursuers, including two of Alexander's companions, Perdiccas and Leonnatus. Alexander was proclaimed king on the spot by the nobles and army at the age of 20.\n\n===Consolidation of power===\nAlexander began his reign by eliminating potential rivals to the throne. He had his cousin, the former Amyntas IV, executed. He also had two Macedonian princes from the region of Lyncestis killed, but spared a third, Alexander Lyncestes. Olympias had Cleopatra Eurydice and Europa, her daughter by Philip, burned alive. When Alexander learned about this, he was furious. Alexander also ordered the murder of Attalus, who was in command of the advance guard of the army in Asia Minor and Cleopatra's uncle.\n\nAttalus was at that time corresponding with Demosthenes, regarding the possibility of defecting to Athens. Attalus also had severely insulted Alexander, and following Cleopatra's murder, Alexander may have considered him too dangerous to leave alive. Alexander spared Arrhidaeus, who was by all accounts mentally disabled, possibly as a result of poisoning by Olympias.\n\nNews of Philip's death roused many states into revolt, including Thebes, Athens, Thessaly, and the Thracian tribes north of Macedon. When news of the revolts reached Alexander, he responded quickly. Though advised to use diplomacy, Alexander mustered 3,000 Macedonian cavalry and rode south towards Thessaly. He found the Thessalian army occupying the pass between Mount Olympus and Mount Ossa, and ordered his men to ride over Mount Ossa. When the Thessalians awoke the next day, they found Alexander in their rear and promptly surrendered, adding their cavalry to Alexander's force. He then continued south towards the Peloponnese.\n\nAlexander stopped at Thermopylae, where he was recognized as the leader of the Amphictyonic League before heading south to Corinth. Athens sued for peace and Alexander pardoned the rebels. The famous encounter between Alexander and Diogenes the Cynic occurred during Alexander's stay in Corinth. When Alexander asked Diogenes what he could do for him, the philosopher disdainfully asked Alexander to stand a little to the side, as he was blocking the sunlight. This reply apparently delighted Alexander, who is reported to have said \"But verily, if I were not Alexander, I would like to be Diogenes.\" At Corinth, Alexander took the title of ''Hegemon'' (\"leader\") and, like Philip, was appointed commander for the coming war against Persia. He also received news of a Thracian uprising.\n\n===Balkan campaign===\n\nThe Macedonian phalanx at the \"Battle of the Carts\" against the Thracians in 335 BC\nBefore crossing to Asia, Alexander wanted to safeguard his northern borders. In the spring of 335 BC, he advanced to suppress several revolts. Starting from Amphipolis, he travelled east into the country of the \"Independent Thracians\"; and at Mount Haemus, the Macedonian army attacked and defeated the Thracian forces manning the heights. The Macedonians marched into the country of the Triballi, and defeated their army near the Lyginus river (a tributary of the Danube). Alexander then marched for three days to the Danube, encountering the Getae tribe on the opposite shore. Crossing the river at night, he surprised them and forced their army to retreat after the first cavalry skirmish.\n\nNews then reached Alexander that Cleitus, King of Illyria, and King Glaukias of the Taulantii were in open revolt against his authority. Marching west into Illyria, Alexander defeated each in turn, forcing the two rulers to flee with their troops. With these victories, he secured his northern frontier.\n\nWhile Alexander campaigned north, the Thebans and Athenians rebelled once again. Alexander immediately headed south. While the other cities again hesitated, Thebes decided to fight. The Theban resistance was ineffective, and Alexander razed the city and divided its territory between the other Boeotian cities. The end of Thebes cowed Athens, leaving all of Greece temporarily at peace. Alexander then set out on his Asian campaign, leaving Antipater as regent.\n", "\n\n===Asia Minor===\nMap of Alexander's empire and his route\n\n\nGérard Audran after Charles LeBrun,  'Alexander Entering Babylon,' original print first published 1675, engraving,  Department of Image Collections, National Gallery of Art Library, Washington, DC.\n''Alexander Cuts the Gordian Knot'' (1767) by Jean-Simon Berthélemy\nAfter his victory at the Battle of Chaeronea (338 BC), Philip II began the work of establishing himself as ''hēgemṓn'' () of a league which according to Diodorus was to wage a campaign against the Persians for the sundry grievances Greece suffered in 480 and free the Greek cities of the western coast and islands from Achaemenid rule. In 336 he sent Parmenion, with Amyntas, Andromenes and Attalus, and an army of 10,000 men into Anatolia to make preparations for an invasion. At first, all went well. The Greek cities on the western coast of Anatolia revolted until the news arrived that Philip had been murdered and had been succeeded by his young son Alexander. The Macedonians were demoralized by Philip's death and were subsequently defeated near Magnesia by the Achaemenids under the command of the mercenary Memnon of Rhodes.\n\nTaking over the invasion project of Philip II, Alexander's army crossed the Hellespont in 334 BC with approximately 48,100 soldiers, 6,100 cavalry and a fleet of 120 ships with crews numbering 38,000, drawn from Macedon and various Greek city-states, mercenaries, and feudally raised soldiers from Thrace, Paionia, and Illyria. He showed his intent to conquer the entirety of the Persian Empire by throwing a spear into Asian soil and saying he accepted Asia as a gift from the gods. This also showed Alexander's eagerness to fight, in contrast to his father's preference for diplomacy.\n\nAfter an initial victory against Persian forces at the Battle of the Granicus, Alexander accepted the surrender of the Persian provincial capital and treasury of Sardis; he then proceeded along the Ionian coast, granting autonomy and democracy to the cities. Miletus, held by Achaemenid forces, required a delicate siege operation, with Persian naval forces nearby. Further south, at Halicarnassus, in Caria, Alexander successfully waged his first large-scale siege, eventually forcing his opponents, the mercenary captain Memnon of Rhodes and the Persian satrap of Caria, Orontobates, to withdraw by sea. Alexander left the government of Caria to a member of the Hecatomnid dynasty, Ada, who adopted Alexander.\n\nFrom Halicarnassus, Alexander proceeded into mountainous Lycia and the Pamphylian plain, asserting control over all coastal cities to deny the Persians naval bases. From Pamphylia onwards the coast held no major ports and Alexander moved inland. At Termessos, Alexander humbled but did not storm the Pisidian city. At the ancient Phrygian capital of Gordium, Alexander \"undid\" the hitherto unsolvable Gordian Knot, a feat said to await the future \"king of Asia\". According to the story, Alexander proclaimed that it did not matter how the knot was undone and hacked it apart with his sword.\n\n===The Levant and Syria===\n\n\nIn spring 333 BC, Alexander crossed the Taurus into Cilicia. After a long pause due to an illness, he marched on towards Syria. Though outmanoeuvered by Darius's significantly larger army, he marched back to Cilicia, where he defeated Darius at Issus. Darius fled the battle, causing his army to collapse, and left behind his wife, his two daughters, his mother Sisygambis, and a fabulous treasure. He offered a peace treaty that included the lands he had already lost, and a ransom of 10,000 talents for his family. Alexander replied that since he was now king of Asia, it was he alone who decided territorial divisions.\nAlexander proceeded to take possession of Syria, and most of the coast of the Levant. In the following year, 332 BC, he was forced to attack Tyre, which he captured after a long and difficult siege. The men of military age were massacred and the women and children sold into slavery.\n\n===Egypt===\n\nName of Alexander the Great in Egyptian hieroglyphs (written from right to left), , Egypt. Louvre Museum.\n\nWhen Alexander destroyed Tyre, most of the towns on the route to Egypt quickly capitulated. However, Alexander was met with resistance at Gaza. The stronghold was heavily fortified and built on a hill, requiring a siege. When \"his engineers pointed out to him that because of the height of the mound it would be impossible... this encouraged Alexander all the more to make the\nattempt\". After three unsuccessful assaults, the stronghold fell, but not before Alexander had received a serious shoulder wound. As in Tyre, men of military age were put to the sword and the women and children were sold into slavery.\n\nEgypt was only one of a large number of territories taken by Alexander from the Persians. After his trip to Siwa, Alexander was crowned in the temple of Ptah at Memphis. It appears that the Egyptian people did not find it disturbing that he was a foreigner - nor that he was absent for virtually his entire reign. Alexander restored the temples neglected by the Persians and dedicated new monuments to the Egyptian gods. In the temple of Luxor, near Karnak, he built a chapel for the sacred barge. During his brief months in Egypt, he reformed the taxation system on the Greek models and organized the military occupation of the country, but, early in 331 BCE, he left for Asia in pursuit of the Persians.\n\nAlexander advanced on Egypt in later 332 BC, where he was regarded as a liberator. To legitimize taking power and be recognized as the descendant of the long line of pharaohs, Alexander made sacrifices to the gods at Memphis and went to consult the famous oracle of Amun-Ra at the Siwa Oasis. He was pronounced son of the deity Amun at the Oracle of Siwa Oasis in the Libyan desert. Henceforth, Alexander often referred to Zeus-Ammon as his true father, and after his death, currency depicted him adorned with the Horns of Ammon as a symbol of his divinity. The Greeks interpreted this message - one that the gods addressed to all pharaohs - as a prophecy.\n\nDuring his stay in Egypt, he founded Alexandria, which would become the prosperous capital of the Ptolemaic Kingdom after his death. Control of Egypt passed to Ptolemy I (son of Lagos), the founder of the Ptolemaic Dynasty (305-30 BCE) after the death of Alexander.\n\n===Assyria and Babylonia===\n\nLeaving Egypt in 331 BC, Alexander marched eastward into Achaemenid Assyria in Upper Mesopotamia (now northern Iraq) and defeated Darius again at the Battle of Gaugamela. Darius once more fled the field, and Alexander chased him as far as Arbela. Gaugamela would be the final and decisive encounter between the two. Darius fled over the mountains to Ecbatana (modern Hamadan) while Alexander captured Babylon.\n\nBabylonian astronomical diaries says that \"the king of the world, Alexander\" sends his scouts with a message to the people of Babylon before entering the city; \"I shall not enter your houses\".\n\n===Persia===\n\nPersian Gate in modern-day Iran; the road was built in the 1990s.\n\nFrom Babylon, Alexander went to Susa, one of the Achaemenid capitals, and captured its treasury. He sent the bulk of his army to the Persian ceremonial capital of Persepolis via the Persian Royal Road. Alexander himself took selected troops on the direct route to the city. He then stormed the pass of the Persian Gates (in the modern Zagros Mountains) which had been blocked by a Persian army under Ariobarzanes and then hurried to Persepolis before its garrison could loot the treasury.\n\nOn entering Persepolis, Alexander allowed his troops to loot the city for several days. Alexander stayed in Persepolis for five months. During his stay a fire broke out in the eastern palace of Xerxes I and spread to the rest of the city. Possible causes include a drunken accident or deliberate revenge for the burning of the Acropolis of Athens during the Second Persian War by Xerxes; Plutarch and Diodorus allege that Alexander's companion, the hetaera Thaïs, instigated and started the fire. Even as he watched the city burn, Alexander immediately began to regret his decision. Plutarch claims that he ordered his men to put out the fires, but that the flames had already spread to most of the city. Curtius claims that Alexander did not regret his decision until the next morning. Plutarch recounts an anecdote in which Alexander pauses and talks to a fallen statue of Xerxes as if it were a live person:\n\n\n\n===Fall of the Empire and the East===\nAdministrative document from Bactria dated to the seventh year of Alexander's reign (324 BC), bearing the first known use of the \"Alexandros\" form of his name, Khalili Collection of Aramaic Documents\nAlexander then chased Darius, first into Media, and then Parthia. The Persian king no longer controlled his own destiny, and was taken prisoner by Bessus, his Bactrian satrap and kinsman. As Alexander approached, Bessus had his men fatally stab the Great King and then declared himself Darius's successor as Artaxerxes V, before retreating into Central Asia to launch a guerrilla campaign against Alexander. Alexander buried Darius's remains next to his Achaemenid predecessors in a regal funeral. He claimed that, while dying, Darius had named him as his successor to the Achaemenid throne. The Achaemenid Empire is normally considered to have fallen with Darius. However, as basic forms of commmunity life and the general structure of government were maintained and resuscitated by Alexander under his own rule, he, in the words of the Iranologist Pierre Briant \"may therefore be considered to have acted in many ways as the ''last of the Achaemenids''.\"\n\nAlexander viewed Bessus as a usurper and set out to defeat him. This campaign, initially against Bessus, turned into a grand tour of central Asia. Alexander founded a series of new cities, all called Alexandria, including modern Kandahar in Afghanistan, and Alexandria Eschate (\"The Furthest\") in modern Tajikistan. The campaign took Alexander through Media, Parthia, Aria (West Afghanistan), Drangiana, Arachosia (South and Central Afghanistan), Bactria (North and Central Afghanistan), and Scythia.\n\nIn 329 BC, Spitamenes, who held an undefined position in the satrapy of Sogdiana, betrayed Bessus to Ptolemy, one of Alexander's trusted companions, and Bessus was executed. However, when, at some point later, Alexander was on the Jaxartes dealing with an incursion by a horse nomad army, Spitamenes raised Sogdiana in revolt. Alexander personally defeated the Scythians at the Battle of Jaxartes and immediately launched a campaign against Spitamenes, defeating him in the Battle of Gabai. After the defeat, Spitamenes was killed by his own men, who then sued for peace.\n\n===Problems and plots===\n Cleitus'', by André Castaigne (1898–1899)\n\nDuring this time, Alexander adopted some elements of Persian dress and customs at his court, notably the custom of ''proskynesis'', either a symbolic kissing of the hand, or prostration on the ground, that Persians showed to their social superiors. This was one aspect of Alexander's broad strategy aimed at securing the aid and support of the Iranian upper classes. The Greeks however regarded the gesture of ''proskynesis'' as the province of deities and believed that Alexander meant to deify himself by requiring it. This cost him the sympathies of many of his countrymen, and he eventually abandoned it.\n\nDuring the long rule of the Achaemenids, the elite positions in many segments of the empire including the central government, the army, and the many satrapies were specifically reserved for Iranians and to a major degree Persian noblemen. The latter were in many cases additionally connected through marriage alliances with the royal Achaemenid family. This created a problem for Alexander as to whether he had to make use of the various segments and people that had given the empire its solidity and unity for a lengthy period of time. Pierre Briant explains that Alexander realized that it was insufficient to merely exploit the internal contradictions within the imperial system as in Asia Minor, Babylonia or Egypt; he also had to (re)create a central government with or without the support of the Iranians. As early as 334 BC he demonstrated awareness of this, when he challenged incumbent King Darius III \"by appropriating the main elements of the Achaemenid monarchy's ideology, particularly the theme of the king who protects the lands and the peasants\". Alexander wrote a letter in 332 BC to Darius III, wherein he argued that he was worthier than Darius \"to succeed to the Achaemenid throne\". However, Alexander's eventual decision to burn the Achaemenid palace at Persepolis in conjunction with the major rejection and opposition of the \"entire Persian people\" made it impracticable for him to pose himself as Darius' legitimate successor. Against Bessus (Artaxerxes V) however, Briant adds, Alexander reasserted \"his claim to legitimacy as the avenger of Darius III\".\n\nA plot against his life was revealed, and one of his officers, Philotas, was executed for failing to alert Alexander. The death of the son necessitated the death of the father, and thus Parmenion, who had been charged with guarding the treasury at Ecbatana, was assassinated at Alexander's command, to prevent attempts at vengeance. Most infamously, Alexander personally killed the man who had saved his life at Granicus, Cleitus the Black, during a violent drunken altercation at Maracanda (modern day Samarkand in Uzbekistan), in which Cleitus accused Alexander of several judgmental mistakes and most especially, of having forgotten the Macedonian ways in favour of a corrupt oriental lifestyle.\n\nLater, in the Central Asian campaign, a second plot against his life was revealed, this one instigated by his own royal pages. His official historian, Callisthenes of Olynthus, was implicated in the plot, and in the ''Anabasis of Alexander'', Arrian states that Callisthenes and the pages were then tortured on the rack as punishment, and likely died soon after. It remains unclear if Callisthenes was actually involved in the plot, for prior to his accusation he had fallen out of favour by leading the opposition to the attempt to introduce proskynesis.\n\n===Macedon in Alexander's absence===\nWhen Alexander set out for Asia, he left his general Antipater, an experienced military and political leader and part of Philip II's \"Old Guard\", in charge of Macedon. Alexander's sacking of Thebes ensured that Greece remained quiet during his absence. The one exception was a call to arms by Spartan king Agis III in 331 BC, whom Antipater defeated and killed in the battle of Megalopolis. Antipater referred the Spartans' punishment to the League of Corinth, which then deferred to Alexander, who chose to pardon them. There was also considerable friction between Antipater and Olympias, and each complained to Alexander about the other.\n\nIn general, Greece enjoyed a period of peace and prosperity during Alexander's campaign in Asia. Alexander sent back vast sums from his conquest, which stimulated the economy and increased trade across his empire. However, Alexander's constant demands for troops and the migration of Macedonians throughout his empire depleted Macedon's strength, greatly weakening it in the years after Alexander, and ultimately led to its subjugation by Rome after the Third Macedonian War (171–168 BC).\n", "\n\n===Forays into the Indian subcontinent===\n ''The Phalanx Attacking the Centre in the Battle of the Hydaspes'' by André Castaigne (1898–1899)\nAlexander's invasion of the Indian subcontinent\nAfter the death of Spitamenes and his marriage to Roxana (Raoxshna in Old Iranian) to cement relations with his new satrapies, Alexander turned to the Indian subcontinent. He invited the chieftains of the former satrapy of Gandhara (a region presently straddling eastern Afghanistan and northern Pakistan), to come to him and submit to his authority. Omphis (Indian name Ambhi), the ruler of Taxila, whose kingdom extended from the Indus to the Hydaspes (Jhelum), complied, but the chieftains of some hill clans, including the Aspasioi and Assakenoi sections of the Kambojas (known in Indian texts also as Ashvayanas and Ashvakayanas), refused to submit. Ambhi hastened to relieve Alexander of his apprehension and met him with valuable presents, placing himself and all his forces at his disposal. Alexander not only returned Ambhi his title and the gifts but he also presented him with a wardrobe of \"Persian robes, gold and silver ornaments, 30 horses and 1,000 talents in gold\". Alexander was emboldened to divide his forces, and Ambhi assisted Hephaestion and Perdiccas in constructing a bridge over the Indus where it bends at Hund, supplied their troops with provisions, and received Alexander himself, and his whole army, in his capital city of Taxila, with every demonstration of friendship and the most liberal hospitality.\n\nOn the subsequent advance of the Macedonian king, Taxiles accompanied him with a force of 5,000 men and took part in the battle of the Hydaspes River. After that victory he was sent by Alexander in pursuit of Porus, to whom he was charged to offer favourable terms, but narrowly escaped losing his life at the hands of his old enemy. Subsequently, however, the two rivals were reconciled by the personal mediation of Alexander; and Taxiles, after having contributed zealously to the equipment of the fleet on the Hydaspes, was entrusted by the king with the government of the whole territory between that river and the Indus. A considerable accession of power was granted him after the death of Philip, son of Machatas; and he was allowed to retain his authority at the death of Alexander himself (323 BC), as well as in the subsequent partition of the provinces at Triparadisus, 321 BC.\n\nIn the winter of 327/326 BC, Alexander personally led a campaign against the Aspasioi of Kunar valleys, the Guraeans of the Guraeus valley, and the Assakenoi of the Swat and Buner valleys. A fierce contest ensued with the Aspasioi in which Alexander was wounded in the shoulder by a dart, but eventually the Aspasioi lost. Alexander then faced the Assakenoi, who fought against him from the strongholds of Massaga, Ora and Aornos.\n\nThe fort of Massaga was reduced only after days of bloody fighting, in which Alexander was wounded seriously in the ankle. According to Curtius, \"Not only did Alexander slaughter the entire population of Massaga, but also did he reduce its buildings to rubble.\" A similar slaughter followed at Ora. In the aftermath of Massaga and Ora, numerous Assakenians fled to the fortress of Aornos. Alexander followed close behind and captured the strategic hill-fort after four bloody days.\n\n''Porus surrenders to Alexander''\nAfter Aornos, Alexander crossed the Indus and fought and won an epic battle against King Porus, who ruled a region lying between the Hydaspes and the Acesines (Chenab), in what is now the Punjab, in the Battle of the Hydaspes in 326 BC. Alexander was impressed by Porus's bravery, and made him an ally. He appointed Porus as satrap, and added to Porus's territory land that he did not previously own, towards the south-east, up to the Hyphasis (Beas). Choosing a local helped him control these lands so distant from Greece. Alexander founded two cities on opposite sides of the Hydaspes river, naming one Bucephala, in honour of his horse, who died around this time. The other was Nicaea (Victory), thought to be located at the site of modern-day Mong, Punjab. Philostratus the Elder in the Life of Apollonius of Tyana writes that in the army of Porus there was an elephant who fought brave against Alexander's army and Alexander dedicated it to the Helios (Sun) and named it Ajax, because he thought that a so great animal deserved a great name. The elephant had gold rings around its tusks and an inscription was on them written in Greek: \"Alexander the son of Zeus dedicates Ajax to the Helios\" (ΑΛΕΞΑΝΔΡΟΣ Ο ΔΙΟΣ ΤΟΝ ΑΙΑΝΤΑ ΤΩΙ ΗΛΙΩΙ).\n\n===Revolt of the army===\nAsia in 323 BC, the Nanda Empire and the Gangaridai of the Indian subcontinent, in relation to Alexander's Empire and neighbours\n\nEast of Porus's kingdom, near the Ganges River, was the Nanda Empire of Magadha, and further east, the Gangaridai Empire of Bengal region of the Indian subcontinent. Fearing the prospect of facing other large armies and exhausted by years of campaigning, Alexander's army mutinied at the Hyphasis River (Beas), refusing to march farther east. This river thus marks the easternmost extent of Alexander's conquests.\n\n\n\nAlexander tried to persuade his soldiers to march farther, but his general Coenus pleaded with him to change his opinion and return; the men, he said, \"longed to again see their parents, their wives and children, their homeland\". Alexander eventually agreed and turned south, marching along the Indus. Along the way his army conquered the Malhi (in modern-day Multan) and other Indian tribes and Alexander sustained an injury during the siege.\n\nAlexander sent much of his army to Carmania (modern southern Iran) with general Craterus, and commissioned a fleet to explore the Persian Gulf shore under his admiral Nearchus, while he led the rest back to Persia through the more difficult southern route along the Gedrosian Desert and Makran. Alexander reached Susa in 324 BC, but not before losing many men to the harsh desert.\n", "Alexander (left) and Hephaestion (right): Both were connected by a tight man-to-man friendship\nDiscovering that many of his satraps and military governors had misbehaved in his absence, Alexander executed several of them as examples on his way to Susa. As a gesture of thanks, he paid off the debts of his soldiers, and announced that he would send over-aged and disabled veterans back to Macedon, led by Craterus. His troops misunderstood his intention and mutinied at the town of Opis. They refused to be sent away and criticized his adoption of Persian customs and dress and the introduction of Persian officers and soldiers into Macedonian units.\n\nAfter three days, unable to persuade his men to back down, Alexander gave Persians command posts in the army and conferred Macedonian military titles upon Persian units. The Macedonians quickly begged forgiveness, which Alexander accepted, and held a great banquet with several thousand of his men. In an attempt to craft a lasting harmony between his Macedonian and Persian subjects, Alexander held a mass marriage of his senior officers to Persian and other noblewomen at Susa, but few of those marriages seem to have lasted much beyond a year. \n\n''Alexander at the Tomb of Cyrus the Great'', by Pierre-Henri de Valenciennes (1796)\nMeanwhile, upon his return to Persia, Alexander learned that guards of the tomb of Cyrus the Great in Pasargadae had desecrated it, and swiftly executed them. Alexander admired Cyrus the Great, from an early age reading Xenophon's ''Cyropaedia'', which described Cyrus's heroism in battle and governance as a king and legislator. During his visit to Pasargadae Alexander ordered his architect Aristobulus to decorate the interior of the sepulchral chamber of Cyrus's tomb.\n\nAfterwards, Alexander travelled to Ecbatana to retrieve the bulk of the Persian treasure. There, his closest friend and possible lover, Hephaestion, died of illness or poisoning. Hephaestion's death devastated Alexander, and he ordered the preparation of an expensive funeral pyre in Babylon, as well as a decree for public mourning. Back in Babylon, Alexander planned a series of new campaigns, beginning with an invasion of Arabia, but he would not have a chance to realize them, as he died shortly after Hephaestion.\n", "\nA Babylonian astronomical diary (c. 323–322 BC) recording the death of Alexander (British Museum, London)\nOn either 10 or 11 June 323 BC, Alexander died in the palace of Nebuchadnezzar II, in Babylon, at age 32. There are two different versions of Alexander's death, and details of the death differ slightly in each. Plutarch's account is that roughly 14 days before his death, Alexander entertained admiral Nearchus and spent the night and next day drinking with Medius of Larissa. He developed a fever, which worsened until he was unable to speak. The common soldiers, anxious about his health, were granted the right to file past him as he silently waved at them. In the second account, Diodorus recounts that Alexander was struck with pain after downing a large bowl of unmixed wine in honour of Heracles, followed by 11 days of weakness; he did not develop a fever, instead dying after some agony. Arrian also mentioned this as an alternative, but Plutarch specifically denied this claim.\n\nGiven the propensity of the Macedonian aristocracy to assassination, foul play featured in multiple accounts of his death. Diodorus, Plutarch, Arrian and Justin all mentioned the theory that Alexander was poisoned. Justin stated that Alexander was the victim of a poisoning conspiracy, Plutarch dismissed it as a fabrication, while both Diodorus and Arrian noted that they mentioned it only for the sake of completeness. The accounts were nevertheless fairly consistent in designating Antipater, recently removed as Macedonian viceroy, and at odds with Olympias, as the head of the alleged plot. Perhaps taking his summons to Babylon as a death sentence, and having seen the fate of Parmenion and Philotas, Antipater purportedly arranged for Alexander to be poisoned by his son Iollas, who was Alexander's wine-pourer. There was even a suggestion that Aristotle may have participated.\n\nThe strongest argument against the poison theory is the fact that twelve days passed between the start of his illness and his death; such long-acting poisons were probably not available. However, in a 2003 BBC documentary investigating the death of Alexander, Leo Schep from the New Zealand National Poisons Centre proposed that the plant white hellebore (''Veratrum album''), which was known in antiquity, may have been used to poison Alexander. In a 2014 manuscript in the journal ''Clinical Toxicology'', Schep suggested Alexander's wine was spiked with ''Veratrum album'', and that this would produce poisoning symptoms that match the course of events described in the ''Alexander Romance''. ''Veratrum album'' poisoning can have a prolonged course and it was suggested that if Alexander was poisoned, ''Veratrum album'' offers the most plausible cause. Another poisoning explanation put forward in 2010 proposed that the circumstances of his death were compatible with poisoning by water of the river Styx (modern-day Mavroneri in Arcadia, Greece) that contained calicheamicin, a dangerous compound produced by bacteria.\n\nSeveral natural causes (diseases) have been suggested, including malaria and typhoid fever. A 1998 article in the ''New England Journal of Medicine'' attributed his death to typhoid fever complicated by bowel perforation and ascending paralysis. Another recent analysis suggested pyogenic (infectious) spondylitis or meningitis. Other illnesses fit the symptoms, including acute pancreatitis and West Nile virus. Natural-cause theories also tend to emphasize that Alexander's health may have been in general decline after years of heavy drinking and severe wounds. The anguish that Alexander felt after Hephaestion's death may also have contributed to his declining health.\n\n===After death===\n\nAlexander's body was laid in a gold anthropoid sarcophagus that was filled with honey, which was in turn placed in a gold casket. According to Aelian, a seer called Aristander foretold that the land where Alexander was laid to rest \"would be happy and unvanquishable forever\". Perhaps more likely, the successors may have seen possession of the body as a symbol of legitimacy, since burying the prior king was a royal prerogative.\n\n19th-century depiction of Alexander's funeral procession, based on the description by Diodorus Siculus\nWhile Alexander's funeral cortege was on its way to Macedon, Ptolemy seized it and took it temporarily to Memphis. His successor, Ptolemy II Philadelphus, transferred the sarcophagus to Alexandria, where it remained until at least late Antiquity. Ptolemy IX Lathyros, one of Ptolemy's final successors, replaced Alexander's sarcophagus with a glass one so he could convert the original to coinage. The recent discovery of an enormous tomb in northern Greece, at Amphipolis, dating from the time of Alexander the Great has given rise to speculation that its original intent was to be the burial place of Alexander. This would fit with the intended destination of Alexander's funeral cortege. However, the memorial was found to be dedicated to the dearest friend of Alexander the Great, Hephaestion.\n\nDetail of Alexander on the Alexander Sarcophagus\nPompey, Julius Caesar and Augustus all visited the tomb in Alexandria, where Augustus, allegedly, accidentally knocked the nose off. Caligula was said to have taken Alexander's breastplate from the tomb for his own use. Around AD 200, Emperor Septimius Severus closed Alexander's tomb to the public. His son and successor, Caracalla, a great admirer, visited the tomb during his own reign. After this, details on the fate of the tomb are hazy.\n\nThe so-called \"Alexander Sarcophagus\", discovered near Sidon and now in the Istanbul Archaeology Museum, is so named not because it was thought to have contained Alexander's remains, but because its bas-reliefs depict Alexander and his companions fighting the Persians and hunting. It was originally thought to have been the sarcophagus of Abdalonymus (died 311 BC), the king of Sidon appointed by Alexander immediately following the battle of Issus in 331. However, more recently, it has been suggested that it may date from earlier than Abdalonymus's death.\n\nDemades likened the Macedonian army, after the death of Alexander, to the blinded Cyclops, due to the many random and disorderly movements that it made. In addition, Leosthenes, also, likened the anarchy between the generals, after Alexander's death, to the blinded Cyclops \"who after he had lost his eye went feeling and groping about with his hands before him, not knowing where to lay them\".\n\n===Division of the empire===\n\nKingdoms of the Diadochi in 301 BC: the Ptolemaic Kingdom (dark blue), the Seleucid Empire (yellow), Kingdom of Pergamon (orange), and Kingdom of Macedon (green). Also shown are the Roman Republic (light blue), the Carthaginian Republic (purple), and the Kingdom of Epirus (red).\n\nAlexander's death was so sudden that when reports of his death reached Greece, they were not immediately believed. Alexander had no obvious or legitimate heir, his son Alexander IV by Roxane being born after Alexander's death. According to Diodorus, Alexander's companions asked him on his deathbed to whom he bequeathed his kingdom; his laconic reply was \"tôi kratistôi\"—\"to the strongest\". Another theory is that his successors wilfully or erroneously misheard \"tôi Kraterôi\"—\"to Craterus\", the general leading his Macedonian troops home and newly entrusted with the regency of Macedonia.\n\nArrian and Plutarch claimed that Alexander was speechless by this point, implying that this was an apocryphal story. Diodorus, Curtius and Justin offered the more plausible story that Alexander passed his signet ring to Perdiccas, a bodyguard and leader of the companion cavalry, in front of witnesses, thereby nominating him.\n\nPerdiccas initially did not claim power, instead suggesting that Roxane's baby would be king, if male; with himself, Craterus, Leonnatus, and Antipater as guardians. However, the infantry, under the command of Meleager, rejected this arrangement since they had been excluded from the discussion. Instead, they supported Alexander's half-brother Philip Arrhidaeus. Eventually, the two sides reconciled, and after the birth of Alexander IV, he and Philip III were appointed joint kings, albeit in name only.\n\nDissension and rivalry soon afflicted the Macedonians, however. The satrapies handed out by Perdiccas at the Partition of Babylon became power bases each general used to bid for power. After the assassination of Perdiccas in 321 BC, Macedonian unity collapsed, and 40 years of war between \"The Successors\" (''Diadochi'') ensued before the Hellenistic world settled into four stable power blocs: Ptolemaic Egypt, Seleucid Mesopotamia and Central Asia, Attalid Anatolia, and Antigonid Macedon. In the process, both Alexander IV and Philip III were murdered.\n\n===Last plans===\nA coin of Alexander the Great struck by Balakros or his successor Menes, both former ''somatophylakes'' (bodyguards) of Alexander, when they held the position of satrap of Cilicia in the lifetime of Alexander, circa 333-327 BC. The obverse shows Heracles, ancestor of the Macedonian royal line and the reverse shows a seated Zeus Aëtophoros.\nDiodorus stated that Alexander had given detailed written instructions to Craterus some time before his death, which are known as Alexander's \"last plans\". Craterus started to carry out Alexander's commands, but the successors chose not to further implement them, on the grounds they were impractical and extravagant. Furthermore, Perdiccas had read the notebooks containing Alexander's last plans to the Macedonian troops in Babylon, who voted not to carry them out.\n\nAccording to Diodorus, Alexander's last plans called for military expansion into the southern and western Mediterranean, monumental constructions, and the intermixing of Eastern and Western populations. It included:\n* Construction of 1,000 ships larger than triremes, along with harbours and a road running along the African coast all the way to the Pillars of Hercules, to be used for an invasion of Carthage and the western Mediterranean;\n* Erection of great temples in Delos, Delphi, Dodona, Dium, Amphipolis, all costing 1,500 talents, and a monumental temple to Athena at Troy\n* Amalgamation of small settlements into larger cities (\"synoecisms\") and the \"transplant of populations from Asia to Europe and in the opposite direction from Europe to Asia, in order to bring the largest continent to common unity and to friendship by means of intermarriage and family ties\"\n* Construction of a monumental tomb for his father Philip, \"to match the greatest of the pyramids of Egypt\"\n* Conquest of Arabia\n* Circumnavigation of Africa\n\nThe enormous scale of these plans has led many scholars to doubt their historicity. Ernst Badian argued that they were exaggerated by Perdiccas in order to ensure that the Macedonian troops voted not to carry them out. Other scholars have proposed that they were invented by later authors within the tradition of the Alexander Romance.\n", "\n===Generalship===\nThe Battle of the Granicus, 334 BC\nThe Battle of Issus, 333 BC\n\nAlexander perhaps earned the epithet \"the Great\" due to his unparalleled success as a military commander; he never lost a battle, despite typically being outnumbered. This was due to use of terrain, phalanx and cavalry tactics, bold strategy, and the fierce loyalty of his troops. The Macedonian phalanx, armed with the sarissa, a spear  long, had been developed and perfected by Philip II through rigorous training, and Alexander used its speed and manoeuvrability to great effect against larger but more disparate Persian forces. Alexander also recognized the potential for disunity among his diverse army, which employed various languages and weapons. He overcame this by being personally involved in battle, in the manner of a Macedonian king.\n\nIn his first battle in Asia, at Granicus, Alexander used only a small part of his forces, perhaps 13,000 infantry with 5,000 cavalry, against a much larger Persian force of 40,000. Alexander placed the phalanx at the center and cavalry and archers on the wings, so that his line matched the length of the Persian cavalry line, about . By contrast, the Persian infantry was stationed behind its cavalry. This ensured that Alexander would not be outflanked, while his phalanx, armed with long pikes, had a considerable advantage over the Persians' scimitars and javelins. Macedonian losses were negligible compared to those of the Persians.\n\nAt Issus in 333 BC, his first confrontation with Darius, he used the same deployment, and again the central phalanx pushed through. Alexander personally led the charge in the center, routing the opposing army. At the decisive encounter with Darius at Gaugamela, Darius equipped his chariots with scythes on the wheels to break up the phalanx and equipped his cavalry with pikes. Alexander arranged a double phalanx, with the center advancing at an angle, parting when the chariots bore down and then reforming. The advance was successful and broke Darius's center, causing the latter to flee once again.\n\nWhen faced with opponents who used unfamiliar fighting techniques, such as in Central Asia and India, Alexander adapted his forces to his opponents' style. Thus, in Bactria and Sogdiana, Alexander successfully used his javelin throwers and archers to prevent outflanking movements, while massing his cavalry at the center. In India, confronted by Porus's elephant corps, the Macedonians opened their ranks to envelop the elephants and used their sarissas to strike upwards and dislodge the elephants' handlers.\n\n===Physical appearance===\nAlexander Cameo by Pyrgoteles\nHistorical sources frequently give conflicting accounts of Alexander's appearance, and the earliest sources are the most scant in their detail. During his lifetime, Alexander carefully curated his image by commissioning works from famous and great artists of the time. This included commissioning sculptures by Lysippos, paintings by Apelles and gem engravings by Pyrgoteles. Ancient authors recorded that Alexander was so pleased with portraits of himself created by Lysippos that he forbade other sculptors from crafting his image; scholars today, however, find the claim dubious. Nevertheless, Andrew Stewart highlights the fact that artistic portraits, not least because of who they are commissioned by, are always partisan, and that artistic portrayals of Alexander \"seek to legitimize him (or, by extension, his Successors), to interpret him to their audiences, to answer their critiques, and to persuade them of his greatness\", and thus should be considered within a framework of \"praise and blame\", in the same way sources such as praise poetry are. Despite those caveats, Lysippos's sculpture, famous for its naturalism, as opposed to a stiffer, more static pose, is thought to be the most faithful depiction.\n\nCurtius Rufus, a Roman historian from the first century AD, who wrote the ''Histories of Alexander the Great'', gives this account of Alexander sitting on the throne of Darius III:\n\n\n\nBoth Curtius and Diodorus report a story that when Darius III's mother, Sisygambis, first met Alexander and Hephaestion, she assumed that the latter was Alexander because he was the taller and more handsome of the two.\n\nAlexander portrayal by Lysippos\nDetails from the Alexander Sarcophagus show that he had a fair complexion with ruddy cheeks. This is in line with the description of him given by the Greek biographer Plutarch ():\n\n\n\nHistorians have understood the detail of the pleasant odour attributed to Alexander as stemming from a belief in ancient Greece that  pleasant scents are characteristic of gods and heroes.\n\nThe Alexander Mosaic and contemporary coins portray Alexander with \"a straight nose, a slightly protruding jaw, full lips and eyes deep set beneath a strongly pronounced forehead\". Although the Alexander Mosaic depicts him with brown hair, the ancient historian Aelian (c. 175 – c. 235 AD), in his ''Varia Historia'' (12.14), describes Alexander as having fair, or golden, hair.  \n\n\n===Personality===\nAlexander (left), wearing a ''kausia'' and fighting an Asiatic lion with his friend Craterus (detail); late 4th century BC mosaic, Pella Museum\n\nAs is the case with personality traits in general, Alexander's prominent personality traits reflected those of his parents. His mother had huge ambitions, and encouraged him to believe it was his destiny to conquer the Persian Empire. Olympias's influence instilled a sense of destiny in him, and Plutarch tells how his ambition \"kept his spirit serious and lofty in advance of his years\". However, his father Philip was probably Alexander's most immediate and influential role model, as the young Alexander watched him campaign practically every year, winning victory after victory while ignoring severe wounds. Alexander's relationship with his father \"forged\" the competitive side of his personality; he had a need to outdo his father, illustrated by his reckless behavior in battle. While Alexander worried that his father would leave him \"no great or brilliant achievement to be displayed to the world\", he also downplayed his father's achievements to his companions.\n\nAccording to Plutarch, among Alexander's traits were a violent temper and rash, impulsive nature, which undoubtedly contributed to some of his decisions. Although Alexander was stubborn and did not respond well to orders from his father, he was open to reasoned debate. He had a calmer side—perceptive, logical, and calculating. He had a great desire for knowledge, a love for philosophy, and was an avid reader. This was no doubt in part due to Aristotle's tutelage; Alexander was intelligent and quick to learn. His intelligent and rational side was amply demonstrated by his ability and success as a general. He had great self-restraint in \"pleasures of the body\", in contrast with his lack of self-control with alcohol.\n\nRoman copy of an original 3rd century BC Greek bust depicting Alexander the Great, Ny Carlsberg Glyptotek, Copenhagen\nAlexander was erudite and patronized both arts and sciences. However, he had little interest in sports or the Olympic Games (unlike his father), seeking only the Homeric ideals of honour (''timê'') and glory (''kudos''). He had great charisma and force of personality, characteristics which made him a great leader. His unique abilities were further demonstrated by the inability of any of his generals to unite Macedonia and retain the Empire after his death—only Alexander had the ability to do so.\n\nDuring his final years, and especially after the death of Hephaestion, Alexander began to exhibit signs of megalomania and paranoia. His extraordinary achievements, coupled with his own ineffable sense of destiny and the flattery of his companions, may have combined to produce this effect. His delusions of grandeur are readily visible in his will and in his desire to conquer the world, in as much as he is by various sources described as having ''boundless ambition'', an epithet, the meaning of which has descended into an historical cliché.\n\nHe appears to have believed himself a deity, or at least sought to deify himself. Olympias always insisted to him that he was the son of Zeus, a theory apparently confirmed to him by the oracle of Amun at Siwa. He began to identify himself as the son of Zeus-Ammon. Alexander adopted elements of Persian dress and customs at court, notably ''proskynesis'', which was one aspect of Alexander's broad strategy aimed at securing the aid and support of the Iranian upper classes; however the practise of ''proskynesis'' was disapproved by the Macedonians, and they were unwilling to perform it. This behaviour cost him the sympathies of many of his countrymen. However, Alexander also was a pragmatic ruler who understood the difficulties of ruling culturally disparate peoples, many of whom lived in kingdoms where the king was divine. Thus, rather than megalomania, his behaviour may simply have been a practical attempt at strengthening his rule and keeping his empire together.\n\n===Personal relationships===\n\nA mural in Pompeii, depicting the marriage of Alexander to Barsine (Stateira) in 324 BC; the couple are apparently dressed as Ares and Aphrodite.\nAlexander married three times: Roxana, daughter of the Sogdian nobleman Oxyartes of Bactria, out of love; and the Persian princesses Stateira II and Parysatis II, the former a daughter of Darius III and latter a daughter of Artaxerxes III, for political reasons. He apparently had two sons, Alexander IV of Macedon by Roxana and, possibly, Heracles of Macedon from his mistress Barsine. He lost another child when Roxana miscarried at Babylon.\n\nAlexander also had a close relationship with his friend, general, and bodyguard Hephaestion, the son of a Macedonian noble. Hephaestion's death devastated Alexander. This event may have contributed to Alexander's failing health and detached mental state during his final months.\n\nAlexander's sexuality has been the subject of speculation and controversy in modern times. The Roman era writer Athenaeus says, based on the scholar Dicaearchus, who was Alexander's contemporary, that the king \"was quite excessively keen on boys\", and that Alexander kissed the eunuch Bagoas in public. This episode is also told by Plutarch, probably based on the same source. None of Alexander's contemporaries, however, are known to have explicitly described Alexander's relationship with Hephaestion as sexual, though the pair was often compared to Achilles and Patroclus, whom classical Greek culture painted as a couple. Aelian writes of Alexander's visit to Troy where \"Alexander garlanded the tomb of Achilles, and Hephaestion that of Patroclus, the latter hinting that he was a beloved of Alexander, in just the same way as Patroclus was of Achilles.\" Some modern historians (e.g., Robin Lane Fox) believe not only that Alexander's youthful relationship with Hephaestion was sexual, but that their sexual contacts may have continued into adulthood, which went against the social norms of at least some Greek cities, such as Athens, though some modern researchers have tentatively proposed that Macedonia (or at least the Macedonian court) may have been more tolerant of homosexuality between adults.\n\nGreen argues that there is little evidence in ancient sources that Alexander had much carnal interest in women; he did not produce an heir until the very end of his life. However, Ogden calculates that Alexander, who impregnated his partners thrice in eight years, had a higher matrimonial record than his father at the same age. Two of these pregnancies — Stateira's and Barsine's — are of dubious legitimacy.\n\nAccording to Diodorus Siculus, Alexander accumulated a harem in the style of Persian kings, but he used it rather sparingly, \"not wishing to offend the Macedonians\", showing great self-control in \"pleasures of the body\". Nevertheless, Plutarch described how Alexander was infatuated by Roxana while complimenting him on not forcing himself on her. Green suggested that, in the context of the period, Alexander formed quite strong friendships with women, including Ada of Caria, who adopted him, and even Darius's mother Sisygambis, who supposedly died from grief upon hearing of Alexander's death.\n", "\n\n\n\n\nDate\n\nWar\n\nAction\n\nOpponent/s\n\nType\n\nCountry (present day)\n\nRank\n\nOutcome\n\n\n\n338-08-02 2 August 338 BC\n\nRise of Macedon\n\nChaeronea Battle of Chaeronea\n\n.Thebans, Athenians\n\nBattle\n\nGreece\n\nPrince\n\nVictory\n⁂\n\n\n\n335 335 BC\n\nBalkan Campaign\n\nMount Haemus Battle of Mount Haemus\n\n.Getae, Thracians\n\nBattle\n\n Bulgaria\n\nKing\n\nVictory\n⁂\n\n\n\n335-12 December 335 BC\n\nBalkan Campaign\n\nPelium Siege of Pelium\n\n.Illyrians\n\nSiege\n\nAlbania\n\nKing\n\nVictory\n⁂\n\n\n\n335-12 December 335 BC\n\nBalkan Campaign\n\nPelium Battle of Thebes\n\n.Thebans\n\nBattle\n\nGreece\n\nKing\n\nVictory\n⁂\n\n\n\n334-05 May 334 BC\n\nPersian Campaign\n\nGranicus Battle of the Granicus\n\n.Achaemenid Empire\n\nBattle\n\n Turkey\n\nKing\n\nVictory\n⁂\n\n\n\n334 334 BC\n\nPersian Campaign\n\nMiletus Siege of Miletus\n\n.Achaemenid Empire, Milesians\n\nSiege\n\n Turkey\n\nKing\n\nVictory\n⁂\n\n\n\n334 334 BC\n\nPersian Campaign\n\nHalicarnassus Siege of Halicarnassus\n\n.Achaemenid Empire\n\nSiege\n\nTurkey\n\nKing\n\nVictory\n⁂\n\n\n\n333-11-05 5 November 333 BC\n\nPersian Campaign\n\nIssus Battle of Issus\n\n.Achaemenid Empire\n\nBattle\n\n Turkey\n\nKing\n\nVictory\n⁂\n\n\n\n332 January–July 332 BC\n\nPersian Campaign\n\nTyre Siege of Tyre\n\n.Achaemenid Empire, Tyrians\n\nSiege\n\n Lebanon\n\nKing\n\nVictory\n⁂\n\n\n\n332-10 October 332 BC\n\nPersian Campaign\n\nTyre Siege of Gaza\n\n.Achaemenid Empire\n\nSiege\n\n Palestine\n\nKing\n\nVictory\n⁂\n\n\n\n331-10-01 1 October 331 BC\n\nPersian Campaign\n\nGaugamela Battle of Gaugamela\n\n.Achaemenid Empire\n\nBattle\n\n Iraq\n\nKing\n\nVictory\n⁂\n\n\n\n331-12 December 331 BC\n\nPersian Campaign\n\nUxian Defile Battle of the Uxian Defile\n\n.Uxians\n\nBattle\n\n Iran\n\nKing\n\nVictory\n⁂\n\n\n\n330-01-20 20 January 330 BC\n\nPersian Campaign\n\nPersian Gate Battle of the Persian Gate\n\n.Achaemenid Empire\n\nBattle\n\n Iran\n\nKing\n\nVictory\n⁂\n\n\n\n329 329 BC\n\nPersian Campaign\n\nCyropolis Siege of Cyropolis\n\n.Sogdians\n\nSiege\n\n Turkmenistan\n\nKing\n\nVictory\n⁂\n\n\n\n329-10 October 329 BC\n\nPersian Campaign\n\nJaxartes Battle of Jaxartes\n\n.Scythians\n\nBattle\n\n Uzbekistan\n\nKing\n\nVictory\n⁂\n\n\n\n327 327 BC\n\nPersian Campaign\n\nSogdian Rock Siege of the Sogdian Rock\n\n.Sogdians\n\nSiege\n\n Uzbekistan\n\nKing\n\nVictory\n⁂\n\n\n\n327 May 327 – March 326 BC\n\nIndian Campaign\n\nCophen Cophen Campaign\n\n.Aspasians\n\nExpedition\n\n Afghanistan and Pakistan\n\nKing\n\nVictory\n⁂\n\n\n\n326-04 April 326 BC\n\nIndian Campaign\n\nAornos Siege of Aornos\n\n.Aśvaka\n\nSiege\n\n Pakistan\n\nKing\n\nVictory\n⁂\n\n\n\n326-05 May 326 BC\n\nIndian Campaign\n\nHydaspes Battle of the Hydaspes\n\n.Porus\n\nBattle\n\nPakistan\n\nKing\n\nVictory\n⁂\n\n\n\n325 November 326 – February 325 BC\n\nIndian Campaign\n\nAornos Siege of Multan\n\n.Malli\n\nSiege\n\n Pakistan\n\nKing\n\nVictory\n⁂\n\n\n", "The Hellenistic world view: world map of Eratosthenes (276–194 BC), using information from the campaigns of Alexander and his successors\n\nAlexander's legacy extended beyond his military conquests, and his reign marked a turning point in European and Asian history. His campaigns greatly increased contacts and trade between East and West, and vast areas to the east were significantly exposed to Greek civilization and influence. Some of the cities he founded became major cultural centers, many surviving into the 21st century. His chroniclers recorded valuable information about the areas through which he marched, while the Greeks themselves got a sense of belonging to a world beyond the Mediterranean.\n\n===Hellenistic kingdoms===\n\nPlan of Alexandria \nAlexander's most immediate legacy was the introduction of Macedonian rule to huge new swathes of Asia. At the time of his death, Alexander's empire covered some , and was the largest state of its time. Many of these areas remained in Macedonian hands or under Greek influence for the next 200–300 years. The successor states that emerged were, at least initially, dominant forces, and these 300 years are often referred to as the Hellenistic period.\n\nThe eastern borders of Alexander's empire began to collapse even during his lifetime. However, the power vacuum he left in the northwest of the Indian subcontinent directly gave rise to one of the most powerful Indian dynasties in history, the Maurya Empire. Taking advantage of this power vacuum, Chandragupta Maurya (referred to in Greek sources as \"Sandrokottos\"), of relatively humble origin, took control of the Punjab, and with that power base proceeded to conquer the Nanda Empire.\n\n===Founding of cities===\n\nOver the course of his conquests, Alexander founded some twenty cities that bore his name, most of them east of the Tigris. The first, and greatest, was Alexandria in Egypt, which would become one of the leading Mediterranean cities. The cities' locations reflected trade routes as well as defensive positions. At first, the cities must have been inhospitable, little more than defensive garrisons. Following Alexander's death, many Greeks who had settled there tried to return to Greece. However, a century or so after Alexander's death, many of the Alexandrias were thriving, with elaborate public buildings and substantial populations that included both Greek and local peoples.\n\nThe foundation of the \"new\" Smyrna was also associated with Alexander. According to the legend, after Alexander hunted on the Mount Pagus, he slept under a plane tree at the sanctuary of Nemesis. While he was sleeping, the goddess appeared and told him to found a city there and move into it the Smyrnaeans from the \"old\" city. The Smyrnaeans sent ambassadors to the oracle at Clarus to ask about this, and after the response from the oracle they decided to move to the \"new\" city.\n\nThe city of Pella, in modern Jordan, was founded by veterans of Alexander's army, and named it after the city of Pella, in Greece, which was the birthplace of Alexander.\n\n===Funding of temples===\nDedication of Alexander the Great to Athena Polias at Priene, now housed in the British Museum\nIn 334 BC, Alexander the Great donated funds for the completion of the new temple of Athena Polias in Priene, in modern-day western Turkey. An inscription from the temple, now housed in the British Museum, declares: \"King Alexander dedicated this temple to Athena Polias.\" This inscription is one of the few independent archaeological discoveries confirming an episode from Alexander's life. The temple was designed by Pytheos, one of the architects of the Mausoleum at Halicarnassus.\n\nLibanius wrote that Alexander founded the temple of Zeus Bottiaios (), in the place where later the city of Antioch was built.\n\nSuda wrote that Alexander built a big temple to Sarapis.\n\n===Hellenization===\n\nAlexander's empire was the largest state of its time, covering approximately 5.2 million square km.\n\n''Hellenization'' was coined by the German historian Johann Gustav Droysen to denote the spread of Greek language, culture, and population into the former Persian empire after Alexander's conquest. This process can be seen in such great Hellenistic cities as Alexandria, Antioch and Seleucia (south of modern Baghdad). Alexander sought to insert Greek elements into Persian culture and to hybridize Greek and Persian culture, homogenizing the populations of Asia and Europe. Although his successors explicitly rejected such policies, Hellenization occurred throughout the region, accompanied by a distinct and opposite 'Orientalization' of the successor states.\n\nThe core of the Hellenistic culture promulgated by the conquests was essentially Athenian. The close association of men from across Greece in Alexander's army directly led to the emergence of the largely Attic-based \"koine\", or \"common\" Greek dialect. Koine spread throughout the Hellenistic world, becoming the lingua franca of Hellenistic lands and eventually the ancestor of modern Greek. Furthermore, town planning, education, local government, and art current in the Hellenistic period were all based on Classical Greek ideals, evolving into distinct new forms commonly grouped as Hellenistic. Also, the New Testament was written in the Koine Greek language. Aspects of Hellenistic culture were still evident in the traditions of the Byzantine Empire in the mid-15th century.\n\n==== Hellenization in South and Central Asia ====\n\nBuddha, in Greco-Buddhist style, 1st to 2nd century AD, Gandhara, northern Pakistan. Tokyo National Museum.\nSome of the most pronounced effects of Hellenization can be seen in Afghanistan and India, in the region of the relatively late-rising Greco-Bactrian Kingdom (250–125 BC) (in modern Afghanistan, Pakistan, and Tajikistan) and the Indo-Greek Kingdom (180 BC – 10 AD) in modern Afghanistan and India. On the Silk Road trade routes, Hellenistic culture hybridized with Iranian and Buddhist cultures. The cosmopolitan art and mythology of Gandhara (a region spanning the upper confluence of the Indus, Swat and Kabul rivers in modern Pakistan) of the ~3rd century BC to the ~5th century AD are most evident of the direct contact between Hellenistic civilization and South Asia, as are the Edicts of Ashoka, which directly mention the Greeks within Ashoka's dominion as converting to Buddhism and the reception of Buddhist emissaries by Ashoka's contemporaries in the Hellenistic world. The resulting syncretism known as Greco-Buddhism influenced the development of Buddhism and created a culture of Greco-Buddhist art. These Greco-Buddhist kingdoms sent some of the first Buddhist missionaries to China, Sri Lanka and Hellenistic Asia and Europe (Greco-Buddhist monasticism).\n\nSome of the first and most influential figurative portrayals of the Buddha appeared at this time, perhaps modelled on Greek statues of Apollo in the Greco-Buddhist style. Several Buddhist traditions may have been influenced by the ancient Greek religion: the concept of Boddhisatvas is reminiscent of Greek divine heroes, and some Mahayana ceremonial practices (burning incense, gifts of flowers, and food placed on altars) are similar to those practised by the ancient Greeks; however, similar practices were also observed amongst the native Indic culture. One Greek king, Menander I, probably became Buddhist, and was immortalized in Buddhist literature as 'Milinda'. The process of Hellenization also spurred trade between the east and west. For example, Greek astronomical instruments dating to the 3rd century BC were found in the Greco-Bactrian city of Ai Khanoum in modern-day Afghanistan, while the Greek concept of a spherical earth surrounded by the spheres of planets eventually supplanted the long-standing Indian cosmological belief of a disc consisting of four continents grouped around a central mountain (Mount Meru) like the petals of a flower. The Yavanajataka (lit. Greek astronomical treatise) and Paulisa Siddhanta texts depict the influence of Greek astronomical ideas on Indian astronomy.\n\nFollowing the conquests of Alexander the Great in the east, Hellenistic influence on Indian art was far-ranging. In the area of architecture, a few examples of the Ionic order can be found as far as Pakistan with the Jandial temple near Taxila. Several examples of capitals displaying Ionic influences can be seen as far as Patna, especially with the Pataliputra capital, dated to the 3rd century BC. The Corinthian order is also heavily represented in the art of Gandhara, especially through Indo-Corinthian capitals.\n\n===Influence on Rome===\nThis medallion was produced in Imperial Rome, demonstrating the influence of Alexander's memory. Walters Art Museum, Baltimore.\nAlexander and his exploits were admired by many Romans, especially generals, who wanted to associate themselves with his achievements. Polybius began his ''Histories'' by reminding Romans of Alexander's achievements, and thereafter Roman leaders saw him as a role model. Pompey the Great adopted the epithet \"Magnus\" and even Alexander's anastole-type haircut, and searched the conquered lands of the east for Alexander's 260-year-old cloak, which he then wore as a sign of greatness. Julius Caesar dedicated a Lysippean equestrian bronze statue but replaced Alexander's head with his own, while Octavian visited Alexander's tomb in Alexandria and temporarily changed his seal from a sphinx to Alexander's profile. The emperor Trajan also admired Alexander, as did Nero and Caracalla. The Macriani, a Roman family that in the person of Macrinus briefly ascended to the imperial throne, kept images of Alexander on their persons, either on jewellery, or embroidered into their clothes.\n\nOn the other hand, some Roman writers, particularly Republican figures, used Alexander as a cautionary tale of how autocratic tendencies can be kept in check by republican values. Alexander was used by these writers as an example of ruler values such as  (friendship) and  (clemency), but also  (anger) and  (over-desire for glory).\n\nEmperor Julian in his satire called \"The Caesars\", describes a contest between the previous Roman emperors, with Alexander the Great called in as an extra contestant, in the presence of the assembled gods.\n\nThe Itinerarium Alexandri is a 4th-century Latin Itinerarium which describes Alexander the Great's campaigns. Julius Caesar went to serve his quaestorship in Hispania after his wife's funeral, in the spring or early summer of 69 BC. While there, he encountered a statue of Alexander the Great, and realised with dissatisfaction that he was now at an age when Alexander had the world at his feet, while he had achieved comparatively little.\n\nPompey posed as the \"new Alexander\" since he was his boyhood hero.\n\nAfter Caracalla concluded his campaign against the Alamanni, it became evident that he was inordinately preoccupied with Alexander the Great. He began openly mimicking Alexander in his personal style. In planning his invasion of the Parthian Empire, Caracalla decided to arrange 16,000 of his men in Macedonian-style phalanxes, despite the Roman army having made the phalanx an obsolete tactical formation. The historian Christopher Matthew mentions that the term ''Phalangarii'' has two possible meanings, both with military connotations. The first refers merely to the Roman battle line and does not specifically mean that the men were armed with pikes, and the second bears similarity to the 'Marian Mules' of the late Roman Republic who carried their equipment suspended from a long pole, which were in use until at least the 2nd century AD. As a consequence, the ''Phalangarii'' of Legio II Parthica may not have been pikemen, but rather standard battle line troops or possibly ''Triarii''.\n\nCaracalla's mania for Alexander went so far that Caracalla visited Alexandria while preparing for his Persian invasion and persecuted philosophers of the Aristotelian school based on a legend that Aristotle had poisoned Alexander. This was a sign of Caracalla's increasingly erratic behaviour. But this mania for Alexander, strange as it was, was overshadowed by subsequent events in Alexandria.\n\nIn 39, Caligula performed a spectacular stunt by ordering a temporary floating bridge to be built using ships as pontoons, stretching for over two miles from the resort of Baiae to the neighbouring port of Puteoli. It was said that the bridge was to rival the Persian king Xerxes' pontoon bridge crossing of the Hellespont. Caligula, who could not swim, then proceeded to ride his favourite horse Incitatus across, wearing the breastplate of Alexander the Great. This act was in defiance of a prediction by Tiberius's soothsayer Thrasyllus of Mendes that Caligula had \"no more chance of becoming emperor than of riding a horse across the Bay of Baiae\".\n\nThe diffusion of Greek culture and language cemented by Alexander's conquests in West Asia and North Africa served as a \"precondition\" for the later Roman expansion into these territories and entire basis for the Byzantine Empire, according to Errington.\n\n===Unsuccessful plan to cut a canal through the isthmus===\nPausanias writes that Alexander wanted to dig through the Mimas mountain (in today's Karaburun area), but didn't succeed. He says this was Alexander's only unsuccessful project. Pliny the Elder adds that the planned distance was , and the purpose was to cut a canal through the isthmus to connect the Caystrian and Hermaean bays.\n\n===Naming of the Icarus island in the Persian Gulf===\nArrian wrote that Aristobulus said that Alexander named Icarus island (modern Failaka Island) in the Persian Gulf after Icarus island in the Aegean.\n\n===Legend===\nAlexander in a 14th-century Armenian manuscript\n\nMany of the legends about Alexander derive from his own lifetime, probably encouraged by Alexander himself. His court historian Callisthenes portrayed the sea in Cilicia as drawing back from him in proskynesis. Writing shortly after Alexander's death, Onesicritus invented a tryst between Alexander and Thalestris, queen of the mythical Amazons. He reportedly read this passage to his patron King Lysimachus, who had been one of Alexander's generals and who quipped, \"I wonder where I was at the time.\"\n\nIn the first centuries after Alexander's death, probably in Alexandria, a quantity of the legendary material coalesced into a text known as the ''Alexander Romance'', later falsely ascribed to Callisthenes and therefore known as ''Pseudo-Callisthenes''. This text underwent numerous expansions and revisions throughout Antiquity and the Middle Ages, containing many dubious stories, and was translated into numerous languages.\n\n===In ancient and modern culture===\n\nAlexander in a 14th-century Byzantine manuscript\nAlexander conquering the air. Jean Wauquelin, ''Les faits et conquêtes d'Alexandre le Grand'', 1448–1449\nAlexander the Great's accomplishments and legacy have been depicted in many cultures. Alexander has figured in both high and popular culture beginning in his own era to the present day. The ''Alexander Romance'', in particular, has had a significant impact on portrayals of Alexander in later cultures, from Persian to medieval European to modern Greek.\nFolio from the ''Shahnameh'' showing Alexander praying at the Kaaba, mid-16th century\n\nAlexander features prominently in modern Greek folklore, more so than any other ancient figure. The colloquial form of his name in modern Greek (\"O Megalexandros\") is a household name, and he is the only ancient hero to appear in the Karagiozis shadow play. One well-known fable among Greek seamen involves a solitary mermaid who would grasp a ship's prow during a storm and ask the captain \"Is King Alexander alive?\" The correct answer is \"He is alive and well and rules the world!\" causing the mermaid to vanish and the sea to calm. Any other answer would cause the mermaid to turn into a raging Gorgon who would drag the ship to the bottom of the sea, all hands aboard.Islamic painting depicting Alexander being lowered in a glass submersible\n\nIn pre-Islamic Middle Persian (Zoroastrian) literature, Alexander is referred to by the epithet ''gujastak'', meaning \"accursed\", and is accused of destroying temples and burning the sacred texts of Zoroastrianism. In Sunni Islamic Persia, under the influence of the ''Alexander Romance'' (in  ''Iskandarnamah''), a more positive portrayal of Alexander emerges. Firdausi's ''Shahnameh'' (\"The Book of Kings\") includes Alexander in a line of legitimate Persian shahs, a mythical figure who explored the far reaches of the world in search of the Fountain of Youth. In the ''Shahnameh'', Alexander's first journey is to Mecca to pray at the Kaaba. Alexander was depicted as performing a Hajj (pilgrimage to Mecca) many times in subsequent Islamic art and literature. Later Persian writers associate him with philosophy, portraying him at a symposium with figures such as Socrates, Plato and Aristotle, in search of immortality.\n\nThe figure of Dhul-Qarnayn (literally \"the Two-Horned One\") mentioned in the Quran is believed by scholars to be based on later legends of Alexander. In this tradition, he was a heroic figure who built a wall to defend against the nations of Gog and Magog. He then travelled the known world in search of the Water of Life and Immortality, eventually becoming a prophet.\n\nThe Syriac version of the ''Alexander Romance'' portrays him as an ideal Christian world conqueror who prayed to \"the one true God\". In Egypt, Alexander was portrayed as the son of Nectanebo II, the last pharaoh before the Persian conquest. His defeat of Darius was depicted as Egypt's salvation, \"proving\" Egypt was still ruled by an Egyptian.\n\nAccording to Josephus, Alexander was shown the Book of Daniel when he entered Jerusalem, which described a mighty Greek king who would conquer the Persian Empire. This is cited as a reason for sparing Jerusalem.\n\nIn Hindi and Urdu, the name \"Sikandar\", derived from the Persian name for Alexander, denotes a rising young talent, and the Delhi Sultanate ruler Aladdin Khalji stylized himself as \"Sikandar-i-Sani\" (the Second Alexander the Great). In medieval India, Turkic and Afghan sovereigns from the Iranian-cultured region of Central Asia brought positive cultural connotations of Alexander to the Indian subcontinent, resulting in the efflorescence of ''Sikandernameh'' (Alexander Romances) written by Indo-Persian poets such as Amir Khusrow and the prominence of Alexander the Great as a popular subject in Mughal-era Persian miniatures. In medieval Europe, Alexander the Great was revered as a member of the Nine Worthies, a group of heroes whose lives were believed to encapsulate all the ideal qualities of chivalry. During the first Italian campaign of the French Revolutionary Wars, in a question from Bourrienne, asking whether he gave his preference to Alexander or Caesar, Napoleon said that he places Alexander The Great in the first rank, the main reason being his campaign on Asia.\n\nIn the ''Greek Anthology'', there are poems referring to Alexander.\n\nThroughout time, art objects related to Alexander were being created. In addition to speech works, sculptures and paintings, in modern times Alexander is still the subject of musical and cinematic works. The song 'Alexander the Great' by the British heavy metal band Iron Maiden is indicative. Some films that have been shot with the theme of Alexander are:\n* ''Sikandar'' (1941), an Indian production directed by Sohrab Modi about the conquest of India by Alexander\n* ''Alexander the Great'' (1956), produced by MGM and starring Richard Burton\n* ''Sikandar-e-Azam'' (1965), an Indian production directed by Kedar Kapoor\n* ''Alexander'' (2004), directed by Oliver Stone, starring Colin Farrell\n\nThere are also many references to other movies and TV series.\n\nNewer novels about Alexander are:\n\nThe trilogy \"Alexander the Great\" by Valerio Massimo Manfredi  consisting of \"The son of the dream\", \"The sand of Amon\", and \"The ends of the world\".\nThe trilogy of Mary Renault consisting of \"Fire from Heaven\", \"The Persian Boy\" and \"Funeral Games\".\n* ''The Virtues of War'', about Alexander the Great (2004),  and \"* ''The Afghan Campaign'', about Alexander the Great's conquests in Afghanistan (2006), \" by Steven Pressfield.\n\nIrish playwright Aubrey Thomas de Vere wrote ''Alexander the Great, a Dramatic Poem''.\n", "\nApart from a few inscriptions and fragments, texts written by people who actually knew Alexander or who gathered information from men who served with Alexander were all lost. Contemporaries who wrote accounts of his life included Alexander's campaign historian Callisthenes; Alexander's generals Ptolemy and Nearchus; Aristobulus, a junior officer on the campaigns; and Onesicritus, Alexander's chief helmsman. Their works are lost, but later works based on these original sources have survived. The earliest of these is Diodorus Siculus (1st century BC), followed by Quintus Curtius Rufus (mid-to-late 1st century AD), Arrian (1st to 2nd century AD), the biographer Plutarch (1st to 2nd century AD), and finally Justin, whose work dated as late as the 4th century. Of these, Arrian is generally considered the most reliable, given that he used Ptolemy and Aristobulus as his sources, closely followed by Diodorus.\n", "\n* Ancient Macedonian army\n* Bucephalus\n* Chronology of European exploration of Asia\n* Theories about Alexander the Great in the Quran\n* Ptolemaic cult of Alexander the Great\n* Gates of Alexander\n* List of biblical figures identified in extra-biblical sources\n* List of people known as The Great\n", "\n\n\n\n\n\n\n\n\n", "\n", "\n\n===Primary sources===\n* \n* \n* \n* \n* \n* .\n\n===Secondary sources===\n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n\n", "\n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* , also (1974) New York: E. P. Dutton and (1986) London: Penguin Books.\n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n\n", "\n\n* .\n*   Part 1,  Part 2,  Part 3,  Part 4,  Part 5,  Part 6.\n* \n* .\n* .\n* .\n*  In Our Time: Alexander the Great BBC discussion with Paul Cartledge, Diana Spencer and Rachel Mairs hosted by Melvyn Bragg, first broadcast 1 October 2015.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"], "interlinks": [["Ancient Greece", "ancient Greek"], ["Macedonia (ancient kingdom)", "Macedon"], ["Argead dynasty", "Argead dynasty"], ["Pella", "Pella"], ["Ancient Greece", "Ancient Greece"], ["Philip II of Macedon", "King Philip II"], ["military campaign", "military campaign"], ["Western Asia", "Western Asia"], ["Northeastern Africa", "Northeastern Africa"], ["List of largest empires", "largest empires"], ["Greece", "Greece"], ["Historical India", "India"], ["Pompeii", "Pompeii"], ["Philoxenus of Eretria", "Philoxenus of Eretria"], ["Apelles", "Apelles"], ["Aristotle", "Aristotle"], ["Philip II of Macedon#Assassination", "Philip was assassinated"], ["Cleopatra of Macedon", "Cleopatra of Macedon"], ["Macedonia (ancient kingdom)", "Kingdom of Macedon"], ["Ancient Thebes (Boeotia)", "Thebes"], ["League of Corinth", "generalship of Greece"], ["Persia", "Persia"], ["Achaemenid Empire", "Achaemenid Empire"], ["Wars of Alexander the Great", "series of campaigns"], ["Anatolia", "Asia Minor"], ["Battle of Issus", "Issus"], ["Battle of Gaugamela", "Gaugamela"], ["Darius III", "King Darius III"], ["Adriatic Sea", "Adriatic Sea"], ["Indus River", "Indus River"], ["Indian campaign of Alexander the Great", "invaded India"], ["Porus", "King Porus"], ["Battle of the Hydaspes", "Battle of the Hydaspes"], ["Beas River", "Beas River"], ["Babylon", "Babylon"], ["Arabian Peninsula", "Arabia"], ["Death of Alexander the Great", "his death"], ["Wars of the Diadochi", "series of civil wars"], ["cultural diffusion", "cultural diffusion"], ["syncretism", "syncretism"], ["Greco-Buddhism", "Greco-Buddhism"], ["Hellenistic Judaism", "Hellenistic Judaism"], ["List of cities founded by Alexander the Great", "twenty cities that bore his name"], ["Alexandria", "Alexandria"], ["Culture of Greece", "Greek culture"], ["Hellenistic civilization", "Hellenistic civilization"], ["Roman Empire", "Roman Empire"], ["Western culture", "Western culture"], ["lingua franca", "lingua franca"], ["Byzantine Empire", "Byzantine Empire"], ["Cappadocian Greeks", "Greek-speaking communities in central"], ["Pontic Greeks", "far eastern Anatolia"], ["Greek genocide", "Greek genocide"], ["Convention Concerning the Exchange of Greek and Turkish Populations", "the population exchange"], ["Hero", "classical hero"], ["Achilles", "Achilles"], ["Military academy", "Military academies"], ["Pella", "Pella"], ["Macedonia (ancient kingdom)", "Kingdom of Macedon"], ["Hekatombaion", "Hekatombaion"], ["Philip II of Macedon", "Philip II"], ["Olympias", "Olympias"], ["Neoptolemus I of Epirus", "Neoptolemus I"], ["Epirus (ancient state)", "Epirus"], ["Olympias", "Olympias"], ["Olympias, Alexander's mother", "Olympias, Alexander's mother"], ["Plutarch", "Plutarch"], ["Seal (emblem)", "seal"], ["Zeus", "Zeus"], ["siege", "siege"], ["Potidea", "Potidea"], ["Chalcidice", "Chalcidice"], ["Parmenion", "Parmenion"], ["Illyria", "Illyria"], ["Paeonian", "Paeonian"], ["Ancient Olympic Games", "Olympic Games"], ["Temple of Artemis", "Temple of Artemis"], ["Ephesus", "Ephesus"], ["Seven Wonders of the Ancient World", "Seven Wonders of the World"], ["Hegesias of Magnesia", "Hegesias of Magnesia"], ["Artemis", "Artemis"], ["Domenico Maria Canuti, 17th century", "Domenico Maria Canuti, 17th century"], ["Lanike", "Lanike"], ["Cleitus the Black", "Cleitus the Black"], ["Leonidas of Epirus", "Leonidas"], ["Lysimachus of Acarnania", "Lysimachus of Acarnania"], ["lyre", "lyre"], ["Thessaly", "Thessaly"], ["Attic talent", "talents"], ["Bucephalas", "Bucephalas"], ["India", "India"], ["Alexandria Bucephalous", "Bucephala"], ["tutor", "tutor"], ["Isocrates", "Isocrates"], ["Speusippus", "Speusippus"], ["Platonic Academy", "Academy"], ["Aristotle", "Aristotle"], ["Mieza, Macedonia", "Mieza"], ["Stageira", "Stageira"], ["Ptolemy I Soter", "Ptolemy"], ["Hephaistion", "Hephaistion"], ["Cassander", "Cassander"], ["Homer", "Homer"], ["Iliad", "Iliad"], ["Euripides", "Euripides"], ["Artaxerxes III", "Artaxerxes III"], ["Artabazos II", "Artabazos II"], ["Barsine", "Barsine"], ["Amminapes", "Amminapes"], ["satrap", "satrap"], ["Sisines", "Sisines"], ["Suda", "Suda"], ["Anaximenes of Lampsacus", "Anaximenes of Lampsacus"], ["Philip II of Macedon, Alexander's father", "Philip II of Macedon, Alexander's father"], ["Thracians", "Thracians"], ["regent", "regent"], ["heir apparent", "heir apparent"], ["Thracians", "Thracian"], ["Maedi", "Maedi"], ["Alexandropolis Maedica", "Alexandropolis"], ["Thrace", "Thrace"], ["Perinthus", "Perinthus"], ["Amphissa (city)", "Amphissa"], ["Apollo", "Apollo"], ["Delphi", "Delphi"], ["Thermopylae", "Thermopylae"], ["Elatea", "Elatea"], ["Athens", "Athens"], ["Thebes, Greece", "Thebes"], ["Demosthenes", "Demosthenes"], ["Amphictyonic League", "Amphictyonic League"], ["Chaeronea", "Chaeronea"], ["Boeotia", "Boeotia"], ["Battle of Chaeronea (338 BC)", "Battle of Chaeronea"], ["hoplites", "hoplites"], ["Sparta", "Sparta"], ["Ancient Corinth", "Corinth"], ["Second Persian invasion of Greece#Hellenic alliance", "anti-Persian alliance"], ["Greco-Persian Wars", "Greco-Persian Wars"], ["Hegemon", "Hegemon"], ["League of Corinth", "League of Corinth"], ["Achaemenid Empire", "Persian Empire"], ["Cleopatra Eurydice of Macedon", "Cleopatra Eurydice"], ["Attalus (general)", "Attalus"], ["Banquet", "wedding banquet"], ["Alexander I of Epirus", "Alexander I of Epirus"], ["Dodona", "Dodona"], ["Molossians", "Molossians"], ["Glaucias of Taulantii", "Glaukias"], ["Demaratus (hetairos)", "Demaratus"], ["satrap", "satrap"], ["Caria", "Caria"], ["Pixodarus of Caria", "Pixodarus"], ["Philip Arrhidaeus", "Philip Arrhidaeus"], ["Thessalus (actor)", "Thessalus"], ["Harpalus", "Harpalus"], ["Nearchus", "Nearchus"], ["Ptolemy I Soter", "Ptolemy"], ["Erigyius", "Erigyius"], ["Hephaistos", "Hephaistos"], ["Hephaestion", "Hephaestion"], ["Vergina", "Aegae"], ["Cleopatra of Macedon", "Cleopatra"], ["Alexander I of Epirus", "Alexander I of Epirus"], ["Somatophylax", "bodyguards"], ["Pausanias of Orestis", "Pausanias"], ["Perdiccas", "Perdiccas"], ["Leonnatus", "Leonnatus"], ["Ancient Macedonian military", "army"], ["Amyntas IV of Macedon", "Amyntas IV"], ["Lyncestis", "Lyncestis"], ["Alexander Lyncestes", "Alexander Lyncestes"], ["Mount Olympus", "Mount Olympus"], ["Mount Ossa (Greece)", "Mount Ossa"], ["Peloponnese", "Peloponnese"], ["Corinth", "Corinth"], ["Diogenes and Alexander", "encounter between Alexander and Diogenes the Cynic"], ["Amphipolis", "Amphipolis"], ["Haemus Mons", "Mount Haemus"], ["Triballi", "Triballi"], ["List of tributaries of the Danube", "tributary of the Danube"], ["Danube", "Danube"], ["Getae", "Getae"], ["skirmish", "skirmish"], ["Cleitus (Dardania)", "Cleitus"], ["King Glaukias", "King Glaukias"], ["Taulantii", "Taulantii"], ["Battle of Thebes", "razed the city"], ["Antipater", "Antipater"], ["File:Audran.jpg", "thumb"], ["Battle of Chaeronea (338 BC)", "Battle of Chaeronea (338 BC)"], ["Philip II of Macedon", "Philip II"], ["Diodorus", "Diodorus"], ["Second Persian invasion of Greece", "480"], ["Parmenion", "Parmenion"], ["Amyntas (son of Andromenes)", "Amyntas"], ["Attalus (general)", "Attalus"], ["Anatolia", "Anatolia"], ["Magnesia on the Meander", "Magnesia"], ["Memnon of Rhodes", "Memnon of Rhodes"], ["Hellespont", "Hellespont"], ["Thrace", "Thrace"], ["Paionia", "Paionia"], ["Illyria", "Illyria"], ["Battle of the Granicus", "Battle of the Granicus"], ["Sardis", "Sardis"], ["Ionia", "Ionia"], ["Miletus", "Miletus"], ["Halicarnassus", "Halicarnassus"], ["Caria", "Caria"], ["siege", "siege"], ["Memnon of Rhodes", "Memnon of Rhodes"], ["satrap", "satrap"], ["Orontobates", "Orontobates"], ["Ada of Caria", "Ada"], ["Lycia", "Lycia"], ["Pamphylia", "Pamphylia"], ["Termessos", "Termessos"], ["Pisidia", "Pisidia"], ["Gordium", "Gordium"], ["Gordian Knot", "Gordian Knot"], ["Asia Minor", "Asia"], ["Taurus Mountains", "Taurus"], ["Cilicia", "Cilicia"], ["Issus (Cilicia)", "Issus"], ["Sisygambis", "Sisygambis"], ["peace treaty", "peace treaty"], ["Attic talent", "talents"], ["Ancient Syria", "Syria"], ["Levant", "Levant"], ["Tyre, Lebanon", "Tyre"], ["Siege of Tyre (332 BC)", "siege"], ["slavery", "slavery"], ["Egypt", "Egypt"], ["Gaza City", "Gaza"], ["Siwa Oasis", "Siwa Oasis"], ["Amun", "Amun"], ["Oracle", "Oracle"], ["Siwa Oasis", "Siwa Oasis"], ["Ancient Libya", "Libyan"], ["Zeus-Ammon", "Zeus-Ammon"], ["Horns of Ammon", "Horns of Ammon"], ["Alexandria", "Alexandria"], ["Ptolemaic Kingdom", "Ptolemaic Kingdom"], ["Achaemenid Assyria", "Achaemenid Assyria"], ["Upper Mesopotamia", "Upper Mesopotamia"], ["Iraq", "Iraq"], ["Battle of Gaugamela", "Battle of Gaugamela"], ["Erbil", "Arbela"], ["Ecbatana", "Ecbatana"], ["Hamadan", "Hamadan"], ["Babylon", "Babylon"], ["Babylonian astronomical diaries", "Babylonian astronomical diaries"], ["Iran", "Iran"], ["Susa", "Susa"], ["Achaemenid Empire", "Achaemenid"], ["Persepolis", "Persepolis"], ["Royal Road", "Royal Road"], ["Persian Gates", "Persian Gates"], ["Zagros Mountains", "Zagros Mountains"], ["Ariobarzanes (satrap of Persis)", "Ariobarzanes"], ["Xerxes I", "Xerxes I"], ["Acropolis of Athens", "Acropolis of Athens"], ["Greco-Persian Wars", "Second Persian War"], ["Plutarch", "Plutarch"], ["Diodorus", "Diodorus"], ["hetaera", "hetaera"], ["Thaïs", "Thaïs"], ["Plutarch", "Plutarch"], ["Quintus Curtius Rufus", "Curtius"], ["Bessus", "Bessus"], ["Bactria", "Bactria"], ["guerrilla warfare", "guerrilla"], ["Iranian studies", "Iranologist"], ["Pierre Briant", "Pierre Briant"], ["Kandahar", "Kandahar"], ["Alexandria Eschate", "Alexandria Eschate"], ["Tajikistan", "Tajikistan"], ["Media (region)", "Media"], ["Parthia", "Parthia"], ["Aria (satrapy)", "Aria"], ["Drangiana", "Drangiana"], ["Arachosia", "Arachosia"], ["Bactria", "Bactria"], ["Scythia", "Scythia"], ["Spitamenes", "Spitamenes"], ["Ptolemy I Soter", "Ptolemy"], ["Syr Darya", "Jaxartes"], ["Battle of Jaxartes", "Battle of Jaxartes"], ["André Castaigne", "André Castaigne"], ["proskynesis", "proskynesis"], ["deities", "deities"], ["Iranian peoples", "Iranians"], ["Persians", "Persian"], ["Pierre Briant", "Pierre Briant"], ["Persepolis", "Persepolis"], ["Philotas", "Philotas"], ["Parmenion", "Parmenion"], ["Ecbatana", "Ecbatana"], ["Cleitus the Black", "Cleitus the Black"], ["Maracanda", "Maracanda"], ["Samarkand", "Samarkand"], ["Uzbekistan", "Uzbekistan"], ["page (servant)", "pages"], ["Callisthenes", "Callisthenes"], ["Olynthus", "Olynthus"], ["Anabasis of Alexander", "Anabasis of Alexander"], ["Arrian", "Arrian"], ["rack (torture)", "rack"], ["Antipater", "Antipater"], ["Agis III", "Agis III"], ["battle of Megalopolis", "battle of Megalopolis"], ["Third Macedonian War", "Third Macedonian War"], ["Spitamenes", "Spitamenes"], ["Old Iranian", "Old Iranian"], ["Indian subcontinent", "Indian subcontinent"], ["tribal chief", "chieftains"], ["Gandhara", "Gandhara"], ["Afghanistan", "Afghanistan"], ["Pakistan", "Pakistan"], ["Omphis", "Omphis"], ["Ambhi", "Ambhi"], ["Taxila", "Taxila"], ["Indus", "Indus"], ["Jhelum River", "Hydaspes (Jhelum)"], ["Aspasioi", "Aspasioi"], ["Assakenoi", "Assakenoi"], ["Kambojas", "Kambojas"], ["Ambhi", "Ambhi"], ["Hephaestion", "Hephaestion"], ["Perdiccas", "Perdiccas"], ["Hund, Khyber Pakhtunkhwa", "Hund"], ["Macedon", "Macedon"], ["battle of the Hydaspes River", "battle of the Hydaspes River"], ["Porus", "Porus"], ["Philip (son of Machatas)", "Philip"], ["Treaty of Triparadisus", "Triparadisus"], ["Kunar Valley", "Kunar"], ["valley", "valley"], ["Panjkora", "Guraeus"], ["Swat (Pakistan)", "Swat"], ["Buner Valley", "Buner"], ["Aornos", "Aornos"], ["Quintus Curtius Rufus", "Curtius"], ["Aornos", "Aornos"], ["Porus surrenders to Alexander", "Porus surrenders to Alexander"], ["Porus", "King Porus"], ["Hydaspes", "Hydaspes"], ["Chenab", "Chenab"], ["Punjab region", "Punjab"], ["Battle of the Hydaspes", "Battle of the Hydaspes"], ["Beas", "Beas"], ["Jhelum River", "Hydaspes"], ["Alexandria Bucephalous", "Bucephala"], ["Nicaea (Punjab)", "Nicaea"], ["Mong, Punjab", "Mong, Punjab"], ["Philostratus the Elder", "Philostratus the Elder"], ["Life of Apollonius of Tyana", "Life of Apollonius of Tyana"], ["Helios", "Helios"], ["Indian subcontinent", "Indian subcontinent"], ["Ganges River", "Ganges River"], ["Nanda dynasty", "Nanda Empire"], ["Magadha", "Magadha"], ["Gangaridai", "Gangaridai Empire"], ["Bengal", "Bengal"], ["Indian subcontinent", "Indian subcontinent"], ["Beas River", "Hyphasis River (Beas)"], ["Coenus (general)", "Coenus"], ["Indus River", "Indus"], ["Malhi", "Malhi"], ["Multan", "Multan"], ["Kerman province", "Carmania"], ["Iran", "Iran"], ["Craterus", "Craterus"], ["Persian Gulf", "Persian Gulf"], ["Nearchus", "Nearchus"], ["Gedrosia", "Gedrosian Desert"], ["Makran", "Makran"], ["Hephaestion (right): Both were connected by a tight man-to-man friendship", "Hephaestion (right): Both were connected by a tight man-to-man friendship"], ["satrap", "satrap"], ["Susa", "Susa"], ["Opis", "Opis"], ["Susa weddings", "held a mass marriage"], ["tomb of Cyrus the Great", "tomb of Cyrus the Great"], ["Pasargadae", "Pasargadae"], ["Cyrus the Great", "Cyrus the Great"], ["Cyropaedia", "Cyropaedia"], ["Aristobulus of Cassandreia", "Aristobulus"], ["Hephaestion", "Hephaestion"], ["funeral pyre", "funeral pyre"], ["Nebuchadnezzar II", "Nebuchadnezzar II"], ["Babylon", "Babylon"], ["Plutarch", "Plutarch"], ["Nearchus", "Nearchus"], ["Medius of Larissa", "Medius of Larissa"], ["Diodorus Siculus", "Diodorus"], ["Heracles", "Heracles"], ["Arrian", "Arrian"], ["Justin (historian)", "Justin"], ["Antipater", "Antipater"], ["Veratrum album", "Veratrum album"], ["Clinical Toxicology", "Clinical Toxicology"], ["Alexander Romance", "Alexander Romance"], ["Mavroneri", "Mavroneri"], ["calicheamicin", "calicheamicin"], ["natural causes", "natural causes"], ["malaria", "malaria"], ["typhoid fever", "typhoid fever"], ["New England Journal of Medicine", "New England Journal of Medicine"], ["bowel perforation", "bowel perforation"], ["paralysis", "paralysis"], ["spondylitis", "spondylitis"], ["meningitis", "meningitis"], ["acute pancreatitis", "acute pancreatitis"], ["West Nile virus", "West Nile virus"], ["Hephaestion", "Hephaestion"], ["sarcophagus", "sarcophagus"], ["royal prerogative", "royal prerogative"], ["Diodorus Siculus", "Diodorus Siculus"], ["Ptolemy II Philadelphus", "Ptolemy II Philadelphus"], ["late Antiquity", "late Antiquity"], ["Ptolemy IX Lathyros", "Ptolemy IX Lathyros"], ["Kasta Tomb", "enormous tomb"], ["Amphipolis", "Amphipolis"], ["Hephaestion", "Hephaestion"], ["Alexander Sarcophagus", "Alexander Sarcophagus"], ["Pompey", "Pompey"], ["Julius Caesar", "Julius Caesar"], ["Augustus", "Augustus"], ["Caligula", "Caligula"], ["Septimius Severus", "Septimius Severus"], ["Caracalla", "Caracalla"], ["Alexander Sarcophagus", "Alexander Sarcophagus"], ["Sidon", "Sidon"], ["Istanbul Archaeology Museum", "Istanbul Archaeology Museum"], ["bas-relief", "bas-relief"], ["Abdalonymus", "Abdalonymus"], ["battle of Issus", "battle of Issus"], ["Demades", "Demades"], ["Cyclops", "Cyclops"], ["Seleucid Empire", "Seleucid Empire"], ["Pergamon", "Kingdom of Pergamon"], ["Kingdom of Macedon", "Kingdom of Macedon"], ["Roman Republic", "Roman Republic"], ["Carthaginian Empire", "Carthaginian Republic"], ["Epirus (ancient state)", "Kingdom of Epirus"], ["Seal (device)", "signet ring"], ["Perdiccas", "Perdiccas"], ["Craterus", "Craterus"], ["Meleager (general)", "Meleager"], ["Partition of Babylon", "Partition of Babylon"], ["Diadochi", "Diadochi"], ["Ptolemaic Kingdom", "Ptolemaic Egypt"], ["Seleucid Empire", "Seleucid Mesopotamia and Central Asia"], ["Attalid dynasty", "Attalid Anatolia"], ["Antigonid dynasty", "Antigonid Macedon"], ["somatophylakes", "somatophylakes"], ["satrap", "satrap"], ["Cilicia", "Cilicia"], ["Heracles", "Heracles"], ["Diodorus Siculus", "Diodorus"], ["Craterus", "Craterus"], ["Craterus", "Craterus"], ["Perdiccas", "Perdiccas"], ["Pillars of Hercules", "Pillars of Hercules"], ["Delos", "Delos"], ["Delphi", "Delphi"], ["Dodona", "Dodona"], ["Dium", "Dium"], ["Amphipolis", "Amphipolis"], ["Attic talent", "talents"], ["Athena", "Athena"], ["Troy", "Troy"], ["synoecism", "synoecism"], ["Egyptian pyramids", "pyramids of Egypt"], ["Ernst Badian", "Ernst Badian"], ["Alexander Romance", "Alexander Romance"], ["Battle of the Granicus, 334 BC", "Battle of the Granicus, 334 BC"], ["Battle of Issus, 333 BC", "Battle of Issus, 333 BC"], ["phalanx", "phalanx"], ["Macedonian phalanx", "Macedonian phalanx"], ["sarissa", "sarissa"], ["scimitars", "scimitars"], ["javelins", "javelins"], ["Bactria", "Bactria"], ["Sogdiana", "Sogdiana"], ["Pyrgoteles", "Pyrgoteles"], ["Lysippos", "Lysippos"], ["Apelles", "Apelles"], ["Pyrgoteles", "Pyrgoteles"], ["Quintus Curtius Rufus", "Curtius Rufus"], ["Histories of Alexander the Great", "Histories of Alexander the Great"], ["Darius III", "Darius III"], ["Diodorus", "Diodorus"], ["Darius III", "Darius III"], ["Sisygambis", "Sisygambis"], ["Hephaestion", "Hephaestion"], ["Lysippos", "Lysippos"], ["Alexander Sarcophagus", "Alexander Sarcophagus"], ["Plutarch", "Plutarch"], ["Alexander Mosaic", "Alexander Mosaic"], ["Claudius Aelianus", "Aelian"], ["Craterus", "Craterus"], ["mosaic", "mosaic"], ["Pella", "Pella"], ["self-control", "self-control"], ["Ancient Greek sculpture", "Greek bust"], ["Ny Carlsberg Glyptotek", "Ny Carlsberg Glyptotek"], ["Ancient Olympic Games", "Olympic Games"], ["Homeric", "Homeric"], ["charisma", "charisma"], ["megalomania", "megalomania"], ["paranoia", "paranoia"], ["delusions of grandeur", "delusions of grandeur"], ["#Will", "will"], ["Siwa Oasis", "Siwa"], ["proskynesis", "proskynesis"], ["Stateira II", "Stateira"], ["Ares", "Ares"], ["Aphrodite", "Aphrodite"], ["Roxana", "Roxana"], ["Sogdia", "Sogdia"], ["Oxyartes", "Oxyartes"], ["Bactria", "Bactria"], ["Stateira II", "Stateira II"], ["Parysatis II", "Parysatis II"], ["Darius III", "Darius III"], ["Artaxerxes III", "Artaxerxes III"], ["Alexander IV of Macedon", "Alexander IV of Macedon"], ["Heracles of Macedon", "Heracles of Macedon"], ["Barsine", "Barsine"], ["Hephaestion", "Hephaestion"], ["mental health", "mental state"], ["Athenaeus", "Athenaeus"], ["Dicaearchus", "Dicaearchus"], ["Achilles and Patroclus", "Achilles and Patroclus"], ["Troy", "Troy"], ["Patroclus", "Patroclus"], ["Robin Lane Fox", "Robin Lane Fox"], ["Ada of Caria", "Ada of Caria"], ["Sisygambis", "Sisygambis"], ["Rise of Macedon", "Rise of Macedon"], ["Battle of Chaeronea (338 BC)", "Battle of Chaeronea"], ["Thebans", "Thebans"], ["Athenians", "Athenians"], ["Greece", "Greece"], ["Prince", "Prince"], ["Alexander's Balkan campaign", "Balkan Campaign"], ["Getae", "Getae"], ["Thracians", "Thracians"], ["Bulgaria", "Bulgaria"], ["King", "King"], ["Siege of Pelium", "Siege of Pelium"], ["Illyrians", "Illyrians"], ["Albania", "Albania"], ["Battle of Thebes", "Battle of Thebes"], ["Thebans", "Thebans"], ["Battle of the Granicus", "Battle of the Granicus"], ["Achaemenid Empire", "Achaemenid Empire"], ["Turkey", "Turkey"], ["Siege of Miletus", "Siege of Miletus"], ["Achaemenid Empire", "Achaemenid Empire"], ["Milesians (Greek)", "Milesians"], ["Siege of Halicarnassus", "Siege of Halicarnassus"], ["Achaemenid Empire", "Achaemenid Empire"], ["Battle of Issus", "Battle of Issus"], ["Achaemenid Empire", "Achaemenid Empire"], ["Siege of Tyre (332 BC)", "Siege of Tyre"], ["Achaemenid Empire", "Achaemenid Empire"], ["Tyrians", "Tyrians"], ["Lebanon", "Lebanon"], ["Siege of Gaza", "Siege of Gaza"], ["Achaemenid Empire", "Achaemenid Empire"], ["Palestine (region)", "Palestine"], ["Battle of Gaugamela", "Battle of Gaugamela"], ["Achaemenid Empire", "Achaemenid Empire"], ["Iraq", "Iraq"], ["Battle of the Uxian Defile", "Battle of the Uxian Defile"], ["Uxians", "Uxians"], ["Iran", "Iran"], ["Battle of the Persian Gate", "Battle of the Persian Gate"], ["Achaemenid Empire", "Achaemenid Empire"], ["Siege of Cyropolis", "Siege of Cyropolis"], ["Sogdians", "Sogdians"], ["Turkmenistan", "Turkmenistan"], ["Battle of Jaxartes", "Battle of Jaxartes"], ["Scythians", "Scythians"], ["Uzbekistan", "Uzbekistan"], ["Sogdian Rock", "Siege of the Sogdian Rock"], ["Sogdians", "Sogdians"], ["Indian campaign of Alexander the Great", "Indian Campaign"], ["Cophen Campaign", "Cophen Campaign"], ["Aspasians", "Aspasians"], ["Afghanistan", "Afghanistan"], ["Pakistan", "Pakistan"], ["Aornos", "Siege of Aornos"], ["Aśvaka", "Aśvaka"], ["Battle of the Hydaspes", "Battle of the Hydaspes"], ["Porus", "Porus"], ["Mallian Campaign", "Siege of Multan"], ["Malhi", "Malli"], ["Eratosthenes", "Eratosthenes"], ["Eastern world", "East"], ["Western world", "West"], ["Greek civilization", "Greek civilization"], ["Hellenistic period#The successors", "successor states"], ["Hellenistic period", "Hellenistic period"], ["Maurya Empire", "Maurya Empire"], ["Chandragupta Maurya", "Chandragupta Maurya"], ["Punjab region", "Punjab"], ["Nanda Empire", "Nanda Empire"], ["Alexandria (disambiguation)#West and Central Asia", "twenty cities that bore his name"], ["Tigris", "Tigris"], ["Alexandria", "Alexandria"], ["Smyrna", "Smyrna"], ["Mount Pagus", "Mount Pagus"], ["plane tree", "plane tree"], ["Nemesis", "Nemesis"], ["Clarus", "Clarus"], ["Pella, Jordan", "Pella"], ["Jordan", "Jordan"], ["Pella", "Pella"], ["British Museum", "British Museum"], ["Athena Polias", "Athena Polias"], ["Priene", "Priene"], ["Priene Inscription", "inscription from the temple"], ["British Museum", "British Museum"], ["Pythius of Priene", "Pytheos"], ["Mausoleum at Halicarnassus", "Mausoleum at Halicarnassus"], ["Libanius", "Libanius"], ["Antioch", "Antioch"], ["Suda", "Suda"], ["Sarapis", "Sarapis"], ["Johann Gustav Droysen", "Johann Gustav Droysen"], ["Alexandria", "Alexandria"], ["Antioch", "Antioch"], ["Seleucia", "Seleucia"], ["Baghdad", "Baghdad"], ["Culture of Iran", "Persian culture"], ["Athenian", "Athenian"], ["Attic Greek", "Attic"], ["koine", "koine"], ["lingua franca", "lingua franca"], ["modern Greek", "modern Greek"], ["Urban planning", "town planning"], ["New Testament", "New Testament"], ["Koine Greek", "Koine Greek"], ["Greco-Buddhist art", "Greco-Buddhist style"], ["Gandhara", "Gandhara"], ["Tokyo National Museum", "Tokyo National Museum"], ["Greco-Bactrian Kingdom", "Greco-Bactrian Kingdom"], ["Afghanistan", "Afghanistan"], ["Pakistan", "Pakistan"], ["Tajikistan", "Tajikistan"], ["Indo-Greeks", "Indo-Greek Kingdom"], ["Silk Road", "Silk Road"], ["Buddhist", "Buddhist"], ["Gandhara", "Gandhara"], ["Edicts of Ashoka", "Edicts of Ashoka"], ["syncretism", "syncretism"], ["Greco-Buddhism", "Greco-Buddhism"], ["Greco-Buddhist art", "Greco-Buddhist art"], ["China", "China"], ["Sri Lanka", "Sri Lanka"], ["Greco-Buddhist monasticism", "Greco-Buddhist monasticism"], ["Gautama Buddha", "Buddha"], ["Apollo", "Apollo"], ["ancient Greek religion", "ancient Greek religion"], ["Boddhisatvas", "Boddhisatvas"], ["Mahayana", "Mahayana"], ["Offering (Buddhism)", "ceremonial practices"], ["incense", "incense"], ["Menander I", "Menander I"], ["Buddhist texts", "Buddhist literature"], ["Greco-Bactrian", "Greco-Bactrian"], ["Ai Khanoum", "Ai Khanoum"], ["Afghanistan", "Afghanistan"], ["spherical earth", "spherical earth"], ["Yavanajataka", "Yavanajataka"], ["Paulisa Siddhanta", "Paulisa Siddhanta"], ["Hellenistic influence on Indian art", "Hellenistic influence on Indian art"], ["architecture", "architecture"], ["Ionic order", "Ionic order"], ["Pakistan", "Pakistan"], ["Jandial", "Jandial temple"], ["Taxila", "Taxila"], ["capital (architecture)", "capitals"], ["Patna", "Patna"], ["Pataliputra capital", "Pataliputra capital"], ["Corinthian order", "Corinthian order"], ["Greco-Buddhist art", "art of Gandhara"], ["Indo-Corinthian capital", "Indo-Corinthian capital"], ["Baltimore", "Baltimore"], ["Polybius", "Polybius"], ["The Histories (Polybius)", "Histories"], ["Pompey the Great", "Pompey the Great"], ["Julius Caesar", "Julius Caesar"], ["Lysippus", "Lysippean"], ["equestrian statue", "equestrian"], ["bronze", "bronze"], ["Octavian", "Octavian"], ["sphinx", "sphinx"], ["Trajan", "Trajan"], ["Nero", "Nero"], ["Caracalla", "Caracalla"], ["Macrinus", "Macrinus"], ["autocratic", "autocratic"], ["Roman republic", "republican"], ["Julian (emperor)", "Emperor Julian"], ["Itinerarium Alexandri", "Itinerarium Alexandri"], ["Itinerarium", "Itinerarium"], ["Julius Caesar", "Julius Caesar"], ["Pompey", "Pompey"], ["phalanx", "phalanx"], ["Pike (weapon)", "pikes"], ["Roman Republic", "Roman Republic"], ["Legio II Parthica", "Legio II Parthica"], ["Triarii", "Triarii"], ["Aristotelianism", "Aristotelian"], ["Aristotle", "Aristotle"], ["Pontoon bridge", "floating bridge"], ["Pontoon (boat)", "pontoons"], ["Baiae", "Baiae"], ["Puteoli", "Puteoli"], ["Xerxes' Pontoon Bridges", "Xerxes' pontoon bridge"], ["Incitatus", "Incitatus"], ["#After death", "Alexander the Great"], ["Thrasyllus of Mendes", "Thrasyllus of Mendes"], ["Mithridatic Wars", "later Roman expansion"], ["Byzantine Greeks", "entire basis"], ["Byzantine Empire", "Byzantine Empire"], ["Robert Malcolm Errington", "Errington"], ["Pausanias (geographer)", "Pausanias"], ["Karaburun", "Karaburun"], ["Pliny the Elder", "Pliny the Elder"], ["Arrian", "Arrian"], ["Aristobulus of Cassandreia", "Aristobulus"], ["Ikaros (Failaka Island)", "Icarus island"], ["Failaka Island", "Failaka Island"], ["Persian Gulf", "Persian Gulf"], ["Icaria", "Icarus island"], ["Aegean Sea", "Aegean"], ["Cilicia", "Cilicia"], ["Onesicritus", "Onesicritus"], ["Thalestris", "Thalestris"], ["Amazons", "Amazons"], ["Lysimachus", "Lysimachus"], ["Alexander Romance", "Alexander Romance"], ["Middle Ages", "Middle Ages"], ["Jean Wauquelin, ''Les faits et conquêtes d'Alexandre le Grand'', 1448–1449", "Jean Wauquelin, ''Les faits et conquêtes d'Alexandre le Grand'', 1448–1449"], ["Karagiozis", "Karagiozis"], ["mermaid", "mermaid"], ["Gorgon", "Gorgon"], ["submersible", "submersible"], ["Middle Persian language", "Middle Persian"], ["Zoroastrian", "Zoroastrian"], ["Sunni Islam", "Sunni Islam"], ["Alexander Romance", "Alexander Romance"], ["Iskandarnamah", "Iskandarnamah"], ["Firdausi", "Firdausi"], ["Shahnameh", "Shahnameh"], ["shah", "shah"], ["Fountain of Youth", "Fountain of Youth"], ["Mecca", "Mecca"], ["Kaaba", "Kaaba"], ["Hajj", "Hajj"], ["Socrates", "Socrates"], ["Plato", "Plato"], ["Dhul-Qarnayn", "Dhul-Qarnayn"], ["Quran", "Quran"], ["Gog and Magog", "Gog and Magog"], ["Syriac language", "Syriac"], ["Nectanebo II", "Nectanebo II"], ["pharaoh", "pharaoh"], ["Josephus", "Josephus"], ["Book of Daniel", "Book of Daniel"], ["Hindi", "Hindi"], ["Urdu", "Urdu"], ["Iskandar", "Sikandar"], ["Delhi Sultanate", "Delhi Sultanate"], ["Alauddin Khalji", "Aladdin Khalji"], ["medieval India", "medieval India"], ["Alexander romance", "Alexander Romances"], ["Amir Khusrow", "Amir Khusrow"], ["Middle Ages", "medieval Europe"], ["Nine Worthies", "Nine Worthies"], ["chivalry", "chivalry"], ["Italian campaigns of the French Revolutionary Wars", "Italian campaign of the French Revolutionary Wars"], ["Napoleon", "Napoleon"], ["Greek Anthology", "Greek Anthology"], ["Iron Maiden", "Iron Maiden"], ["Sikandar (1941 film)", "Sikandar"], ["Sohrab Modi", "Sohrab Modi"], ["Alexander the Great (1956 film)", "Alexander the Great"], ["Richard Burton", "Richard Burton"], ["Alexander (2004 film)", "Alexander"], ["Oliver Stone", "Oliver Stone"], ["Colin Farrell", "Colin Farrell"], ["Valerio Massimo Manfredi", "Valerio Massimo Manfredi"], ["Mary Renault", "Mary Renault"], ["Fire from Heaven", "Fire from Heaven"], ["The Persian Boy", "The Persian Boy"], ["Funeral Games (novel)", "Funeral Games"], ["The Virtues of War", "The Virtues of War"], ["The Afghan Campaign", "The Afghan Campaign"], ["Steven Pressfield", "Steven Pressfield"], ["Aubrey Thomas de Vere", "Aubrey Thomas de Vere"], ["Alexander the Great, a Dramatic Poem", "Alexander the Great, a Dramatic Poem"], ["Nearchus", "Nearchus"], ["Aristobulus of Cassandreia", "Aristobulus"], ["primary source", "original sources"], ["Diodorus Siculus", "Diodorus Siculus"], ["Justin (historian)", "Justin"], ["Ancient Macedonian army", "Ancient Macedonian army"], ["Bucephalus", "Bucephalus"], ["Chronology of European exploration of Asia", "Chronology of European exploration of Asia"], ["Theories about Alexander the Great in the Quran", "Theories about Alexander the Great in the Quran"], ["Ptolemaic cult of Alexander the Great", "Ptolemaic cult of Alexander the Great"], ["Gates of Alexander", "Gates of Alexander"], ["List of biblical figures identified in extra-biblical sources", "List of biblical figures identified in extra-biblical sources"], ["List of people known as The Great", "List of people known as The Great"], ["Penguin Books", "Penguin Books"]]}