{"title": "Arthur Schopenhauer", "section_titles": ["Introduction", "Life", "Philosophy", "Interests", "Thoughts on other philosophers", "Influence and legacy", "Selected bibliography", "See also", "References", "Further reading", "External links"], "section_texts": ["\n\n\n\n'''Arthur Schopenhauer''' ( , ; 22 February 1788 – 21 September 1860) was a German philosopher. He is best known for his 1818 work ''The World as Will and Representation'' (expanded in 1844), which characterizes the phenomenal world as the product of a blind noumenal will. Building on the transcendental idealism of Immanuel Kant, Schopenhauer developed an atheistic metaphysical and ethical system that rejected the contemporaneous ideas of German idealism. He was among the first thinkers in Western philosophy to share and affirm significant tenets of Indian philosophy, such as asceticism, denial of the self, and the notion of the world-as-appearance. His work has been described as an exemplary manifestation of philosophical pessimism.\n\nThough his work failed to garner substantial attention during his lifetime, Schopenhauer had a posthumous impact across various disciplines, including philosophy, literature, and science. His writing on aesthetics, morality, and psychology have influenced many thinkers and artists. Those who have cited his influence include philosophers Emil Cioran, Friedrich Nietzsche and Ludwig Wittgenstein, scientists Erwin Schrödinger and Albert Einstein, psychoanalysts Sigmund Freud and Carl Jung, writers Leo Tolstoy, Herman Melville, Thomas Mann, Hermann Hesse, Machado de Assis, Jorge Luis Borges, Marcel Proust, and Samuel Beckett and composers Richard Wagner, Johannes Brahms, Arnold Schoenberg and Gustav Mahler.\n", "=== Early life ===\nSchopenhauer's birthplace house, ul. Św. Ducha (formerly ''Heiligegeistgasse'')\nArthur Schopenhauer was born on February 22, 1788, in Danzig (then part of the Polish–Lithuanian Commonwealth; present-day Gdańsk, Poland) on Heiligegeistgasse (present day Św. Ducha 47), the son of Johanna Schopenhauer (née Trosiener) (1766–1838) and Heinrich Floris Schopenhauer (1747–1805), both descendants of wealthy German-Dutch patrician families. Neither of them was very religious; both supported the French Revolution, and were republicans, cosmopolitans and Anglophiles. When Danzig became part of Prussia in 1793, Heinrich moved to Hamburg—a free city with a republican constitution. His firm continued trading in Danzig where most of their extended families remained. Adele, Arthur's only sibling, was born on July 12, 1797.\n\nIn 1797, Arthur was sent to Le Havre to live with the family of his father's business associate, Grégoire de Blésimaire. He seemed to enjoy his two year stay there, learning to speak French and fostering a life-long friendship with Jean Anthime Grégoire de Blésimaire. As early as 1799, Arthur started playing the flute.  In 1803, he accompanied his parents on a European tour of Holland, Britain, France, Switzerland, Austria and Prussia.  Viewed as primarily a pleasure tour, Heinrich used the opportunity to visit some of his business associates abroad. \n\nHeinrich offered Arthur a choice:  he could stay at home and start preparations for university, or he could travel with them and continue his merchant education. Arthur chose to travel with them.  He deeply regretted his choice later because the merchant training was very tedious. He spent twelve weeks of the tour attending school in Wimbledon, where he was disillusioned by strict and intellectually shallow Anglican religiosity.  He continued to sharply criticize Anglican religiosity later in life despite his general Anglophilia. He was also under pressure from his father, who became very critical of his educational results. \n\nIn 1805, Heinrich drowned in a canal near their home in Hamburg. Although it was possible that his death was accidental, his wife and son believed that it was suicide.  He was prone to unsociable behavior such as anxiety and depression; each becoming more pronounced later in his life.  Heinrich had become so fussy, even his wife started to doubt his mental health. \"There was, in the father's life, some dark and vague source of fear which later made him hurl himself to his death from the attic of his house in Hamburg.\"  \n\nArthur showed similar moodiness during his youth and often acknowledged that he inherited it from his father. There were other instances of serious mental health history on his father's side of the family. Despite his hardship, Schopenhauer liked his father and later referred to him in a positive light.  Heinrich Schopenhauer left the family with a significant inheritance that was split in three among Johanna and the children. Arthur Schopenhauer was entitled to control of his part when he reached the age of majority. He invested it conservatively in government bonds and earned annual interest that was more than double the salary of a university professor.  After quitting his merchant apprenticeship, with some encouragement from his mother, he dedicated himself to studies at the Ernestine Gymnasium, Gotha, in Saxe-Gotha-Altenburg. While there, he also enjoyed social life among the local nobility, spending large amounts of money, which deeply concerned his frugal mother.  He left the Gymnasium after writing a satirical poem about one of the schoolmasters.  Although Arthur claimed that he left voluntarily, his mother's letter indicates that he may have been expelled.\n\nSchopenhauer as a youth\nArthur spent two years as a merchant in honor of his dead father.  During this time, he had doubts about being able to start a new life as a scholar. Most of his prior education was as a practical merchant and he had trouble learning Latin; a prerequisite for an academic career. \n\nHis mother moved away, with her daughter Adele, to Weimarthe then centre of German literatureto enjoy social life among writers and artists. Arthur and his mother did not part on good terms. In one letter, she wrote: \"You are unbearable and burdensome, and very hard to live with; all your good qualities are overshadowed by your conceit, and made useless to the world simply because you cannot restrain your propensity to pick holes in other people.\" His mother, Johanna, was generally described as vivacious and sociable.  After they split, they did not meet again. She died 24 years later. Some of Arthur's negative opinions about women may be rooted in his troubled relationship with his mother.\n\nArthur moved to Hamburg to live with his friend Jean Anthime, who was also studying to become a merchant.\n\n=== Education ===\nHe moved to Weimar but did not live with his mother, who even tried to discourage him from coming by explaining that they would not get along very well. Their relationship deteriorated even further due to their temperamental differences. He accused his mother of being financially irresponsible, flirtatious and seeking to remarry, which he considered an insult to his father's memory. His mother, while professing her love to him, criticized him sharply for being moody, tactless, and argumentative, and urged him to improve his behavior so that he would not alienate people. Arthur concentrated on his studies, which were now going very well, and he also enjoyed the usual social life such as balls, parties and theater. By that time Johanna's famous salon was well established among local intellectuals and dignitaries, the most celebrated of them being Goethe. Arthur attended her parties, usually when he knew that Goethe would be therealthough the famous writer and statesman seemed not even to notice the young and unknown student. It is possible that Goethe kept a distance because Johanna warned him about her son's depressive and combative nature, or because Goethe was then on bad terms with Arthur's language instructor and roommate, Franz Passow. Schopenhauer was also captivated by the beautiful Karoline Jagemann, mistress of Karl August, Grand Duke of Saxe-Weimar-Eisenach, and he wrote to her his only known love poem. Despite his later celebration of asceticism and negative views of sexuality, Schopenhauer occasionally had sexual affairsusually with women of lower social status, such as servants, actresses, and sometimes even paid prostitutes. In a letter to his friend Anthime he claims that such affairs continued even in his mature age and admits that he had two out-of-wedlock daughters (born in 1819 and 1836), both of whom died in infancy. In their youthful correspondence Arthur and Anthime were somewhat boastful and competitive about their sexual exploits—but Schopenhauer seemed aware that women usually did not find him very charming or physically attractive, and his desires often remained unfulfilled.\n\nHe left Weimar to become a student at the University of Göttingen in 1809. There are no written reasons about why Schopenhauer chose that university instead of the then more famous University of Jena, but Göttingen was known as more modern and scientifically oriented, with less attention given to theology. Law or medicine were usual choices for young men of Schopenhauer's status who also needed career and income; he chose medicine due to his scientific interests. Among his notable professors were Bernhard Friedrich Thibaut, Arnold Hermann Ludwig Heeren, Johann Friedrich Blumenbach, Friedrich Stromeyer, Heinrich Adolf Schrader, Johann Tobias Mayer and Konrad Johann Martin Langenbeck. He studied metaphysics, psychology and logic under Gottlob Ernst Schulze, the author of ''Aenesidemus'', who made a strong impression and advised him to concentrate on Plato and Immanuel Kant. He decided to switch from medicine to philosophy around 1810–11 and he left Göttingen, which did not have a strong philosophy program:  besides Schulze, the only other philosophy professor was Friedrich Bouterwek, whom Schopenhauer disliked. He did not regret his medicinal and scientific studies;  he claimed that they were necessary for a philosopher, and even in Berlin he attended more lectures in sciences than in philosophy. During his days at Göttingen, he spent considerable time studying, but also continued his flute playing and social life. His friends included Friedrich Gotthilf Osann, Karl Witte, Christian Charles Josias von Bunsen, and William Backhouse Astor Sr.\n\nHe arrived at the newly founded University of Berlin for the winter semester of 1811–12. At the same time, his mother had just begun her literary career; she published her first book in 1810, a biography of her friend Karl Ludwig Fernow, which was a critical success. Arthur attended lectures by the prominent post-Kantian philosopher Johann Gottlieb Fichte, but quickly found many points of disagreement with his ; he also found Fichte's lectures tedious and hard to understand. He later mentioned Fichte only in critical, negative termsseeing his philosophy as a lower quality version of Kant's and considering it useful only because Fichte's poor arguments unintentionally highlighted some failings of Kantianism. He also attended the lectures of the famous Protestant theologian Friedrich Schleiermacher, whom he also quickly came to dislike. His notes and comments on Schleiermacher's lectures show that Schopenhauer was becoming very critical of religion and moving towards atheism. He learned by self-directed reading; besides Plato, Kant and Fichte he also read the works of Schelling, Fries, Jacobi, Bacon, Locke, and much current scientific literature. He attended philological courses by August Böckh and Friedrich August Wolf and continued his naturalistic interests with courses by Martin Heinrich Klaproth, Paul Erman, Johann Elert Bode, Ernst Gottfried Fischer, Johann Horkel, Friedrich Christian Rosenthal and Hinrich Lichtenstein (Lichtenstein was also a friend whom he met at one of his mother's parties in Weimar).\n\n=== Early work ===\nSchopenhauer left Berlin in a rush in 1813, fearing that the city could be attacked and that he could be pressed into military service as Prussia had just joined the war against France. He returned to Weimar, but left after less than a month disgusted by the fact that his mother was now living with her supposed lover, Georg Friedrich Konrad Ludwig Müller von Gerstenbergk (1778–1838), a civil servant twelve years younger than her; he considered the relationship an act of infidelity to his father's memory. He settled for a while in Rudolstadt, hoping that no army would pass through the small town.  He spent his time in solitude, hiking in the mountains and the Thuringian forest and writing his dissertation, ''On the Fourfold Root of the Principle of Sufficient Reason''. He completed his dissertation at about the same time as the French army was defeated at the Battle of Leipzig. He became irritated by the arrival of soldiers in the town and accepted his mother's invitation to visit her in Weimar. She tried to convince him that her relationship with Gerstenbergk was platonic and that she had no intention of remarrying. But Schopenhauer remained suspicious and often came in conflict with Gerstenbergk because he considered him untalented, pretentious, and nationalistic. His mother had just published her second book, ''Reminiscences of a Journey in the Years 1803, 1804, and 1805'', a description of their family tour of Europe, which quickly became a hit. She found his dissertation incomprehensible and said it was unlikely that anyone would ever buy a copy. In a fit of temper Arthur told her that people would read his work long after the \"rubbish\" she wrote was totally forgotten. In fact, although they considered her novels of dubious quality, the Brockhaus publishing firm held her in high esteem because they consistently sold well. Hans Brockhaus (1888–1965) later claimed that his predecessors \"saw nothing in this manuscript, but wanted to please one of our best-selling authors by publishing her son's work. We published more and more of her son Arthur's work and today nobody remembers Johanna, but her son's works are in steady demand and contribute to Brockhaus's reputation.\" He kept large portraits of the pair in his office in Leipzig for the edification of his new editors.\n\nAlso contrary to his mother's prediction, Schopenhauer's dissertation made an impression on Goethe, to whom he sent it as a gift. Although it is doubtful that Goethe agreed with Schopenhauer's philosophical positions, he was impressed by his intellect and extensive scientific education. Their subsequent meetings and correspondence were a great honor to a young philosopher, who was finally acknowledged by his intellectual hero. They mostly discussed Goethe's newly published (and somewhat lukewarmly received) work on color theory. Schopenhauer soon started writing his own treatise on the subject, ''On Vision and Colors'', which in many points differed from his teacher's. Although they remained polite towards each other, their growing theoretical disagreementsand especially Schopenhauer's extreme self-confidence and tactless criticismssoon made Goethe become distant again and after 1816 their correspondence became less frequent. Schopenhauer later admitted that he was greatly hurt by this rejection, but he continued to praise Goethe, and considered his color theory a great introduction to his own.\n\nAnother important experience during his stay in Weimar was his acquaintance with Friedrich Majera historian of religion, orientalist and disciple of Herderwho introduced him to Eastern philosophy (see also Indology). Schopenhauer was immediately impressed by the ''Upanishads'' (he called them \"the production of the highest human wisdom\", and believed that they contained superhuman concepts) and the Buddha, and put them on a par with Plato and Kant. He continued his studies by reading the ''Bhagavad Gita'', an amateurish German journal ''Asiatisches Magazin'' and ''Asiatick Researches'' by the Asiatic Society. Schopenhauer held a profound respect for Indian philosophy; although he loved Hindu texts, he was more interested in Buddhism, which he came to regard as the best religion. However, his studies on Hindu and Buddhist texts were constrained by the lack of adequate literature, and the latter were mostly restricted to Early Buddhism. He also claimed that he formulated most of his ideas independently, and only later realized the similarities with Buddhism.\n\nSchopenhauer read the Latin translation and praised the Upanishads in his main work, ''The World as Will and Representation'' (1819), as well as in his ''Parerga and Paralipomena'' (1851) \n\nand commented,In the whole world there is no study so beneficial and so elevating as that of the Upanishads. It has been the solace of my life, it will be the solace of my death.\n\nSchopenhauer in 1815. Portrait by Ludwig Sigismund Ruhl.\nAs the relationship with his mother fell to a new low, in May 1814 he left Weimar and moved to Dresden. He continued his philosophical studies, enjoyed the cultural life, socialized with intellectuals and engaged in sexual affairs. His friends in Dresden were Johann Gottlob von Quandt, Friedrich Laun, Karl Christian Friedrich Krause and Ludwig Sigismund Ruhl, a young painter who made a romanticized portrait of him in which he improved some of Schopenhauer's unattractive physical features.  His criticisms of local artists occasionally caused public quarrels when he ran into them in public. However, his main occupation during his stay in Dresden was his seminal philosophical work, ''The World as Will and Representation'', which he started writing in 1814 and finished in 1818. He was recommended to the publisher Friedrich Arnold Brockhaus by Baron Ferdinand von Biedenfeld, an acquaintance of his mother. Although Brockhaus accepted his manuscript, Schopenhauer made a poor impression because of his quarrelsome and fussy attitude, as well as very poor sales of the book after it was published in December 1818.\n\nIn September 1818, while waiting for his book to be published and conveniently escaping an affair with a maid that caused an unwanted pregnancy, Schopenhauer left Dresden for a year-long vacation in Italy. He visited Venice, Bologna, Florence, Naples and Milan, travelling alone or accompanied by mostly English tourists he met. He spent the winter months in Rome, where he accidentally met his acquaintance Karl Witte and engaged in numerous quarrels with German tourists in Caffe Greco, among them Johann Friedrich Böhmer, who also mentioned his insulting remarks and unpleasant character. He enjoyed art, architecture, and ancient ruins, attended plays and operas, and continued his philosophical contemplation and love affairs. One of his affairs supposedly became serious, and for a while he contemplated marriage to a rich Italian noblewomanbut, despite his mentioning this several times, no details are known and it may have been Schopenhauer exaggerating. He corresponded regularly with his sister Adele and became close to her as her relationship with Johanna and Gerstenbergk also deteriorated. She informed him about their financial troubles as the banking house of A. L. Muhl in Danzigin which her mother invested their whole savings and Arthur a third of hiswas near bankruptcy. Arthur offered to share his assets, but his mother refused and became further enraged by his insulting comments. The women managed to receive only thirty percent of their savings while Arthur, using his business knowledge, took a suspicious and aggressive stance towards the banker and eventually received his part in full.  The affair additionally worsened the relationships among all three members of the Schopenhauer family.\n\nHe shortened his stay in Italy because of the trouble with Muhl and returned to Dresden. Disturbed by the financial risk and the lack of responses to his book he decided to take an academic position since it provided him with both income and an opportunity to promote his views. He contacted his friends at universities in Heidelberg, Göttingen and Berlin and found Berlin most attractive. He scheduled his lectures to coincide with those of the famous philosopher G. W. F. Hegel, whom Schopenhauer described as a \"clumsy charlatan\".  He was especially appalled by Hegel's supposedly poor knowledge of natural sciences and tried to engage him in a quarrel about it already at his test lecture in March 1820.  Hegel was also facing political suspicions at the time, when many progressive professors were fired, while Schopenhauer carefully mentioned in his application that he had no interest in politics. Despite their differences and the arrogant request to schedule lectures at the same time as his own, Hegel still voted to accept Schopenhauer to the university. However, only five students turned up to Schopenhauer's lectures, and he dropped out of academia. A late essay, \"On University Philosophy\", expressed his resentment towards the work conducted in academies.\n\n=== Later life ===\nSculpture of Arthur Schopenhauer by Giennadij Jerszow\nAfter his academic failure he continued to travel extensively, visiting Leipzig, Nuremberg, Stuttgart, Schaffhausen, Vevey, Milan and spending eight months in Florence.  However, before he left for his three-year travel, he had an incident with his Berlin neighbor, 47-year-old seamstress Caroline Louise Marquet.  The details of the August 1821 incident are unknown. He claimed that he had just pushed her from his entrance after she had rudely refused to leave, and that she had purposely fallen to the ground so that she could sue him.  She claimed that he had attacked her so violently that she had become paralyzed on her right side and unable to work.  She immediately sued him, and the process lasted until May 1827, when a court found Schopenhauer guilty and forced him to pay her an annual pension until her death in 1842.\n\nSchopenhauer enjoyed Italy, where he studied art and socialized with Italian and English nobles.  It was his last visit to the country.  He left for Munich and stayed there for a year, mostly recuperating from various health issues, some of them possibly caused by venereal diseases (the treatment his doctor used suggests syphilis).  He contacted publishers, offering to translate Hume into German and Kant into English, but his proposals were declined.  Returning to Berlin, he began to study Spanish so he could read some of his favorite authors in their original language.  He liked Pedro Calderón de la Barca, Lope de Vega, Miguel de Cervantes, and especially Baltasar Gracián.  He also made failed attempts to publish his translations of their works.  Few attempts to revive his lecturesagain scheduled at the same time as Hegel'salso failed, as did his inquiries about relocating to other universities.\n\nDuring his Berlin years, Schopenhauer occasionally mentioned his desire to marry and have a family.  For a while he was unsuccessfully courting 17-year-old Flora Weiss, who was 22 years younger than himself.  His unpublished writings from that time show that he was already very critical of monogamy but still not advocating polygynyinstead musing about a polyamorous relationship that he called \"tetragamy\".  He had an on-and-off relationship with a young dancer, Caroline Richter (she also used the surname Medon after one of her ex-lovers). They met when he was 33 and she was 19 and working at the Berlin Opera. She had already had numerous lovers and a son out of wedlock, and later gave birth to another son, this time to an unnamed foreign diplomat (she soon had another pregnancy but the child was stillborn). As Schopenhauer was preparing to escape from Berlin in 1831, due to a cholera epidemic, he offered to take her with him on the condition that she left her young son behind. She refused and he went alone; in his will he left her a significant sum of money, but insisted that it should not be spent in any way on her second son.\n\nSchopenhauer claimed that, in his last year in Berlin, he had a prophetic dream that urged him to escape from the city. As he arrived in his new home in Frankfurt, he supposedly had another supernatural experience, an apparition of his dead father and his mother, who was still alive. This experience led him to spend some time investigating paranormal phenomena and magic. He was quite critical of the available studies and claimed that they were mostly ignorant or fraudulent, but he did believe that there are authentic cases of such phenomena and tried to explain them through his metaphysics as manifestations of the will.\n\nUpon his arrival in Frankfurt, he experienced a period of depression and declining health. He renewed his correspondence with his mother, and she seemed concerned that he might commit suicide like his father. By now Johanna and Adele were living very modestly. Johanna's writing did not bring her much income, and her popularity was waning. Their correspondence remained reserved, and Arthur seemed undisturbed by her death in 1838. His relationship with his sister grew closer and he corresponded with her until she died in 1849.\n\nIn July 1832 Schopenhauer left Frankfurt for Mannheim but returned in July 1833 to remain there for the rest of his life, except for a few short journeys. He lived alone except for a succession of pet poodles named Atman and Butz. In 1836, he published ''On the Will in Nature''. In 1836 he sent his essay \"On the Freedom of the Will\" to the contest of the Royal Norwegian Society of Sciences and won the prize for the following year.  He sent another essay, \"On the Basis of Morality\", to the Royal Danish Society for Scientific Studies, but did not win the prize despite being the only contestant.  The Society was appalled that several distinguished contemporary philosophers were mentioned in a very offensive manner, and claimed that the essay missed the point of the set topic and that the arguments were inadequate. Schopenhauer, who had been very confident that he would win, was enraged by this rejection. He published both essays as ''The Two Basic Problems of Ethics''.  The first edition, published in 1841, again failed to draw attention to his philosophy. In the preface to the second edition, in 1860, he was still pouring insults on the Royal Danish Society.  Two years later, after some negotiations, he managed to convince his publisher, Brockhaus, to print the second, updated edition of ''The World as Will and Representation''.  That book was again mostly ignored and the few reviews were mixed or negative. \n \nHowever, Schopenhauer did start to attract some followers, mostly outside academia, among practical professionals (several of them were lawyers) who pursued private philosophical studies. He jokingly referred to them as \"evangelists\" and \"apostles\". One of the most active early followers was Julius Frauenstädt, who wrote numerous articles promoting Schopenhauer's philosophy. He was also instrumental in finding another publisher after Brockhaus declined to publish ''Parerga and Paralipomena'', believing that it would be another failure. Though Schopenhauer later stopped corresponding with him, claiming that he did not adhere closely enough to his ideas, Frauenstädt continued to promote Schopenhauer's work. They renewed their communication in 1859 and Schopenhauer named him heir for his literary estate.  Frauenstädt also became the editor of the first collected works of Schopenhauer.\n\nIn 1848 Schopenhauer witnessed violent upheaval in Frankfurt after General Hans Adolf Erdmann von Auerswald and Prince Felix Lichnowsky were murdered. He became worried for his own safety and property. Even earlier in life he had had such worries and kept a sword and loaded pistols near his bed to defend himself from thieves. He gave a friendly welcome to Austrian soldiers who wanted to shoot revolutionaries from his window and as they were leaving he gave one of the officers his opera glasses to help him monitor rebels. The rebellion passed without any loss to Schopenhauer and he later praised Alfred I, Prince of Windisch-Grätz for restoring order.  He even modified his will, leaving a large part of his property to a Prussian fund that helped soldiers who became invalids while fighting rebellion in 1848 or the families of soldiers who died in battle. As Young Hegelians were advocating change and progress, Schopenhauer claimed that misery is natural for humans and that, even if some utopian society were established, people would still fight each other out of boredom, or would starve due to overpopulation.\n\n1855 painting of Schopenhauer by Jules Lunteschütz\nIn 1851 Schopenhauer published ''Parerga and Paralipomena'', which, as the title says, contains essays that are supplementary to his main work. It was his first successful, widely read book, partly due to the work of his disciples who wrote praising reviews. The essays that proved most popular were the ones that actually did not contain the basic philosophical ideas of his system.  Many academic philosophers considered him a great stylist and cultural critic but did not take his philosophy seriously. His early critics liked to point out similarities of his ideas to those Fichte and Schelling, or to claim that there were numerous contradictions in his philosophy. Both criticisms enraged Schopenhauer. However, he was becoming less interested in intellectual fights, but encouraged his disciples to do so. His private notes and correspondence show that he acknowledged some of the criticisms regarding contradictions, inconsistencies, and vagueness in his philosophy, but claimed that he was not concerned about harmony and agreement in his propositions and that some of his ideas should not be taken literally but instead as metaphors.\n\nAcademic philosophers were also starting to notice his work. In 1856 the University of Leipzig sponsored an essay contest about Schopenhauer's philosophy, which was won by Rudolf Seydel's very critical essay. Schopenhauer's friend Jules Lunteschütz made the first of his four portraits of himwhich Schopenhauer did not particularly likewhich was soon sold to a wealthy landowner, Carl Ferdinand Wiesike, who built a house to display it.  Schopenhauer seemed flattered and amused by this, and would claim that it was his first chapel. As his fame increased, copies of paintings and photographs of him were being sold and admirers were visiting the places where he had lived and written his works.  People visited Frankfurt's ''Englischer Hof'' to observe him dining. Admirers gave him gifts and asked for autographs.  He complained, however, that he still felt isolated due to his not very social nature and the fact that many of his good friends had already died from old age.\n\nHauptfriedhof'' in Frankfurt\nHe remained healthy in his own old age, which he attributed to regular walks no matter the weather and always getting enough sleep. He had a great appetite and could read without glasses, but his hearing had been declining since his youth and he developed problems with rheumatism. He remained active and lucid, continued his reading, writing and correspondence until his death. The numerous notes that he made during these years, amongst others on aging, were published posthumously under the title ''Senilia''. In the spring of 1860 his health began to decline, and he experienced shortness of breath and heart palpitations; in September he suffered inflammation of the lungs and, although he was starting to recover, he remained very weak. The last friend to visit him was Wilhelm Gwinner;  according to him, Schopenhauer was concerned that he would not be able to finish his planned additions to ''Parerga and Paralipomena'' but was at peace with dying. He died of pulmonary-respiratory failure on 21 September 1860 while sitting at home on his couch. He was 72.\n", "\n=== The world as representation ===\nSchopenhauer saw his philosophy as an extension of Kant's, and used the results of Kantian epistemological investigation (transcendental idealism) as starting point for his own. Kant had argued that the empirical world is merely a complex of appearances whose existence and connection occur only in our mental representations. Schopenhauer reiterates this in the first sentence of his main work: \"The world is my representation (''Die Welt ist meine Vorstellung'')\". Everything that there is for cognition (the entire world) exists simply as an object in relation to a subjecta 'representation' to a subject. Everything that belongs to the world is, therefore, 'subject-dependent'. In Book One of ''The World as Will and Representation,'' Schopenhauer considers the world from this anglethat is, insofar as it is representation.\n\n=== Theory of perception ===\nIn November 1813 Goethe invited Schopenhauer to help him on his Theory of Colours. Although Schopenhauer considered colour theory a minor matter, he accepted the invitation out of admiration for Goethe. Nevertheless, these investigations led him to his most important discovery in epistemology: finding a demonstration for the ''a priori'' nature of causality.\n\nKant openly admitted that it was Hume's skeptical assault on causality that motivated the critical investigations in his ''Critique of Pure Reason'' and gave an elaborate proof to show that causality is ''a priori''. After G. E. Schulze had made it plausible that Kant had not disproven Hume's skepticism, it was up to those loyal to Kant's project to prove this important matter.\n\nThe difference between the approaches of Kant and Schopenhauer was this: Kant simply declared that the empirical content of perception is \"given\" to us from outside, an expression with which Schopenhauer often expressed his dissatisfaction. He, on the other hand, was occupied with the questions: how do we get this empirical content of perception; how is it possible to comprehend subjective sensations \"limited to my skin\" as the objective perception of things that lie \"outside\" of me?\n\n\n\nCausality is therefore not an empirical concept drawn from objective perceptions, as Hume had maintained;  instead, as Kant had said, objective perception presupposes knowledge of causality.\n\nBy this intellectual operation, comprehending every effect in our sensory organs as having an external cause, the external world arises. With vision, finding the cause is essentially simplified due to light acting in straight lines. We are seldom conscious of the process that interprets the double sensation in both eyes as coming from one object, that inverts the impressions on the retinas, and that uses the change in the apparent position of an object relative to more distant objects provided by binocular vision to perceive depth and distance.\n\nSchopenhauer stresses the importance of the intellectual nature of perception; the senses furnish the raw material by which the intellect produces the world as representation. He set out his theory of perception for the first time in ''On Vision and Colors'', and, in the subsequent editions of ''Fourfold Root'', an extensive exposition is given in § 21.\n\n=== The world as will ===\n\n\nIn Book Two of ''The World as Will and Representation,'' Schopenhauer considers what the world is beyond the aspect of it that appears to usthat is, the aspect of the world beyond representation, the world considered \"in-itself\" or \"noumena\", its inner essence. The very being in-itself of all things, Schopenhauer argues, is will (''Wille''). The empirical world that appears to us as representation has plurality and is ordered in a spatio-temporal framework. The world as thing in-itself must exist outside the subjective forms of space and time. Although the world manifests itself to our experience as a multiplicity of objects (the \"objectivation\" of the will), each element of this multiplicity has the same blind essence striving towards existence and life. Human rationality is merely a secondary phenomenon that does not distinguish humanity from the rest of nature at the fundamental, essential level. The advanced cognitive abilities of human beings, Schopenhauer argues, serve the ends of willingan illogical, directionless, ceaseless striving that condemns the human individual to a life of suffering unredeemed by any final purpose. Schopenhauer's philosophy of the will as the essential reality behind the world as representation is often called metaphysical voluntarism.\n\nFor Schopenhauer, understanding the world as will leads to ethical concerns (see the ethics section below for further detail), which he explores in the Fourth Book of ''The World as Will and Representation'' and again in his two prize essays on ethics, ''On the Freedom of the Will'' and ''On the Basis of Morality''. No individual human actions are free, Schopenhauer argues, because they are events in the world of appearance and thus are subject to the principle of sufficient reason: a person's actions are a necessary consequence of motives and the given character of the individual human. Necessity extends to the actions of human beings just as it does to every other appearance, and thus we cannot speak of freedom of individual willing. Albert Einstein quoted the Schopenhauerian idea that \"a man can ''do'' as he will, but not ''will'' as he will.\" Yet the will as thing in-itself is free, as it exists beyond the realm of representation and thus is not constrained by any of the forms of necessity that are part of the principle of sufficient reason.\n\nAccording to Schopenhauer, salvation from our miserable existence can come through the will's being 'tranquillized' by the metaphysical insight that reveals individuality to be merely an illusion. The saint or 'great soul' intuitively \"recognizes the whole, comprehends its essence, and finds that it is constantly passing away, caught up in vain strivings, inner conflict, and perpetual suffering\". The negation of the will, in other words, stems from the insight that the world in-itself (free from the forms of space and time) is one. Ascetic practices, Schopenhauer remarks, are used to aid the will's 'self-abolition', which brings about a blissful, redemptive 'will-less' state of emptiness that is free from striving or suffering.\n\n=== Art and aesthetics ===\n\nDutch Golden Age artists, who \"directed such purely objective perception to the most insignificant objects, and set up a lasting monument of their objectivity and spiritual peace in paintings of ''still life.'' The aesthetic beholder does not contemplate this without emotion.\"\nFor Schopenhauer, human \"willing\"—desiring, craving, etc.—is at the root of suffering. A temporary way to escape this pain is through aesthetic contemplation. Here one moves away from ordinary cognizance of individual things to cognizance of eternal Platonic ''Ideas''—in other words, cognizance that is free from the service of will. In aesthetic contemplation, one no longer perceives an object of perception as something from which one is separated; rather \"it is as if the object alone existed without anyone perceiving it, and one can thus no longer separate the perceiver from the perception, but the two have become one, the entirety of consciousness entirely filled and occupied by a single perceptual image\". Subject and object are no longer distinguishable, and the ''Idea'' comes to the fore.\n\nFrom this aesthetic immersion, one is no longer an individual who suffers as a result of servitude to one's individual will but, rather, becomes a \"pure, will-less, painless, timeless, subject of cognition\". The pure, will-less subject of cognition is cognizant only of Ideas, not individual things: this is a kind of cognition that is unconcerned with relations between objects according to the Principle of Sufficient Reason (time, space, cause and effect) and instead involves complete absorption in the object.\n\nArt is the practical consequence of this brief aesthetic contemplation, since it attempts to depict the essence/pure Ideas of the world. Music, for Schopenhauer, is the purest form of art because it is the one that depicts the will itself without it appearing as subject to the Principle of Sufficient Reason, therefore as an individual object. According to Daniel Albright, \"Schopenhauer thought that music was the only art that did not merely copy ideas, but actually embodied the will itself\". He deemed music a timeless, universal language comprehended everywhere, that can imbue global enthusiasm, if in possession of a significant melody.\n\n=== Mathematics ===\nSchopenhauer's realist views on mathematics are evident in his criticism of contemporaneous attempts to prove the parallel postulate in Euclidean geometry. Writing shortly before the discovery of hyperbolic geometry demonstrated the logical independence of the axiom—and long before the general theory of relativity revealed that it does not necessarily express a property of physical space—Schopenhauer criticized mathematicians for trying to use indirect concepts to prove what he held was directly evident from intuitive perception.\n\n\n\nThroughout his writings, Schopenhauer criticized the logical derivation of philosophies and mathematics from mere concepts, instead of from intuitive perceptions.\n\n\n\nAlthough Schopenhauer could see no justification for trying to prove Euclid's parallel postulate, he did see a reason for examining another of Euclid's axioms.\n\n\nThis follows Kant's reasoning.\n\n=== Ethics ===\n\nSchopenhauer asserts that the task of ethics is not to prescribe moral actions that ought to be done, but to investigate moral actions. As such, he states that philosophy is always theoretical: its task to explain what is given.\n\nAccording to Kant's transcendental idealism, space and time are forms of our sensibility in which phenomena appear in multiplicity. Reality in itself is free from multiplicity, not in the sense that an object is one, but that it is outside the ''possibility'' of multiplicity. Two individuals, though they appear distinct, are in-themselves not distinct.\n\nAppearances are entirely subordinated to the principle of sufficient reason. The egoistic individual who focuses his aims on his own interests has to deal with empirical laws as well as he can.\n\nWhat is relevant for ethics are individuals who can act against their own self-interest. If we take a man who suffers when he sees his fellow men living in poverty and consequently uses a significant part of his income to support ''their'' needs instead of his ''own'' pleasures, then the simplest way to describe this is that he makes ''less distinction between himself'' and others than is usually made.\n\nRegarding how things ''appear'' to us, the egoist asserts a gap between two individuals, but the altruist experiences the sufferings of others as his own. In the same way a compassionate man cannot hurt animals, though they appear as distinct from himself.\n\nWhat motivates the altruist is compassion. The suffering of others is for him not a cold matter to which he is indifferent, but he feels connectiveness to all beings. Compassion is thus the basis of morality.\n\n==== Eternal justice ====\nSchopenhauer calls the principle through which multiplicity appears the ''principium individuationis''. When we behold nature we see that it is a cruel battle for existence. Individual manifestations of the will can maintain themselves only at the expense of others—the will, as the only thing that exists, has no other option but to devour itself to experience pleasure. This is a fundamental characteristic of the will, and cannot be circumvented.\n\nUnlike temporal or human justice, which requires time to repay an evil deed and \"has its seat in the state, as requiting and punishing\", eternal justice \"rules not the state but the world, is not dependent upon human institutions, is not subject to chance and deception, is not uncertain, wavering, and erring, but infallible, fixed, and sure\". Eternal justice is not retributive, because retribution requires time. There are no delays or reprieves. Instead, punishment is tied to the offence, \"to the point where the two become one. ... Tormenter and tormented are one. The Tormenter errs in that he believes he is not a partaker in the suffering; the tormented, in that he believes he is not a partaker in the guilt.\"\n\nSuffering is the moral outcome of our attachment to pleasure. Schopenhauer deemed that this truth was expressed by the Christian dogma of original sin and, in Eastern religions, by the dogma of rebirth.\n\n==== Quietism ====\nHe who sees through the ''principium individuationis'' and comprehends suffering ''in general'' as his own will see suffering everywhere and, instead of fighting for the happiness of his individual manifestation, will abhor life itself since he knows that it is inseparably connected with suffering. For him, a happy individual life in a world of suffering is like a beggar who dreams one night that he is a king.\n\nThose who have experienced this intuitive knowledge cannot affirm life, but exhibit asceticism and quietism, meaning that they are no longer sensitive to motives, are not concerned about their individual welfare, and accept without resistance the evil that others inflict on them. They welcome poverty and neither seek nor flee death. Schopenhauer referred to asceticism as the denial of the will to live.\n\nHuman life is a ceaseless struggle for satisfaction and, instead of continuing their struggle, ascetics break it. It does not matter if these ascetics adhere to the dogmata of Christianity or to Dharmic religions, since their way of living is the result of intuitive knowledge.\n\n\n\n=== Psychology ===\nPhilosophers have not traditionally been impressed by the necessity of sex, but Schopenhauer addressed sex and related concepts forthrightly:\n\n\n\nHe named a force within man that he felt took invariable precedence over reason: the Will to Live or Will to Life (''Wille zum Leben''), defined as an inherent drive within human beings, and all creatures, to stay alive; a force that inveigles us into reproducing.\n\nSchopenhauer refused to conceive of love as either trifling or accidental, but rather understood it as an immensely powerful force that lay unseen within man's psyche, guaranteeing the quality of the human race:\n\n\n\nIt has often been argued that Schopenhauer's thoughts on sexuality foreshadowed the theory of evolution, a claim met with satisfaction by Darwin as he included a quotation from Schopenhauer in his ''Descent of Man''. This has also been noted about Freud's concepts of the libido and the unconscious mind, and evolutionary psychology in general.\n\n=== Political and social thought ===\n\n==== Politics ====\nBust in Frankfurt\nSchopenhauer's politics were an echo of his system of ethics, which he elucidated in detail in his ''Die beiden Grundprobleme der Ethik'' (the two essays ''On the Freedom of the Will'' and ''On the Basis of Morality'').\n\nIn occasional political comments in his ''Parerga and Paralipomena'' and ''Manuscript Remains'', Schopenhauer described himself as a proponent of limited government. Schopenhauer shared the view of Thomas Hobbes on the necessity of the state and state action to check the innate destructive tendencies of our species. He also defended the independence of the legislative, judicial and executive branches of power, and a monarch as an impartial element able to practise justice (in a practical and everyday sense, not a cosmological one).\n\nHe declared that monarchy is \"natural to man in almost the same way as it is to bees and ants, to cranes in flight, to wandering elephants, to wolves in a pack in search of prey, and to other animals\". Intellect in monarchies, he writes, always has \"much better chances against stupidity, its implacable and ever-present foe, than it has in republics; but this is a great advantage.\" On the other hand, Schopenhauer disparaged republicanism as being \"as unnatural to man as it is unfavorable to higher intellectual life and thus to the arts and sciences\".\n\nBy his own admission, Schopenhauer did not give much thought to politics, and several times he wrote proudly of how little attention he paid \"to political affairs of his day\".  In a life that spanned several revolutions in French and German government, and a few continent-shaking wars, he maintained his position of \"minding not the times but the eternities\".  He wrote many disparaging remarks about Germany and the Germans. A typical example is: \"For a German it is even good to have somewhat lengthy words in his mouth, for he thinks slowly, and they give him time to reflect.\"\n\n==== Punishment ====\nThe State, Schopenhauer claimed, punishes criminals to prevent future crimes. It places \"beside every possible motive for committing a wrong a more powerful motive for leaving it undone, in the inescapable punishment. Accordingly, the criminal code is as complete a register as possible of counter-motives to all criminal actions that can possibly be imagined ...\" He claimed that this doctrine was not original to him but had appeared in the writings of Plato, Seneca, Hobbes, Pufendorf, and Anselm Feuerbach.\n\n==== Races and religions ====\nSchopenhauer attributed civilizational primacy to the northern \"white races\" due to their sensitivity and creativity (except for the ancient Egyptians and Hindus, whom he saw as equal):\n\nThe highest civilization and culture, apart from the ancient Hindus and Egyptians, are found exclusively among the white races; and even with many dark peoples, the ruling caste or race is fairer in colour than the rest and has, therefore, evidently immigrated, for example, the Brahmans, the Incas, and the rulers of the South Sea Islands. All this is due to the fact that necessity is the mother of invention because those tribes that emigrated early to the north, and there gradually became white, had to develop all their intellectual powers and invent and perfect all the arts in their struggle with need, want and misery, which in their many forms were brought about by the climate. This they had to do in order to make up for the parsimony of nature and out of it all came their high civilization.\n\nSchopenhauer was fervently opposed to slavery. Speaking of the treatment of slaves in the slave-holding states of the United States, he condemned \"those devils in human form, those bigoted, church-going, strict sabbath-observing scoundrels, especially the Anglican parsons among them\" for how they \"treat their innocent black brothers who through violence and injustice have fallen into their devil's claws\". The slave-holding states of North America, Schopenhauer writes, are a \"disgrace to the whole of humanity\".\n\nIn his ''Metaphysics of Sexual Love'', Schopenhauer wrote: \n Further, the consideration as to the complexion is very decided. Blondes prefer dark persons, or brunettes; but the latter seldom prefer the former. The reason is, that fair hair and blue eyes are in themselves a variation from the type, almost an abnormity, analogous to white mice, or at least to grey horses. In no part of the world, not even in the vicinity of the pole, are they indigenous, except in Europe, and are clearly of Scandinavian origin. I may here express my opinion in passing that the white colour of the skin is not natural to man, but that by nature he has a black or brown skin, like our forefathers the Hindus; that consequently a white man has never originally sprung from the womb of nature, and that thus there is no such thing as a white race, much as this is talked of, but every white man is a faded or bleached one. Forced into the strange world, where he only exists like an exotic plant, and like this requires in winter the hothouse, in the course of thousands of years man became white. The gipsies, an Indian race which immigrated only about four centuries ago, show the transition from the complexion of the Hindu to our own. Therefore in sexual love nature strives to return to dark hair and brown eyes as the primitive type; but the white colour of the skin has become a second nature, though not so that the brown of the Hindu repels us. Finally, each one also seeks in the particular parts of the body the corrective of his own defects and aberrations, and does so the more decidedly the more important the part is.\n\nSchopenhauer also maintained a marked metaphysical and political anti-Judaism. He argued that Christianity constituted a revolt against what he styled the materialistic basis of Judaism, exhibiting an Indian-influenced ethics reflecting the Aryan-Vedic theme of spiritual self-conquest. He saw this as opposed to the ignorant drive toward earthly utopianism and superficiality of a worldly \"Jewish\" spirit:\n\nJudaism is, therefore, the crudest and poorest of all religions and consists merely in an absurd and revolting theism. It amounts to this that the Kyrios|''κύριος'' 'Lord', who has created the world, desires to be worshipped and adored; and so above all he is jealous, is envious of his colleagues, of all the other gods; if sacrifices are made to them he is furious and his Jews have a bad time ... It is most deplorable that this religion has become the basis of the prevailing religion of Europe; for it is a religion without any metaphysical tendency. While all other religions endeavor to explain to the people by symbols the metaphysical significance of life, the religion of the Jews is entirely immanent and furnishes nothing but a mere war-cry in the struggle with other nations.\n\n==== Women ====\nIn his 1851 essay \"On Women\", Schopenhauer expressed opposition to what he called \"Teutonico-Christian stupidity\" of \"reflexive, unexamined reverence for the female (''abgeschmackten Weiberveneration'')\". He wrote: \"Women are directly fitted for acting as the nurses and teachers of our early childhood by the fact that they are themselves childish, frivolous and short-sighted.\" He opined that women are deficient in artistic faculties and sense of justice, and expressed his opposition to monogamy. He claimed that \"woman is by nature meant to obey\". The essay does give some compliments, however: \"women are decidedly more sober in their judgment than men are\", and are more sympathetic to the suffering of others.\n\nSchopenhauer's writings influenced many, from Friedrich Nietzsche to nineteenth-century feminists. His biological analysis of the difference between the sexes, and their separate roles in the struggle for survival and reproduction, anticipates some of the claims that were later ventured by sociobiologists and evolutionary psychologists.\n\nWhen the elderly Schopenhauer sat for a sculpture portrait by the Prussian sculptor Elisabet Ney in 1859, he was much impressed by the young woman's wit and independence, as well as by her skill as a visual artist. After his time with Ney, he told Richard Wagner's friend Malwida von Meysenbug: \"I have not yet spoken my last word about women. I believe that if a woman succeeds in withdrawing from the mass, or rather raising herself above the mass, she grows ceaselessly and more than a man.\"\n\n==== Pederasty ====\nIn the third, expanded edition of ''The World as Will and Representation'' (1859), Schopenhauer added an appendix to his chapter on the ''Metaphysics of Sexual Love''. He wrote that pederasty has the benefit of preventing ill-begotten children. Concerning this, he stated that \"the vice we are considering appears to work directly against the aims and ends of nature, and that in a matter that is all important and of the greatest concern to her it must in fact serve these very aims, although only indirectly, as a means for preventing greater evils\".\nSchopenhauer ends the appendix with the statement that \"by expounding these paradoxical ideas, I wanted to grant to the professors of philosophy a small favour. I have done so by giving them the opportunity of slandering me by saying that I defend and commend pederasty.\"\n\n==== Heredity and eugenics ====\nSchopenhauer at age 58 on 16 May 1846\n\nSchopenhauer viewed personality and intellect as inherited. He quotes Horace's saying, \"From the brave and good are the brave descended\" (''Odes'', iv, 4, 29) and Shakespeare's line from ''Cymbeline'', \"Cowards father cowards, and base things sire base\" (IV, 2) to reinforce his hereditarian argument.\nMechanistically, Schopenhauer believed that a person inherits his intellect through his mother, and personal character through the father. This belief in heritability of traits informed Schopenhauer's view of loveplacing it at the highest level of importance. For Schopenhauer the \"final aim of all love intrigues, be they comic or tragic, is really of more importance than all other ends in human life. What it all turns upon is nothing less than the composition of the next generation. ... It is not the weal or woe of any one individual, but that of the human race to come, which is here at stake.\" This view of the importance for the species of whom we choose to love was reflected in his views on eugenics or good breeding. Here Schopenhauer wrote:\n\nWith our knowledge of the complete unalterability both of character and of mental faculties, we are led to the view that a real and thorough improvement of the human race might be reached not so much from outside as from within, not so much by theory and instruction as rather by the path of generation. Plato had something of the kind in mind when, in the fifth book of his ''Republic'', he explained his plan for increasing and improving his warrior caste. If we could castrate all scoundrels and stick all stupid geese in a convent, and give men of noble character a whole harem, and procure men, and indeed thorough men, for all girls of intellect and understanding, then a generation would soon arise which would produce a better age than that of Pericles.\n\nIn another context, Schopenhauer reiterated his eugenic thesis: \"If you want Utopian plans, I would say: the only solution to the problem is the despotism of the wise and noble members of a genuine aristocracy, a genuine nobility, achieved by mating the most magnanimous men with the cleverest and most gifted women. This proposal constitutes my Utopia and my Platonic Republic.\" Analysts (e.g., Keith Ansell-Pearson) have suggested that Schopenhauer's anti-egalitarianist sentiment and his support for eugenics influenced the neo-aristocratic philosophy of Friedrich Nietzsche, who initially considered Schopenhauer his mentor.\n\n==== Animal welfare ====\n\nAs a consequence of his monistic philosophy, Schopenhauer was very concerned about animal welfare. For him, all individual animals, including humans, are essentially phenomenal manifestations of the one underlying Will.  For him the word \"will\" designates force, power, impulse, energy, and desire; it is the closest word we have that can signify both the essence of all external things and our own direct, inner experience. Since every living thing possesses will, humans and animals are fundamentally the same and can recognize themselves in each other. For this reason, he claimed that a good person would have sympathy for animals, who are our fellow sufferers.\n\n\n\n\n\n\nIn 1841, he praised the establishment in London of the Society for the Prevention of Cruelty to Animals, and in Philadelphia of the Animals' Friends Society. Schopenhauer went so far as to protest using the pronoun \"it\" in reference to animals because that led to treatment of them as though they were inanimate things. To reinforce his points, Schopenhauer referred to anecdotal reports of the look in the eyes of a monkey who had been shot and also the grief of a baby elephant whose mother had been killed by a hunter.\n\nSchopenhauer was very attached to his succession of pet poodles. He criticized Spinoza's belief that animals are a mere means for the satisfaction of humans.\n\n===Intellectual interests and affinities===\n\n====Indology====\nPhoto of Schopenhauer, 1852\n\nSchopenhauer read the Latin translation of the ancient Hindu texts, the ''Upanishads'', translated by French writer Anquetil du Perron from the Persian translation of Prince Dara Shukoh entitled ''Sirre-Akbar'' (\"The Great Secret\"). He was so impressed by its philosophy that he called it \"the production of the highest human wisdom\", and believed it contained superhuman concepts. Schopenhauer considered India as \"the land of the most ancient and most pristine wisdom, the place from which Europeans could trace their descent and the tradition by which they had been influenced in so many decisive ways\", and regarded the ''Upanishads'' as \"the most profitable and elevating reading which ... is possible in the world. It has been the solace of my life, and will be the solace of my death.\"\n\nSchopenhauer was first introduced to Anquetil du Perron's translation by Friedrich Majer in 1814. They met during the winter of 1813–1814 in Weimar at the home of Schopenhauer's mother, according to the biographer Safranski. Majer was a follower of Herder, and an early Indologist. Schopenhauer did not begin serious study of the Indic texts, however, until the summer of 1814. Safranski maintains that, between 1815 and 1817, Schopenhauer had another important cross-pollination with Indian thought in Dresden. This was through his neighbor of two years, Karl Christian Friedrich Krause. Krause was then a minor and rather unorthodox philosopher who attempted to mix his own ideas with ancient Indian wisdom. Krause had also mastered Sanskrit, unlike Schopenhauer, and they developed a professional relationship. It was from Krause that Schopenhauer learned meditation and received the closest thing to expert advice concerning Indian thought.\n\n\n\nThe book ''Oupnekhat'' (Upanishad) always lay open on his table, and he invariably studied it before going to bed. He called the opening up of Sanskrit literature \"the greatest gift of our century\", and predicted that the philosophy and knowledge of the Upanishads would become the cherished faith of the West. Most noticeable, in the case of Schopenhauer's work, was the significance of the ''Chandogya Upanishad'', whose Mahāvākya, Tat Tvam Asi, is mentioned throughout ''The World as Will and Representation''.\n\n==== Buddhism ====\nSchopenhauer noted a correspondence between his doctrines and the Four Noble Truths of Buddhism. Similarities centered on the principles that life involves suffering, that suffering is caused by desire (taṇhā), and that the extinction of desire leads to liberation. Thus three of the four \"truths of the Buddha\" correspond to Schopenhauer's doctrine of the will. In Buddhism, however, while greed and lust are always unskillful, desire is ethically variable – it can be skillful, unskillful, or neutral.\n\nFor Schopenhauer, will had ontological primacy over the intellect; desire is prior to thought. Schopenhauer felt this was similar to notions of puruṣārtha or goals of life in Vedānta Hinduism.\n\nIn Schopenhauer's philosophy, denial of the will is attained by:\n* personal experience of an extremely great suffering that leads to loss of the will to live; or\n* knowledge of the essential nature of life in the world through observation of the suffering of other people.\n\nHowever, Buddhist nirvāṇa is not equivalent to the condition that Schopenhauer described as denial of the will. Nirvāṇa is not the extinguishing of the ''person'' as some Western scholars have thought, but only the \"extinguishing\" (the literal meaning of nirvana) of the flames of greed, hatred, and delusion that assail a person's character. Schopenhauer made the following statement in his discussion of religions:\n\n\nIf I wished to take the results of my philosophy as the standard of truth, I should have to concede to Buddhism pre-eminence over the others. In any case, it must be a pleasure to me to see my doctrine in such close agreement with a religion that the majority of men on earth hold as their own, for this numbers far more followers than any other. And this agreement must be yet the more pleasing to me, inasmuch as ''in my philosophizing I have certainly not been under its influence'' emphasis added. For up till 1818, when my work appeared, there was to be found in Europe only a very few accounts of Buddhism.\n\n\nBuddhist philosopher Nishitani Keiji, however, sought to distance Buddhism from Schopenhauer. While Schopenhauer's philosophy may sound rather mystical in such a summary, his methodology was resolutely empirical, rather than speculative or transcendental:\n\n\nPhilosophy ... is a science, and as such has no articles of faith; accordingly, in it nothing can be assumed as existing except what is either positively given empirically, or demonstrated through indubitable conclusions.\n\n\nAlso note:\n\n\nThis actual world of what is knowable, in which we are and which is in us, remains both the material and the limit of our consideration.\n\n\nThe argument that Buddhism affected Schopenhauer's philosophy more than any other Dharmic faith loses credence since he did not begin a serious study of Buddhism until after the publication of ''The World as Will and Representation'' in 1818. Scholars have started to revise earlier views about Schopenhauer's discovery of Buddhism. Proof of early interest and influence, however, appears in Schopenhauer's 1815/16 notes (transcribed and translated by Urs App) about Buddhism. They are included in a recent case study that traces Schopenhauer's interest in Buddhism and documents its influence. Other scholarly work questions how similar Schopenhauer's philosophy actually is to Buddhism.\n\n====Magic and occultism====\n\nSome traditions in Western esotericism and parapsychology interested Schopenhauer and influenced his philosophical theories. He praised animal magnetism as evidence for the reality of magic in his ''On the Will in Nature'', and went so far as to accept the division of magic into left-hand and right-hand magic, although he doubted the existence of demons.\n\nSchopenhauer grounded magic in the Will and claimed all forms of magical transformation depended on the human Will, not on ritual. This theory notably parallels Aleister Crowley's system of magick and its emphasis on human will. Given the importance of the Will to Schopenhauer's overarching system, this amounts to \"suggesting his whole philosophical system had magical powers.\" Schopenhauer rejected the theory of disenchantment and claimed philosophy should synthesize itself with magic, which he believed amount to \"practical metaphysics.\"\n\nNeoplatonism, including the traditions of Plotinus and to a lesser extent Marsilio Ficino, has also been cited as an influence on Schopenhauer.\n", "\nSchopenhauer had a wide range of interests, from science and opera to occultism and literature.\n\nIn his student years, Schopenhauer went more often to lectures in the sciences than philosophy. He kept a strong interest as his personal library contained near to 200 books of scientific literature at his death, and his works refer to scientific titles not found in the library.\n\nMany evenings were spent in the theatre, opera and ballet; Schopenhauer especially liked the operas of Mozart, Rossini and Bellini. Schopenhauer considered music the highest art, and played the flute during his whole life.\n\nAs a polyglot, he knew German, Italian, Spanish, French, English, Latin and ancient Greek, and was an avid reader of poetry and literature. He particularly revered Goethe, Petrarch, Calderón and Shakespeare.\n\nIf Goethe had not been sent into the world simultaneously with Kant in order to counterbalance him, so to speak, in the spirit of the age, the latter would have been haunted like a nightmare many an aspiring mind and would have oppressed it with great affliction. But now the two have an infinitely wholesome effect from opposite directions and will probably raise the German spirit to a height surpassing even that of antiquity.\n\n\nIn philosophy, his most important influences were, according to himself, Kant, Plato and the Upanishads. Concerning the Upanishads and Vedas, he writes in ''The World as Will and Representation'':\nIf the reader has also received the benefit of the Vedas, the access to which by means of the Upanishads is in my eyes the greatest privilege which this still young century (1818) may claim before all previous centuries, if then the reader, I say, has received his initiation in primeval Indian wisdom, and received it with an open heart, he will be prepared in the very best way for hearing what I have to tell him. It will not sound to him strange, as to many others, much less disagreeable; for I might, if it did not sound conceited, contend that every one of the detached statements which constitute the Upanishads, may be deduced as a necessary result from the fundamental thoughts which I have to enunciate, though those deductions themselves are by no means to be found there.\n", "\n=== Giordano Bruno and Spinoza ===\nSchopenhauer saw Bruno and Spinoza as philosophers not bound to their age or nation. \"Both were fulfilled by the thought, that as manifold the appearances of the world may be, it is still ''one'' being, that appears in all of them. ... Consequently, there is no place for God as creator of the world in their philosophy, but God is the world itself.\"\n\nSchopenhauer expressed regret that Spinoza stuck for the presentation of his philosophy with the concepts of scholasticism and Cartesian philosophy, and tried to use geometrical proofs that do not hold because of vague and overly broad definitions. Bruno on the other hand, who knew much about nature and ancient literature, presented his ideas with Italian vividness, and is amongst philosophers the only one who comes near Plato's poetic and dramatic power of exposition.\n\nSchopenhauer noted that their philosophies do not provide any ethics, and it is therefore very remarkable that Spinoza called his main work ''Ethics''. In fact, it could be considered complete from the standpoint of life-affirmation, if one completely ignores morality and self-denial. It is yet even more remarkable that Schopenhauer mentions Spinoza as an example of the denial of the will, if one uses the French biography by Jean Maximilien Lucas as the key to ''Tractatus de Intellectus Emendatione''.\n\n===Immanuel Kant===\nSchopenhauer's philosophy took Kant's work as its foundation. While he praised Kant's greatness, he nonetheless included a highly detailed criticism of Kantian philosophy as an appendix to ''The World as Will and Representation.''\n\nThe importance of Kant for Schopenhauer, in philosophy as well as on a personal level, cannot be overstated. Kant's philosophy was the foundation of Schopenhauer's, and he had high praise for the Transcendental Aesthetic section of Kant's ''Critique of Pure Reason''. Schopenhauer maintained that Kant stands in the same relation to philosophers such as Berkeley and Plato, as Copernicus to Hicetas, Philolaus, and Aristarchus: Kant succeeded in demonstrating what previous philosophers merely asserted.\n\nSchopenhauer writes about Kant's influence on his work in the preface to the second edition of ''The World as Will and Representation'':\n\n\nIn his study room, one bust was of Buddha, the other was of Kant. The bond which Schopenhauer felt with the philosopher of Königsberg is demonstrated in an unfinished poem he dedicated to Kant (included in volume 2 of the ''Parerga''):\n\n\n\nSchopenhauer dedicated one fifth of his main work, ''The World as Will and Representation'', to a detailed criticism of the Kantian philosophy.\n\nSchopenhauer praised Kant for his distinction between appearance and the thing-in-itself, whereas the general consensus in German idealism was that this was the weakest spot of Kant's theory, since, according to Kant, causality can find application on objects of experience only, and consequently, things-in-themselves cannot be the cause of appearances. The inadmissibility of this reasoning was also acknowledged by Schopenhauer. He insisted that this was a true conclusion, drawn from false premises.\n\n===Post-Kantian school===\nThe leading figures of post-Kantian philosophy—Johann Gottlieb Fichte, F. W. J. Schelling and G. W. F. Hegel—were not respected by Schopenhauer. He argued that they were not philosophers at all, for they lacked \"the first requirement of a philosopher, namely a seriousness and honesty of inquiry.\" Rather, they were merely sophists who, excelling in the art of beguiling the public, pursued their own selfish interests (such as professional advancement within the university system). Diatribes against the vacuity, dishonesty, pomposity, and self-interest of these contemporaries are to be found throughout Schopenhauer's published writings. The following passage is an example:\n\n\n\nSchopenhauer deemed Schelling the most talented of the three and wrote that he would recommend his \"elucidatory paraphrase of the highly important doctrine of Kant\" concerning the intelligible character, if he had been honest enough to admit he was parroting Kant, instead of hiding this relation in a cunning manner.\n\nSchopenhauer reserved his most unqualified damning condemnation for Hegel, whom he considered less worthy than Fichte or Schelling. Whereas Fichte was merely a windbag (''Windbeutel''), Hegel was a \"commonplace, inane, loathsome, repulsive, and ignorant charlatan.\" The philosophers Karl Popper and Mario Bunge agreed with this distinction. Hegel, Schopenhauer wrote in the preface to his ''Two Fundamental Problems of Ethics,'' not only \"performed no service to philosophy, but he has had a detrimental influence on philosophy, and thereby on German literature in general, really a downright stupefying, or we could even say a pestilential influence, which it is therefore the duty of everyone capable of thinking for himself and judging for himself to counteract in the most express terms at every opportunity.\"\n", "Sculpture of Schopenhauer by Elisabeth Ney\nSchopenhauer remained the most influential German philosopher until the First World War. His philosophy was a starting point for a new generation of philosophers including Julius Bahnsen, Paul Deussen, Lazar von Hellenbach, Karl Robert Eduard von Hartmann, Ernst Otto Lindner, Philipp Mainländer, Friedrich Nietzsche, Olga Plümacher and Agnes Taubert. His legacy shaped the intellectual debate, and forced movements that were utterly opposed to him, neo-Kantianism and positivism, to address issues they would otherwise have completely ignored, and in doing so he changed them markedly. The French writer Maupassant commented that \"to-day even those who execrate him seem to carry in their own souls particles of his thought\". Other philosophers of the 19th century who cited his influence include Hans Vaihinger, Volkelt, Solovyov and Weininger.\n\nSchopenhauer was well read by physicists, most notably Einstein, Schrödinger, Wolfgang Pauli, and Majorana. Einstein described Schopenhauer's thoughts as a \"continual consolation\" and called him a genius. In his Berlin study three figures hung on the wall: Faraday, Maxwell, Schopenhauer. Konrad Wachsmann recalled: \"He often sat with one of the well-worn Schopenhauer volumes, and as he sat there, he seemed so pleased, as if he were engaged with a serene and cheerful work.\"\n\nWhen Erwin Schrödinger discovered Schopenhauer (\"the greatest savant of the West\") he considered switching his study of physics to philosophy. He maintained the idealistic views during the rest of his life. Wolfgang Pauli accepted the main tenet of Schopenhauer's metaphysics, that the thing-in-itself is will.\n\nBut most of all Schopenhauer is famous for his influence on artists. Richard Wagner became one of the earliest and most famous adherents of the Schopenhauerian philosophy. The admiration was not mutual, and Schopenhauer proclaimed: \"I remain faithful to Rossini and Mozart!\"  So he has been nicknamed \"the artist's philosopher\". See also Influence of Schopenhauer on Tristan und Isolde.\n\n\n\nUnder the influence of Schopenhauer, Leo Tolstoy became convinced that the truth of all religions lies in self-renunciation. When he read Schopenhauer's philosophy, Tolstoy exclaimed \"at present I am convinced that Schopenhauer is the greatest genius among men. ... It is the whole world in an incomparably beautiful and clear reflection.\" He said that what he has written in ''War and Peace'' is also said by Schopenhauer in ''The World as Will and Representation''.\n\nJorge Luis Borges remarked that the reason he had never attempted to write a systematic account of his world view, despite his penchant for philosophy and metaphysics in particular, was because Schopenhauer had already written it for him.\n\nOther figures in literature who were strongly influenced by Schopenhauer were Thomas Mann, Thomas Hardy, Afanasy Fet, J.-K. Huysmans and George Santayana. In Herman Melville's final years, while he wrote ''Billy Budd'', he read Schopenhauer's essays and marked them heavily. Scholar Brian Yothers notes that Melville \"marked numerous misanthropic and even suicidal remarks, suggesting an attraction to the most extreme sorts of solitude, but he also made note of Schopenhauer's reflection on the moral ambiguities of genius.\" Schopenhauer's attraction to and discussions of both Eastern and Western religions in conjunction with each other made an impression on Melville in his final years.\n\nSergei Prokofiev, although initially reluctant to engage with works noted for their pessimism, became fascinated with Schopenhauer after reading ''Aphorisms on the Wisdom of Life'' in ''Parerga and Paralipomena''. \"With his truths Schopenhauer gave me a spiritual world and an awareness of happiness.\"\n\nFriedrich Nietzsche owed the awakening of his philosophical interest to reading ''The World as Will and Representation'' and admitted that he was one of the few philosophers that he respected, dedicating to him his essay \"Schopenhauer als Erzieher\" one of his ''Untimely Meditations''.\n\nCommemorative stamp of the Deutsche Bundespost\n\nEarly in his career, Ludwig Wittgenstein adopted Schopenhauer's epistemological idealism, and some traits of Schopenhauer's influence (particularly Schopenhauerian transcendentalism) can be observed in the Tractatus Logico-Philosophicus.   However, later on, Wittgenstein rejected epistemological transcendental idealism for Gottlob Frege's conceptual realism. In later years, Wittgenstein became highly dismissive of Schopenhauer, describing him as an ultimately shallow thinker. His friend Bertrand Russell had a low opinion on the philosopher, and even came to attack him in his ''History of Western Philosophy'' for hypocritically praising asceticism yet not acting upon it.\n\nOpposite to Russell on the foundations of mathematics, the Dutch mathematician L. E. J. Brouwer incorporated Kant's and Schopenhauer's ideas in the philosophical school of intuitionism, where mathematics is considered as a purely mental activity instead of an analytic activity wherein objective properties of reality are revealed. Brouwer was also influenced by Schopenhauer's metaphysics, and wrote an essay on mysticism.\n\nSchopenhauer's philosophy has made its way into a novel, ''The Schopenhauer Cure'', by American existential psychiatrist and emeritus professor of psychiatry Irvin Yalom.\n\nSchopenhauer's philosophy, and the discussions on philosophical pessimism it has engendered, has been the focus of contemporary thinkers such as David Benatar, Thomas Ligotti, and Eugene Thacker. Their work also served as an inspiration for the popular HBO TV series 'True Detective'.\n", "\n* ''On the Fourfold Root of the Principle of Sufficient Reason (Ueber die vierfache Wurzel des Satzes vom zureichenden Grunde''), 1813\n* ''On Vision and Colors'' (''Ueber das Sehn und die Farben''), 1816 \n* ''Theory of Colors (Theoria colorum)'', 1830.\n* ''The World as Will and Representation'' (alternatively translated in English as ''The World as Will and Idea''; original German is ''Die Welt als Wille und Vorstellung''): vol. 1818/1819, vol. 2, 1844\n** Vol. 1 Dover edition 1966, \n** Vol. 2 Dover edition 1966, \n** Peter Smith Publisher hardcover set 1969, \n** Everyman Paperback combined abridged edition (290 pp.) \n* ''The Art of Being Right (Eristische Dialektik: Die Kunst, Recht zu Behalten)'', 1831\n* ''On the Will in Nature (Ueber den Willen in der Natur)'', 1836 \n* ''On the Freedom of the Will (Ueber die Freiheit des menschlichen Willens''), 1839 \n* ''On the Basis of Morality (Ueber die Grundlage der Moral)'', 1840\n* ''The Two Basic Problems of Ethics: On the Freedom of the Will, On the Basis of Morality (Die beiden Grundprobleme der Ethik: Ueber die Freiheit des menschlichen Willens, Ueber das Fundament der Moral''), 1841.\n* ''Parerga and Paralipomena'' (2 vols., 1851) – Reprint: (Oxford: Clarendon Press) (2 vols., 1974) (English translation by E. F. J. Payne)\n** Printings:\n*** 1974 Hardcover, by ISBN\n**** Vols. 1 and 2, ,\n**** Vol. 1, ISBN\n**** Vol. 2, ,\n*** 1974/1980 Paperback, Vol. 1, , Vol. 2, ,\n*** 2001 Paperback, Vol. 1, , Vol. 2, \n** ''Essays and Aphorisms'', being excerpts from Volume 2 of ''Parerga und Paralipomena'', selected and translated by R. J. Hollingdale, with Introduction by R J Hollingdale, Penguin Classics, 1970, Paperback 1973: \n* ''An Enquiry concerning Ghost-seeing, and what is connected therewith (Versuch über das Geistersehn und was damit zusammenhangt)'', 1851\n* Arthur Schopenhauer, ''Manuscript Remains'', Volume II, Berg Publishers Ltd., \n\n=== Online ===\n* \n* '' The Art Of Controversy (Die Kunst, Recht zu behalten)''. (bilingual) ''The Art of Being Right''\n* '' Studies in Pessimism'' – audiobook from LibriVox\n* ''The World as Will and Idea'' at Internet Archive:\n** '' Volume I''\n** '' Volume II''\n** '' Volume III''\n* ''On the fourfold root of the principle of sufficient reason'' and ''On the will in nature.'' Two essays:\n**  Internet Archive. Translated by Mrs. Karl Hillebrand (1903).\n**  Cornell University Library Historical Monographs Collection. Reprinted by Cornell University Library Digital Collections\n*  Facsimile edition of Schopenhauer's manuscripts in  SchopenhauerSource\n* '' Essays of Schopenhauer''\n", "* Existential nihilism\n* Eye of a needle\n* God in Buddhism\n* ''Massacre of the Innocents'' (Guido Reni)\n* Misotheism\n* Mortal coil\n* Nihilism\n* Post-Schopenhauerian pessimism\n", "\n\n=== Sources ===\n\n* Albright, Daniel (2004) ''Modernism and Music: An Anthology of Sources''. University of Chicago Press. \n* Beiser, Frederick C., ''Weltschmerz: Pessimism in German Philosophy, 1860-1900'' (Oxford: Oxford University Press, 2016).\n* \n* Hannan, Barbara, ''The Riddle of the World: A Reconsideration of Schopenhauer's Philosophy'' (Oxford: Oxford University Press, 2009).\n* Magee, Bryan, ''Confessions of a Philosopher'', Random House, 1998, . Chapters 20, 21.\n* Safranski, Rüdiger (1990) ''Schopenhauer and the Wild Years of Philosophy''. Harvard University Press, ; orig. German ''Schopenhauer und Die wilden Jahre der Philosophie'', Carl Hanser Verlag (1987)\n* Thomas Mann editor, ''The Living Thoughts of Schopenhauer'', Longmans Green & Co., 1939\n\n", "\n=== Biographies ===\n* Cartwright, David. ''Schopenhauer: A Biography'', Cambridge University Press, 2010. \n* Frederick Copleston, ''Arthur Schopenhauer, philosopher of pessimism'' (Burns, Oates & Washbourne, 1946)\n* O. F. Damm, ''Arthur Schopenhauer – eine Biographie'' (Reclam, 1912)\n* Kuno Fischer, ''Arthur Schopenhauer'' (Heidelberg: Winter, 1893); revised as ''Schopenhauers Leben, Werke und Lehre'' (Heidelberg: Winter, 1898).\n* Eduard Grisebach, ''Schopenhauer – Geschichte seines Lebens'' (Berlin: Hofmann, 1876).\n* D. W. Hamlyn, ''Schopenhauer'', London: Routledge & Kegan Paul (1980, 1985)\n* Heinrich Hasse, ''Schopenhauer''. (Reinhardt, 1926)\n* Arthur Hübscher, ''Arthur Schopenhauer – Ein Lebensbild'' (Leipzig: Brockhaus, 1938).\n* Thomas Mann, ''Schopenhauer'' (Bermann-Fischer, 1938)\n* Matthews, Jack, ''Schopenhauer's Will: Das Testament'', Nine Point Publishing, 2015. . A recent creative biography by philosophical novelist Jack Matthews.\n* Rüdiger Safranski, ''Schopenhauer und die wilden Jahre der Philosophie – Eine Biographie'', hard cover Carl Hanser Verlag, München 1987, , pocket edition Fischer: .\n* Rüdiger Safranski, ''Schopenhauer and the Wild Years of Philosophy'', trans. Ewald Osers (London: Weidenfeld and Nicolson, 1989)\n* Walther Schneider, ''Schopenhauer – Eine Biographie'' (Vienna: Bermann-Fischer, 1937).\n* William Wallace, ''Life of Arthur Schopenhauer'' (London: Scott, 1890; repr., St. Clair Shores, Mich.: Scholarly Press, 1970)\n* Helen Zimmern, '' Arthur Schopenhauer:  His Life and His Philosophy'' (London: Longmans, Green & Co, 1876)\n\n=== Other books ===\n* App, Urs.  Arthur Schopenhauer and China. ''Sino-Platonic Papers'' Nr. 200 (April 2010) (PDF, 8.7 Mb PDF, 164 p.). Contains extensive appendixes with transcriptions and English translations of Schopenhauer's early notes about Buddhism and Indian philosophy.\n* Atwell, John. ''Schopenhauer on the Character of the World, The Metaphysics of Will''.\n* --------, ''Schopenhauer, The Human Character''.\n* Edwards, Anthony. ''An Evolutionary Epistemological Critique of Schopenhauer's Metaphysics''. 123 Books, 2011.\n* Copleston, Frederick, ''Schopenhauer: Philosopher of Pessimism'', 1946 (reprinted London: Search Press, 1975).\n* Gardiner, Patrick, 1963. ''Schopenhauer''. Penguin Books.\n* --------, ''Schopenhauer: A Very Short introduction''.\n* Janaway, Christopher, 2003. ''Self and World in Schopenhauer's Philosophy''. Oxford University Press. \n* Magee, Bryan, ''The Philosophy of Schopenhauer'', Oxford University Press (1988, reprint 1997). \n* Mannion, Gerard, \"Schopenhauer, Religion and Morality – The Humble Path to Ethics\", Ashgate Press, New Critical Thinking in Philosophy Series, 2003, 314pp.\n* Trottier, Danick. ''L’influence de la philosophie schopenhauerienne dans la vie et l’oeuvre de Richard Wagner; et, Qu’est-ce qui séduit, obsède, magnétise le philosophe dans l’art des sons? deux études en esthétique musicale'', Université du Québec à Montréal, Département de musique, 2000.\n* Zimmern, Helen, ''Arthur Schopenhauer, his Life and Philosophy'', London, Longman, and Co., 1876.\n\n=== Articles ===\n* \n* Jiménez, Camilo, 2006, \" Tagebuch eines Ehrgeizigen: Arthur Schopenhauers Studienjahre in Berlin,\" ''Avinus Magazin'' (in German).\n* Luchte, James, 2009, \" The Body of Sublime Knowledge: The Aesthetic Phenomenology of Arthur Schopenhauer,\" ''Heythrop Journal'', Volume 50, Number 2, pp. 228–242.\n* Mazard, Eisel, 2005, \" Schopenhauer and the Empirical Critique of Idealism in the History of Ideas.\" On Schopenhauer's (debated) place in the history of European philosophy and his relation to his predecessors.\n* Moges, Awet, 2006, \" Schopenhauer's Philosophy.\" Galileian Library.\n* Sangharakshita, 2004, \" Schopenhauer and aesthetic appreciation.\"\n* \n*  Oxenford's \"Iconoclasm in German Philosophy,\" (See p. 388)\n* Thacker, Eugene, 2020. \"A Philosophy in Ruins, An Unquiet Void.\" Introduction to Arthur Schopenhauer, ''On the Suffering of the World''. Repeater Books. \n", "\n* \n* \n* \n* \n*  ''Arthur Schopenhauer'' an article by Mary Troxell in Internet Encyclopedia of Philosophy 2011\n*  Schopenhauersource: Reproductions of Schopenhauer's manuscripts\n*  Kant's philosophy as rectified by Schopenhauer\n*  Timeline of German Philosophers\n*  A Quick Introduction to Schopenhauer\n* Ross, Kelley L., 1998, \" Arthur Schopenhauer (1788–1860).\" Two short essays, on Schopenhauer's life and work, and on his dim view of academia.\n* More Than 100 Years Later: A Schopenhauerian Revision of Breuer's Anna O \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"], "interlinks": [["philosopher", "philosopher"], ["The World as Will and Representation", "The World as Will and Representation"], ["Phenomenon", "phenomenal"], ["noumenon", "noumenal"], ["transcendental idealism", "transcendental idealism"], ["Immanuel Kant", "Immanuel Kant"], ["atheistic", "atheistic"], ["German idealism", "German idealism"], ["Western philosophy", "Western philosophy"], ["Indian philosophy", "Indian philosophy"], ["asceticism", "asceticism"], ["self (philosophy)", "self"], ["Maya (religion)", "world-as-appearance"], ["philosophical pessimism", "philosophical pessimism"], ["philosophy", "philosophy"], ["literature", "literature"], ["science", "science"], ["Schopenhauer's aesthetics", "aesthetics"], ["morality", "morality"], ["psychology", "psychology"], ["Friedrich Nietzsche", "Friedrich Nietzsche"], ["Ludwig Wittgenstein", "Ludwig Wittgenstein"], ["Erwin Schrödinger", "Erwin Schrödinger"], ["Albert Einstein", "Albert Einstein"], ["Sigmund Freud", "Sigmund Freud"], ["Carl Jung", "Carl Jung"], ["Leo Tolstoy", "Leo Tolstoy"], ["Herman Melville", "Herman Melville"], ["Thomas Mann", "Thomas Mann"], ["Hermann Hesse", "Hermann Hesse"], ["Machado de Assis", "Machado de Assis"], ["Jorge Luis Borges", "Jorge Luis Borges"], ["Marcel Proust", "Marcel Proust"], ["Samuel Beckett", "Samuel Beckett"], ["Richard Wagner", "Richard Wagner"], ["Johannes Brahms", "Johannes Brahms"], ["Arnold Schoenberg", "Arnold Schoenberg"], ["Gustav Mahler", "Gustav Mahler"], ["Polish–Lithuanian Commonwealth", "Polish–Lithuanian Commonwealth"], ["Gdańsk", "Gdańsk"], ["Poland", "Poland"], ["Johanna Schopenhauer", "Johanna Schopenhauer"], ["Patrician (post-Roman Europe)", "patrician"], ["French Revolution", "French Revolution"], ["Republicanism", "republicans"], ["Cosmopolitanism", "cosmopolitans"], ["Anglophilia", "Anglophiles"], ["Kingdom of Prussia", "Prussia"], ["Hamburg", "Hamburg"], ["Adele Schopenhauer", "Adele"], ["Le Havre", "Le Havre"], ["Netherlands", "Holland"], ["France", "France"], ["Switzerland", "Switzerland"], ["Austria", "Austria"], ["Prussia", "Prussia"], ["Wimbledon, London", "Wimbledon"], ["Anglicanism", "Anglican"], ["anxiety", "anxiety"], ["Major depressive disorder", "depression"], ["Ernestine Gymnasium, Gotha", "Ernestine Gymnasium, Gotha"], ["Saxe-Gotha-Altenburg", "Saxe-Gotha-Altenburg"], ["Weimar", "Weimar"], ["German literature", "German literature"], ["Goethe", "Goethe"], ["Franz Passow", "Franz Passow"], ["Karoline Jagemann", "Karoline Jagemann"], ["Karl August, Grand Duke of Saxe-Weimar-Eisenach", "Karl August, Grand Duke of Saxe-Weimar-Eisenach"], ["Georg August University of Göttingen", "University of Göttingen"], ["University of Jena", "University of Jena"], ["medicine", "medicine"], ["Natural science", "scientific interests"], ["Bernhard Friedrich Thibaut", "Bernhard Friedrich Thibaut"], ["Arnold Hermann Ludwig Heeren", "Arnold Hermann Ludwig Heeren"], ["Johann Friedrich Blumenbach", "Johann Friedrich Blumenbach"], ["Friedrich Stromeyer", "Friedrich Stromeyer"], ["Heinrich Adolf Schrader", "Heinrich Adolf Schrader"], ["Johann Tobias Mayer", "Johann Tobias Mayer"], ["Konrad Johann Martin Langenbeck", "Konrad Johann Martin Langenbeck"], ["metaphysics", "metaphysics"], ["psychology", "psychology"], ["logic", "logic"], ["Gottlob Ernst Schulze", "Gottlob Ernst Schulze"], ["Aenesidemus (book)", "Aenesidemus"], ["Plato", "Plato"], ["Immanuel Kant", "Immanuel Kant"], ["Friedrich Bouterwek", "Friedrich Bouterwek"], ["Friedrich Gotthilf Osann", "Friedrich Gotthilf Osann"], ["Karl Witte", "Karl Witte"], ["Christian Charles Josias von Bunsen", "Christian Charles Josias von Bunsen"], ["William Backhouse Astor Sr.", "William Backhouse Astor Sr."], ["University of Berlin", "University of Berlin"], ["Karl Ludwig Fernow", "Karl Ludwig Fernow"], ["post-Kantian", "post-Kantian"], ["Johann Gottlieb Fichte", "Johann Gottlieb Fichte"], ["Friedrich Schleiermacher", "Friedrich Schleiermacher"], ["Criticism of religion", "critical of religion"], ["atheism", "atheism"], ["Friedrich Wilhelm Joseph Schelling", "Schelling"], ["Jakob Friedrich Fries", "Fries"], ["Friedrich Heinrich Jacobi", "Jacobi"], ["Francis Bacon", "Bacon"], ["John Locke", "Locke"], ["August Böckh", "August Böckh"], ["Friedrich August Wolf", "Friedrich August Wolf"], ["Martin Heinrich Klaproth", "Martin Heinrich Klaproth"], ["Paul Erman", "Paul Erman"], ["Johann Elert Bode", "Johann Elert Bode"], ["Ernst Gottfried Fischer", "Ernst Gottfried Fischer"], ["Johann Horkel", "Johann Horkel"], ["Friedrich Christian Rosenthal", "Friedrich Christian Rosenthal"], ["Hinrich Lichtenstein", "Hinrich Lichtenstein"], ["War of the Sixth Coalition", "war against France"], ["Rudolstadt", "Rudolstadt"], ["hiking", "hiking"], ["Thuringian forest", "Thuringian forest"], ["On the Fourfold Root of the Principle of Sufficient Reason", "On the Fourfold Root of the Principle of Sufficient Reason"], ["Battle of Leipzig", "Battle of Leipzig"], ["German nationalism", "nationalistic"], ["F.A. Brockhaus AG", "Brockhaus publishing firm"], ["Leipzig", "Leipzig"], ["Theory of Colours", "color theory"], ["On Vision and Colors", "On Vision and Colors"], ["historian of religion", "historian of religion"], ["Oriental studies", "orientalist"], ["Johann Gottfried Herder", "Herder"], ["Eastern philosophy", "Eastern philosophy"], ["Arthur Schopenhauer#Indology", "Indology"], ["Upanishads", "Upanishads"], ["Buddha", "Buddha"], ["Bhagavad Gita", "Bhagavad Gita"], ["the Asiatic Society", "the Asiatic Society"], ["Indian philosophy", "Indian philosophy"], ["Hindu texts", "Hindu texts"], ["Buddhism", "Buddhism"], ["Early Buddhism", "Early Buddhism"], ["The World as Will and Representation", "The World as Will and Representation"], ["Parerga and Paralipomena", "Parerga and Paralipomena"], ["Dresden", "Dresden"], ["Johann Gottlob von Quandt", "Johann Gottlob von Quandt"], ["Friedrich Laun", "Friedrich Laun"], ["Karl Christian Friedrich Krause", "Karl Christian Friedrich Krause"], ["The World as Will and Representation", "The World as Will and Representation"], ["Friedrich Arnold Brockhaus", "Friedrich Arnold Brockhaus"], ["Italy", "Italy"], ["Venice", "Venice"], ["Bologna", "Bologna"], ["Florence", "Florence"], ["Naples", "Naples"], ["Milan", "Milan"], ["Rome", "Rome"], ["Karl Witte", "Karl Witte"], ["Antico Caffè Greco", "Caffe Greco"], ["Johann Friedrich Böhmer", "Johann Friedrich Böhmer"], ["Humboldt University of Berlin", "Berlin"], ["G. W. F. Hegel", "G. W. F. Hegel"], ["Carlsbad Decrees", "fired"], ["academia", "academia"], ["Giennadij Jerszow", "Giennadij Jerszow"], ["Leipzig", "Leipzig"], ["Nuremberg", "Nuremberg"], ["Stuttgart", "Stuttgart"], ["Schaffhausen", "Schaffhausen"], ["Vevey", "Vevey"], ["Milan", "Milan"], ["Munich", "Munich"], ["syphilis", "syphilis"], ["Pedro Calderón de la Barca", "Pedro Calderón de la Barca"], ["Lope de Vega", "Lope de Vega"], ["Miguel de Cervantes", "Miguel de Cervantes"], ["Baltasar Gracián", "Baltasar Gracián"], ["monogamy", "monogamy"], ["polygyny", "polygyny"], ["Polyamory", "polyamorous"], ["Caroline Medon", "Caroline Richter"], ["cholera", "cholera"], ["Premonition", "prophetic dream"], ["Frankfurt", "Frankfurt"], ["Supernatural", "supernatural experience"], ["paranormal", "paranormal"], ["Magic (supernatural)", "magic"], ["Mannheim", "Mannheim"], ["poodle", "poodle"], ["Ātman (Hinduism)", "Atman"], ["On the Freedom of the Will", "On the Freedom of the Will"], ["On the Basis of Morality", "On the Basis of Morality"], ["Julius Frauenstädt", "Julius Frauenstädt"], ["German revolutions of 1848–49", "violent upheaval"], ["Hans Adolf Erdmann von Auerswald", "Hans Adolf Erdmann von Auerswald"], ["Felix Lichnowsky", "Felix Lichnowsky"], ["Alfred I, Prince of Windisch-Grätz", "Alfred I, Prince of Windisch-Grätz"], ["Young Hegelians", "Young Hegelians"], ["Jules Lunteschütz", "Jules Lunteschütz"], ["Parerga and Paralipomena", "Parerga and Paralipomena"], ["Rudolf Seydel", "Rudolf Seydel"], ["Jules Lunteschütz", "Jules Lunteschütz"], ["Frankfurt", "Frankfurt"], ["Hearing loss", "hearing"], ["rheumatism", "rheumatism"], ["Posthumous publication", "posthumously"], ["Respiratory failure", "pulmonary-respiratory failure"], ["transcendental idealism", "transcendental idealism"], ["Empirical evidence", "empirical"], ["mental representation", "mental representation"], ["Johann Wolfgang von Goethe", "Goethe"], ["Theory of Colours", "Theory of Colours"], ["David Hume", "Hume"], ["Critique of Pure Reason", "Critique of Pure Reason"], ["Gottlob Ernst Schulze", "G. E. Schulze"], ["On Vision and Colors", "On Vision and Colors"], ["thing-in-itself", "in-itself"], ["noumena", "noumena"], ["Voluntarism (philosophy)", "metaphysical voluntarism"], ["Arthur Schopenhauer#Ethics", "ethics section below"], ["On the Freedom of the Will", "On the Freedom of the Will"], ["On the Basis of Morality", "On the Basis of Morality"], ["Asceticism", "Ascetic"], ["still life", "still life"], ["suffering", "suffering"], ["Daniel Albright", "Daniel Albright"], ["philosophy of music", "music"], ["Mathematical realism", "realist"], ["parallel postulate", "parallel postulate"], ["Euclidean geometry", "Euclidean geometry"], ["hyperbolic geometry", "hyperbolic geometry"], ["axiom", "axiom"], ["general theory of relativity", "general theory of relativity"], ["concept", "concept"], ["intuition", "intuitive perception"], ["Immanuel Kant", "Kant"], ["thing-in-itself", "in itself"], ["principle of sufficient reason", "principle of sufficient reason"], ["principium individuationis", "principium individuationis"], ["original sin", "original sin"], ["Reincarnation", "dogma of rebirth."], ["Dharmic faith", "Dharmic religions"], ["psyche (psychology)", "psyche"], ["evolution", "theory of evolution"], ["Charles Darwin", "Darwin"], ["Descent of Man", "Descent of Man"], ["Sigmund Freud", "Freud's"], ["libido", "libido"], ["unconscious mind", "unconscious mind"], ["evolutionary psychology", "evolutionary psychology"], ["Frankfurt", "Frankfurt"], ["Parerga and Paralipomena", "Parerga and Paralipomena"], ["limited government", "limited government"], ["Thomas Hobbes", "Thomas Hobbes"], ["monarchy", "monarchy"], ["republicanism", "republicanism"], ["Plato", "Plato"], ["Seneca the Younger", "Seneca"], ["Thomas Hobbes", "Hobbes"], ["Samuel von Pufendorf", "Pufendorf"], ["Paul Johann Anselm Ritter von Feuerbach", "Anselm Feuerbach"], ["History of Hinduism", "ancient Hindus"], ["Ancient Egypt", "Egyptians"], ["Brahmans", "Brahmans"], ["Inca Empire", "Incas"], ["South Sea Islands", "South Sea Islands"], ["Abolitionism", "opposed to slavery"], ["Slavery in the United States", "slave-holding states of the United States"], ["anti-Judaism", "anti-Judaism"], ["Aryan", "Aryan"], ["Vedas", "Vedic"], ["theism", "theism"], ["Kyrios", "''κύριος'' ['Lord'"], ["monogamy", "monogamy"], ["Friedrich Nietzsche", "Friedrich Nietzsche"], ["feminists", "feminists"], ["biology", "biological"], ["sociobiology", "sociobiologists"], ["evolutionary psychology", "evolutionary psychologists"], ["Arthur Schopenhauer (sculpture)", "a sculpture portrait"], ["Elisabet Ney", "Elisabet Ney"], ["Malwida von Meysenbug", "Malwida von Meysenbug"], ["pederasty", "pederasty"], ["intellect", "intellect"], ["Horace", "Horace"], ["Cymbeline", "Cymbeline"], ["eugenics", "eugenics"], ["castrate", "castrate"], ["criminals", "scoundrels"], ["harem", "harem"], ["Pericles", "Pericles"], ["despotism", "despotism"], ["mating", "mating"], ["Keith Ansell-Pearson", "Keith Ansell-Pearson"], ["egalitarianism", "egalitarianist"], ["Monism", "monistic"], ["Society for the Prevention of Cruelty to Animals", "Society for the Prevention of Cruelty to Animals"], ["Baruch Spinoza", "Spinoza's"], ["Hindu texts", "ancient Hindu texts"], ["Upanishads", "Upanishads"], ["Abraham Hyacinthe Anquetil-Duperron", "Anquetil du Perron"], ["Dara Shukoh", "Dara Shukoh"], ["Indian philosophy", "philosophy"], ["India", "India"], ["Europeans", "Europeans"], ["Weimar", "Weimar"], ["Johann Gottfried Herder", "Herder"], ["Indologist", "Indologist"], ["Dresden", "Dresden"], ["Karl Christian Friedrich Krause", "Karl Christian Friedrich Krause"], ["Sanskrit", "Sanskrit"], ["meditation", "meditation"], ["Sanskrit literature", "Sanskrit literature"], ["Chandogya Upanishad", "Chandogya Upanishad"], ["Mahāvākyas", "Mahāvākya"], ["Tat Tvam Asi", "Tat Tvam Asi"], ["Four Noble Truths", "Four Noble Truths"], ["Buddhism", "Buddhism"], ["taṇhā", "taṇhā"], ["ontology", "ontological"], ["intellect", "intellect"], ["puruṣārtha", "puruṣārtha"], ["Vedānta", "Vedānta"], ["Hinduism", "Hinduism"], ["nirvāṇa", "nirvāṇa"], ["Nishitani Keiji", "Nishitani Keiji"], ["methodology", "methodology"], ["empirical", "empirical"], ["Dharma", "Dharmic"], ["Western esotericism", "Western esotericism"], ["parapsychology", "parapsychology"], ["animal magnetism", "animal magnetism"], ["Left-hand path and right-hand path", "left-hand and right-hand magic"], ["Aleister Crowley", "Aleister Crowley"], ["disenchantment", "disenchantment"], ["Neoplatonism", "Neoplatonism"], ["Plotinus", "Plotinus"], ["Marsilio Ficino", "Marsilio Ficino"], ["Wolfgang Amadeus Mozart", "Mozart"], ["Gioachino Rossini", "Rossini"], ["Vincenzo Bellini", "Bellini"], ["German language", "German"], ["Italian language", "Italian"], ["Spanish language", "Spanish"], ["French language", "French"], ["Latin", "Latin"], ["ancient Greek", "ancient Greek"], ["Johann Wolfgang von Goethe", "Goethe"], ["Petrarch", "Petrarch"], ["Pedro Calderón de la Barca", "Calderón"], ["William Shakespeare", "Shakespeare"], ["Plato", "Plato"], ["Upanishads", "Upanishads"], ["Vedas", "Vedas"], ["Giordano Bruno", "Bruno"], ["Baruch Spinoza", "Spinoza"], ["scholasticism", "scholasticism"], ["Cartesian philosophy", "Cartesian philosophy"], ["Ethics (Spinoza)", "Ethics"], ["Tractatus de Intellectus Emendatione", "Tractatus de Intellectus Emendatione"], ["Critique of Pure Reason#Transcendental Aesthetic", "Transcendental Aesthetic"], ["Plato", "Plato"], ["Hicetas", "Hicetas"], ["Philolaus", "Philolaus"], ["Aristarchus of Samos", "Aristarchus"], ["Gautama Buddha", "Buddha"], ["Critique of the Kantian philosophy", "criticism of the Kantian philosophy"], ["thing-in-itself", "thing-in-itself"], ["German idealism", "German idealism"], ["German idealism", "post-Kantian philosophy"], ["Johann Gottlieb Fichte", "Johann Gottlieb Fichte"], ["Friedrich Wilhelm Joseph Schelling", "F. W. J. Schelling"], ["Georg Wilhelm Friedrich Hegel", "G. W. F. Hegel"], ["Karl Popper", "Karl Popper"], ["Mario Bunge", "Mario Bunge"], ["Elisabeth Ney", "Elisabeth Ney"], ["First World War", "First World War"], ["Julius Bahnsen", "Julius Bahnsen"], ["Paul Deussen", "Paul Deussen"], ["Karl Robert Eduard von Hartmann", "Karl Robert Eduard von Hartmann"], ["Philipp Mainländer", "Philipp Mainländer"], ["Friedrich Nietzsche", "Friedrich Nietzsche"], ["Olga Plümacher", "Olga Plümacher"], ["Agnes Taubert", "Agnes Taubert"], ["neo-Kantianism", "neo-Kantianism"], ["positivism", "positivism"], ["Guy de Maupassant", "Maupassant"], ["Hans Vaihinger", "Hans Vaihinger"], ["Johannes Volkelt", "Volkelt"], ["Vladimir Solovyov (philosopher)", "Solovyov"], ["Otto Weininger", "Weininger"], ["Erwin Schrödinger", "Schrödinger"], ["Wolfgang Pauli", "Wolfgang Pauli"], ["Ettore Majorana", "Majorana"], ["Michael Faraday", "Faraday"], ["James Clerk Maxwell", "Maxwell"], ["Konrad Wachsmann", "Konrad Wachsmann"], ["Erwin Schrödinger", "Erwin Schrödinger"], ["Wolfgang Pauli", "Wolfgang Pauli"], ["thing-in-itself", "thing-in-itself"], ["Richard Wagner", "Richard Wagner"], ["philosopher nicknames", "nickname"], ["Tristan und Isolde#Influence of Schopenhauer on Tristan und Isolde", "Influence of Schopenhauer on Tristan und Isolde"], ["Leo Tolstoy", "Leo Tolstoy"], ["War and Peace", "War and Peace"], ["Jorge Luis Borges", "Jorge Luis Borges"], ["Thomas Mann", "Thomas Mann"], ["Thomas Hardy", "Thomas Hardy"], ["Afanasy Fet", "Afanasy Fet"], ["Joris-Karl Huysmans", "J.-K. Huysmans"], ["George Santayana", "George Santayana"], ["Sergei Prokofiev", "Sergei Prokofiev"], ["Friedrich Nietzsche", "Friedrich Nietzsche"], ["Untimely Meditations", "Untimely Meditations"], ["Ludwig Wittgenstein", "Ludwig Wittgenstein"], ["Tractatus Logico-Philosophicus", "Tractatus Logico-Philosophicus"], ["transcendental idealism", "transcendental idealism"], ["Gottlob Frege", "Gottlob Frege"], ["Metaphysical realism", "realism"], ["Bertrand Russell", "Bertrand Russell"], ["History of Western Philosophy (Russell)", "''History of Western Philosophy''"], ["L. E. J. Brouwer", "L. E. J. Brouwer"], ["intuitionism", "intuitionism"], ["The Schopenhauer Cure", "The Schopenhauer Cure"], ["Irvin Yalom", "Irvin Yalom"], ["pessimism", "pessimism"], ["David Benatar", "David Benatar"], ["Thomas Ligotti", "Thomas Ligotti"], ["Eugene Thacker", "Eugene Thacker"], ["True Detective", "True Detective"], ["On the Fourfold Root of the Principle of Sufficient Reason", "On the Fourfold Root of the Principle of Sufficient Reason"], ["On Vision and Colors", "On Vision and Colors"], ["The World as Will and Representation", "The World as Will and Representation"], ["The Art of Being Right", "The Art of Being Right"], ["On the Will in Nature", "On the Will in Nature"], ["On the Freedom of the Will", "On the Freedom of the Will"], ["On the Basis of Morality", "On the Basis of Morality"], ["Parerga and Paralipomena", "Parerga and Paralipomena"], ["The Art of Being Right", "The Art of Being Right"], ["LibriVox", "LibriVox"], ["Internet Archive", "Internet Archive"], ["Existential nihilism", "Existential nihilism"], ["Eye of a needle", "Eye of a needle"], ["God in Buddhism", "God in Buddhism"], ["Massacre of the Innocents (Reni)", "''Massacre of the Innocents'' (Guido Reni)"], ["Misotheism", "Misotheism"], ["Mortal coil", "Mortal coil"], ["Nihilism", "Nihilism"], ["Post-Schopenhauerian pessimism", "Post-Schopenhauerian pessimism"], ["Frederick C. Beiser", "Beiser, Frederick C."], ["Bryan Magee", "Magee, Bryan"], ["Rüdiger Safranski", "Safranski, Rüdiger"], ["Thomas Mann", "Thomas Mann"], ["Frederick Copleston", "Frederick Copleston"], ["Thomas Mann", "Thomas Mann"], ["Jack Matthews (author)", "Matthews, Jack"], ["Jack Matthews (author)", "Jack Matthews"], ["Frederick Copleston", "Copleston, Frederick"], ["Patrick Gardiner", "Gardiner, Patrick"], ["Bryan Magee", "Magee, Bryan"], ["Helen Zimmern", "Zimmern, Helen"], ["s:Arthur Schopenhauer, his Life and Philosophy", "Arthur Schopenhauer, his Life and Philosophy"], ["Longman", "Longman, and Co."], ["Sangharakshita", "Sangharakshita"], ["Eugene Thacker", "Thacker, Eugene"], ["Internet Encyclopedia of Philosophy", "Internet Encyclopedia of Philosophy"]]}