[
  {
    "stream": "",
    "title": "The Future of Geoinformatics",
    "description": "What is the future of geospatial information systems in  artificial general intelligence, privatized Earth observation,  challenges to conservation, and increasing concentration of wealth? Speculations, answers,",
    "special_requests": "Include quotes from a diversity of sources including but by no means  limited to ESRI, Google Earth Engine, Google Deepmind, the United Nations, Project 2025 and the National Academy of Sciences.",
    "recommended_sources": "",
    "book_id": "1",
    "scheduled_date": "9/2/25",
    "isbn": "",
    "imprint": "xynapse_traces",
    "publisher": "Nimble Books",
    "format": "paperback",
    "priority": "",
    "notes": ""
  },
  {
    "stream": "",
    "title": "The Future of Space Robotics",
    "description": "",
    "special_requests": "",
    "recommended_sources": "",
    "book_id": "5",
    "scheduled_date": "9/30/25",
    "isbn": "",
    "imprint": "xynapse_traces",
    "publisher": "",
    "format": "",
    "priority": "",
    "notes": ""
  },
  {
    "stream": "",
    "title": "The Beauty of Astrophysics",
    "description": "Quotes about the beauty of astrophysics as a natural phenomenon; as a calling; as a science; as  a source of wonder, awe, and faith; as math; and more.",
    "special_requests": "Include quotes from Sir Arthur Eddington, Fred Hoyle, Einstein, Fermi, Bohr, von Neumann. Include quotes from historical figures such as Galileo and Copernicus.  Include quotes from Asian, African, indigenous, European cultures.",
    "recommended_sources": "",
    "book_id": "6",
    "scheduled_date": "10/7/25",
    "isbn": "",
    "imprint": "xynapse_traces",
    "publisher": "",
    "format": "",
    "priority": "",
    "notes": ""
  },
  {
    "stream": "",
    "title": "Adapting to Climate  Change",
    "description": "What are the most important things to know about the world's options for adapting to climate change? Cover these topics b ut with more interesting and vivid language.  Effectiveness and feasibility of adaptation options considering current context,\ninterdependencies, and a range of climate scenarios, and different levels of global warming,\ndevelopment, and adaptation\n• Approaches for adaptive and continuous learning, monitoring and evaluation to design better\npolicies, options and actions, and to enhance implementation including to avoid adverse\noutcomes\n• Drivers, enablers and conditions for accelerated adaptation action, including means of\nimplementation and using various technologies\n• Ways of adaptation decision making and planning under uncertainty and enabling and\nconstraining conditions\n• Enhancing agency and capacity of stakeholders and empowering Indigenous Peoples and\nlocal communities\n• Synergies, opportunities and trade-offs of adaptation such as with Disaster Risk Reduction,\nmitigation and sustainable developmen",
    "special_requests": "",
    "recommended_sources": "",
    "book_id": "13",
    "scheduled_date": "11/25/25",
    "isbn": "",
    "imprint": "xynapse_traces",
    "publisher": "",
    "format": "",
    "priority": "",
    "notes": ""
  }
]