{
  "book_title": "Asher's Adoption Story",
  "total_chapters": 11,
  "target_word_count": 11200,
  "outline_metadata": {
    "protagonist_name": "Asher Cohen",
    "primary_theme": "Emotional self-management (for children)",
    "secondary_theme": "Growth mindset (for families)",
    "contemporary_hook": "Pet adoption event / 'A Day in the Life of My Pet' TikTok"
  },
  "chapters": [
    {
      "chapter_number": 1,
      "chapter_title": "The New Kid, The Old Frustration",
      "estimated_word_count": 950,
      "setting_details": "Asher's messy bedroom in his new San Francisco home; the bustling cafeteria and classroom at Golden Gate Elementary in Noe Valley.",
      "characters_present": [
        "Asher Cohen",
        "Mom (Sarah)",
        "Stepdad (David)",
        "Stepsister (Lily, 8)",
        "Stepbrother (Noah, 12)",
        "Mrs. Davis (Teacher)"
      ],
      "plot_summary": "Asher, still adjusting to his blended family and new school in San Francisco, finds solace in his love for animals, often drawing fantastical creatures. During a chaotic breakfast, he struggles to decode a word on a cereal box, leading to a flash of frustration he struggles to hide. At school, his teacher, Mrs. Davis, announces an exciting 'Pet Adoption Awareness' event, where students will research an animal and create a 'Day in the Life' TikTok. Asher is thrilled, imagining all the amazing pets he could help, but a small twinge of anxiety about the research reading lingers.",
      "emotional_beats": "Asher feels overwhelmed and slightly out of place at home, but excited and hopeful about the pet event. He experiences a familiar surge of frustration when reading, followed by a slight shame. His parents feel a mix of hope for his adjustment and underlying worry about his academic struggles.",
      "skill_focus_integration": "Introduces Asher's struggle with emotional self-management, specifically handling frustrations when encountering difficulties with decoding. Hints at the parents' initial 'innate ability' mindset through their observations of his reading.",
      "contemporary_hook_usage": "The 'Pet Adoption Awareness' event and the 'Day in the Life of My Adopted Pet' TikTok project are introduced as the central contemporary hook, immediately engaging Asher and setting up the plot.",
      "dialogue_highlights": [
        "\"Ugh, this word is impossible!\" Asher muttered, shoving the cereal box away.",
        "\"Asher, sweetie, just sound it out,\" Mom says gently, but a flicker of concern crosses her face.",
        "\"And the best part,\" Mrs. Davis beamed, \"is we'll be creating a 'Day in the Life' TikTok for our chosen animal!\""
      ],
      "scene_breakdown": [
        {
          "scene_number": 1,
          "description": "Morning chaos: Asher in his room, then at breakfast with blended family. Struggles with a word on a cereal box, internal frustration."
        },
        {
          "scene_number": 2,
          "description": "School announcement: Mrs. Davis announces the Pet Adoption Awareness event and the TikTok project. Asher's excitement and underlying anxiety."
        },
        {
          "scene_number": 3,
          "description": "After-school reflection: Asher sketches animals, dreaming of the project, but remembering the reading struggle."
        }
      ],
      "chapter_purpose": "Establishes Asher's character, his love for animals, his core problem (emotional self-management/reading frustration), his blended family dynamic, and introduces the central plot device (pet adoption event/TikTok).",
      "foreshadowing_elements": "Asher's difficulty with a simple word on the cereal box foreshadows future academic struggles. The parents' concerned glance hints at their developing 'B-plot' arc.",
      "cliffhanger_or_transition": "Asher's excitement about the pet project clashes with a quiet dread about the reading research, leaving him wondering how he'll manage."
    },
    {
      "chapter_number": 2,
      "chapter_title": "The Great Animal Debate",
      "estimated_word_count": 1000,
      "setting_details": "Asher's kitchen during dinner; the school library during lunch recess at Golden Gate Elementary.",
      "characters_present": [
        "Asher Cohen",
        "Mom (Sarah)",
        "Stepdad (David)",
        "Lily",
        "Noah",
        "Mrs. Davis"
      ],
      "plot_summary": "Asher is buzzing with ideas for his pet project, but choosing just one animal proves challenging. His step-siblings, Lily and Noah, offer their own suggestions, leading to a minor squabble at the dinner table where Asher struggles to articulate his preferences without getting frustrated. The next day at school, Mrs. Davis reviews the project guidelines, emphasizing the research component. Asher feels the familiar knot of anxiety in his stomach, knowing he'll have to read and comprehend information. He eventually settles on researching a shy, often misunderstood animal, like a ferret, feeling a connection to its need for understanding.",
      "emotional_beats": "Asher feels initial excitement, then overwhelmed by choices, leading to frustration and difficulty expressing himself calmly. He feels a sense of connection to his chosen animal. Parents observe his frustration, their 'growth mindset' is not yet fully formed, so they might offer a quick fix or just tell him to 'calm down.'",
      "skill_focus_integration": "Highlights Asher's difficulty with emotional self-management during conflict/decision-making. Parents' initial reactions subtly show their need for a 'growth mindset' regarding managing conflict and academic challenges.",
      "contemporary_hook_usage": "The 'Day in the Life of My Adopted Pet' TikTok project drives Asher's focus, as he imagines how to make a ferret interesting for a video.",
      "dialogue_highlights": [
        "\"But I *want* a dog! Or a cat! Not some boring fish!\" Lily exclaimed, making Asher clench his fists.",
        "\"It's not boring, it's... misunderstood!\" Asher retorted, his voice rising.",
        "\"Remember, the research is key,\" Mrs. Davis reminded them. \"We need to understand our animals deeply.\""
      ],
      "scene_breakdown": [
        {
          "scene_number": 1,
          "description": "Dinner table debate: Family discusses animal choices; Asher struggles with frustration during the discussion."
        },
        {
          "scene_number": 2,
          "description": "School project details: Mrs. Davis explains research requirements. Asher's anxiety."
        },
        {
          "scene_number": 3,
          "description": "Choosing a ferret: Asher makes his choice, feeling a connection to the animal."
        }
      ],
      "chapter_purpose": "Deepens Asher's internal conflict regarding emotional regulation and reading. Introduces the specific animal for the project, setting up research challenges. Shows initial family dynamics around problem-solving.",
      "foreshadowing_elements": "Asher's connection to a 'misunderstood' animal subtly reflects his own feelings. The emphasis on research foreshadows reading difficulties.",
      "cliffhanger_or_transition": "Asher has his animal, but the mountain of research still looms large, along with the memory of his dinner table outburst."
    },
    {
      "chapter_number": 3,
      "chapter_title": "The Vocabulary Volcano",
      "estimated_word_count": 1050,
      "setting_details": "Asher's quiet reading corner (initially); the kitchen table later that evening in his San Francisco home.",
      "characters_present": [
        "Asher Cohen",
        "Mom (Sarah)",
        "Stepdad (David)",
        "Lily",
        "Noah"
      ],
      "plot_summary": "Asher eagerly begins researching ferrets, but quickly hits a wall with a dense, non-decodable text from the library. He encounters a complex vocabulary word – 'crepuscular' – that completely derails his efforts. Despite trying to sound it out, he feels a familiar overwhelming frustration build. When Lily innocently asks him what he's doing, Asher snaps at her, then retreats, slamming his book shut. His parents, witnessing his outburst, share a worried glance. Mom later finds Asher upset in his room. They try to comfort him, but their advice focuses on 'trying harder' or 'it'll click,' reflecting their current lack of a structured literacy understanding.",
      "emotional_beats": "Asher feels excitement turn to intense frustration, then anger and shame after snapping at Lily. He feels defeated and overwhelmed. His parents feel concern and helplessness, reflecting their 'innate ability' mindset. Lily feels hurt and confused.",
      "skill_focus_integration": "This chapter is a direct illustration of Asher's poor emotional self-management and lack of reading resilience when faced with difficulty. It also highlights the parents' initial 'growth mindset' deficit, where they don't yet understand *how* to support him beyond general encouragement. Introduces the idea of a challenging text.",
      "contemporary_hook_usage": "Asher's inability to research effectively directly impacts his ability to create the 'Day in the Life' TikTok, creating immediate stakes for the project.",
      "dialogue_highlights": [
        "\"C-r-e-p-u... what even *is* that?!\" Asher yelled, throwing the book.",
        "\"Asher! What was that for?!\" Lily cried, tears welling.",
        "\"Maybe reading just isn't his thing, like Noah's a natural,\" David whispers to Sarah, showing their 'innate ability' mindset."
      ],
      "scene_breakdown": [
        {
          "scene_number": 1,
          "description": "Research frustration: Asher tries to read about ferrets, struggles with 'crepuscular' and other words."
        },
        {
          "scene_number": 2,
          "description": "The outburst: Lily interrupts, Asher snaps, slams the book, retreats."
        },
        {
          "scene_number": 3,
          "description": "Parental concern: Parents discuss Asher's struggles, their limited understanding of how to help. Mom talks to Asher in his room, but the conversation doesn't fully resolve his frustration."
        }
      ],
      "chapter_purpose": "Establishes the core problem of Asher's reading frustration and poor emotional self-management. Clearly introduces the parents' 'innate ability' mindset regarding reading. Sets up the need for a more structured approach.",
      "foreshadowing_elements": "The parents' conversation hints at their need for more information. Asher's deep frustration indicates his mental health is being impacted by his struggles (link between literacy and mental health).",
      "cliffhanger_or_transition": "Asher is left feeling defeated, his ferret project seeming impossible, and his parents are left wondering how to truly help him."
    },
    {
      "chapter_number": 4,
      "chapter_title": "A New Tool for the Toolbox",
      "estimated_word_count": 1000,
      "setting_details": "Mrs. Davis's classroom after school; the school's 'Learning Lab' or resource room at Golden Gate Elementary.",
      "characters_present": [
        "Asher Cohen",
        "Mrs. Davis",
        "Ms. Elena (Reading Specialist)",
        "Mom (Sarah)"
      ],
      "plot_summary": "The next day, Mrs. Davis, noticing Asher's struggle, pulls him aside after class. She gently suggests he meet with Ms. Elena, the school's reading specialist, to find some 'new tools' for his reading. Asher is initially resistant, feeling singled out and embarrassed, but Mrs. Davis reassures him it's about building skills. In the Learning Lab, Ms. Elena introduces Asher to a high-quality, decodable text about ferrets and some multisensory learning tools, like letter tiles. Asher is surprised that reading doesn't feel quite so overwhelming with these new methods. Mom receives a call from Mrs. Davis, suggesting parent resources and workshops.",
      "emotional_beats": "Asher feels embarrassment and apprehension, then a glimmer of hope and curiosity with Ms. Elena. Mrs. Davis feels empathetic and proactive. Mom feels a mix of relief that help is available and a touch of guilt for not knowing how to help sooner.",
      "skill_focus_integration": "Introduces 'structured literacy' resources for children (decodable texts, multisensory learning tools). Shows Asher starting to use self-awareness to recognize his feelings and communicate (even if reluctantly) with his teacher. Hints at the 'diagnostic and responsive teaching' of Ms. Elena.",
      "contemporary_hook_usage": "The decodable text is specifically about ferrets, helping Asher connect his project to his reading practice.",
      "dialogue_highlights": [
        "\"It's not about being 'bad' at reading, Asher,\" Mrs. Davis explained kindly. \"It's about finding the right tools for *your* brain.\"",
        "\"Try tracing the letters in the sand, then sound out the word 'nocturnal',\" Ms. Elena instructed.",
        "\"A parent workshop? That sounds… interesting,\" Mom says, a flicker of curiosity in her voice."
      ],
      "scene_breakdown": [
        {
          "scene_number": 1,
          "description": "Teacher's concern: Mrs. Davis talks to Asher after class, suggesting Ms. Elena."
        },
        {
          "scene_number": 2,
          "description": "Meeting Ms. Elena: Asher's initial reluctance, then introduction to decodable texts and multisensory tools in the Learning Lab."
        },
        {
          "scene_number": 3,
          "description": "Mom's call: Mrs. Davis calls Mom, suggesting parent resources and workshops."
        }
      ],
      "chapter_purpose": "Introduces structured literacy and specific resources for Asher. Begins the shift in Asher's emotional self-management by offering concrete strategies. Initiates the B-plot by prompting parents to seek resources.",
      "foreshadowing_elements": "Ms. Elena's methods offer a path for Asher to build confidence and perseverance. The mention of parent workshops sets up the parents' journey to a growth mindset.",
      "cliffhanger_or_transition": "Asher leaves the Learning Lab with a slightly lighter step, a decodable book in hand, but the challenge of applying these new skills still lies ahead."
    },
    {
      "chapter_number": 5,
      "chapter_title": "The TikTok Tangle",
      "estimated_word_count": 1050,
      "setting_details": "Asher's bedroom, attempting to film; the kitchen, later, during a homework session in his San Francisco home.",
      "characters_present": [
        "Asher Cohen",
        "Lily",
        "Noah",
        "Mom (Sarah)",
        "Stepdad (David)"
      ],
      "plot_summary": "Armed with his new decodable texts and a growing understanding of ferret facts, Asher attempts to plan and film his 'Day in the Life' TikTok. He struggles with the technical aspects – getting the lighting right, speaking clearly, and editing clips. Lily, wanting to help, accidentally deletes a segment, triggering a familiar wave of frustration in Asher. He lashes out, then retreats to his room. His parents, remembering Mrs. Davis's call, try a new approach. Instead of simply telling him to 'calm down,' Mom asks him to identify *what* he's feeling and *why*, a small step towards self-awareness and emotional regulation.",
      "emotional_beats": "Asher feels a mix of renewed hope, then intense frustration and anger when his hard work is seemingly ruined. He feels shame after lashing out. Mom feels empathy and a desire to implement new strategies. Lily feels hurt and confused.",
      "skill_focus_integration": "Directly addresses Asher's emotional self-management, specifically self-awareness ('recognize and name their feelings'). Parents begin to show empathy and emotional regulation by trying a different approach, moving away from just 'trying harder.'",
      "contemporary_hook_usage": "The TikTok filming and editing process become a source of frustration, directly tying the hook to Asher's emotional challenges.",
      "dialogue_highlights": [
        "\"Lily! You just ruined everything! Get out!\" Asher screamed, his face red.",
        "\"Asher, stop. Tell me, what are you feeling right now? Not just 'mad',\" Mom said, kneeling beside him.",
        "\"It's like... the words for the video are all jumbled, and now the video is too,\" Asher finally admits, a small breakthrough."
      ],
      "scene_breakdown": [
        {
          "scene_number": 1,
          "description": "TikTok filming: Asher attempts to film, encountering technical difficulties."
        },
        {
          "scene_number": 2,
          "description": "Lily's mistake & Asher's outburst: Lily tries to help, makes a mistake, Asher lashes out."
        },
        {
          "scene_number": 3,
          "description": "Mom's new approach: Mom tries to get Asher to identify his feelings, a small step towards self-awareness."
        }
      ],
      "chapter_purpose": "Escalates Asher's emotional self-management challenge within the context of the project. Shows the parents beginning to implement new strategies, even before fully understanding the 'growth mindset.'",
      "foreshadowing_elements": "Asher's ability to articulate his feelings, even a little, hints at future emotional growth. The parents' new approach shows they are open to learning.",
      "cliffhanger_or_transition": "Asher has identified his frustration, but the TikTok remains unfinished and the emotional mess of the outburst lingers in the air."
    },
    {
      "chapter_number": 6,
      "chapter_title": "The Growth Mindset Seed",
      "estimated_word_count": 1100,
      "setting_details": "Golden Gate Elementary auditorium (parent workshop); Asher's bedroom, later that evening in his San Francisco home.",
      "characters_present": [
        "Mom (Sarah)",
        "Stepdad (David)",
        "Ms. Elena (Reading Specialist, presenting)",
        "Asher Cohen",
        "Lily",
        "Noah"
      ],
      "plot_summary": "Mom and Stepdad attend a 'Science of Reading' parent workshop at school, led by Ms. Elena. They learn about structured literacy, the difference between it and 'balanced literacy,' and the concept of a 'growth mindset' – that reading is a skill taught and learned, not an innate ability. They have an 'aha!' moment, realizing their previous assumptions about Asher's reading were limiting. Meanwhile, at home, Asher, with Ms. Elena's decodable texts, makes small, consistent progress on his ferret research, finding new confidence in understanding words he can sound out. He even helps Lily understand a tricky word in her own homework, demonstrating a tiny spark of reading resilience.",
      "emotional_beats": "Parents feel enlightened, a mix of regret for past assumptions and hope for the future. Asher feels a quiet sense of accomplishment and growing confidence. Lily feels impressed by Asher's help.",
      "skill_focus_integration": "This chapter is central to the B-plot, fully introducing the 'growth mindset' for families and 'Science of Reading principles.' It shows Asher developing perseverance and grit ('reading resilience') through consistent practice with appropriate materials.",
      "contemporary_hook_usage": "Asher's research for the TikTok project is now more effective due to the decodable texts and strategies learned from Ms. Elena.",
      "dialogue_highlights": [
        "\"So, it's not about being 'a natural reader'?\" David asked, a new understanding dawning on his face at the workshop.",
        "\"Exactly. It's a skill, built step-by-step,\" Ms. Elena affirmed. \"Effort and strategy are key.\"",
        "\"Hey, Lily, try breaking 'magnificent' into parts: 'mag-nif-i-cent',\" Asher says, surprising himself."
      ],
      "scene_breakdown": [
        {
          "scene_number": 1,
          "description": "Parent workshop: Mom and Stepdad attend the 'Science of Reading' workshop, learning about growth mindset and structured literacy."
        },
        {
          "scene_number": 2,
          "description": "Home reading progress: Asher works on his ferret research, using new strategies, making progress."
        },
        {
          "scene_number": 3,
          "description": "Helping Lily: Asher uses his newfound skills to help Lily, demonstrating early reading resilience."
        }
      ],
      "chapter_purpose": "Fully develops the B-plot, establishing the parents' growth mindset and understanding of structured literacy. Shows Asher's early, positive progress, linking his academic growth to his emotional journey.",
      "foreshadowing_elements": "Parents' new understanding will directly impact their interactions with Asher. Asher's small act of helping Lily foreshadows his growing confidence and self-efficacy.",
      "cliffhanger_or_transition": "Mom and Stepdad return home, buzzing with new information and a plan, ready to apply their 'growth mindset' to help Asher, unaware of his small triumph with Lily."
    },
    {
      "chapter_number": 7,
      "chapter_title": "The Last-Minute Panic",
      "estimated_word_count": 1150,
      "setting_details": "The Cohen family living room, the day before the Pet Adoption Awareness event in San Francisco.",
      "characters_present": [
        "Asher Cohen",
        "Mom (Sarah)",
        "Stepdad (David)",
        "Lily",
        "Noah"
      ],
      "plot_summary": "The day before the Pet Adoption Awareness event, Asher is trying to finalize his TikTok and presentation notes. He discovers a crucial piece of information about ferret care is missing from his research, and the library is closed. Panic sets in, and he feels a familiar wave of overwhelming frustration. This time, however, his parents, now armed with their 'growth mindset' knowledge, don't just tell him to calm down. They sit with him, help him brainstorm solutions (e.g., checking an online animal rescue site, calling a pet store), and emphasize that learning is about overcoming challenges, not just innate ability. Asher, guided by their calm support, manages to find the missing information and re-edits his video, but it's a close call.",
      "emotional_beats": "Asher experiences intense panic and frustration, on the verge of an outburst. His parents feel empathy and a focused determination to help him problem-solve. Asher feels relieved and a growing sense of self-efficacy from overcoming the challenge.",
      "skill_focus_integration": "This is a key convergence point. Asher's emotional self-management is tested, but he uses nascent self-awareness and resilience with his parents' support. Parents actively demonstrate their 'growth mindset' by focusing on strategies and effort, showing their emotional regulation.",
      "contemporary_hook_usage": "The imminent deadline for the TikTok project creates high stakes for Asher's emotional self-management and his parents' application of their new understanding.",
      "dialogue_highlights": [
        "\"It's ruined! It's all ruined!\" Asher cried, tears starting to fall.",
        "\"It's okay to feel frustrated, Asher,\" Mom said calmly. \"Let's brainstorm. What's one thing we *can* do?\"",
        "\"See? You figured it out, not because it was easy, but because you kept trying,\" David beamed, reinforcing the growth mindset."
      ],
      "scene_breakdown": [
        {
          "scene_number": 1,
          "description": "Missing information panic: Asher realizes crucial info is missing, panics."
        },
        {
          "scene_number": 2,
          "description": "Parents' growth mindset in action: Parents calmly help Asher brainstorm solutions, emphasizing effort and strategy."
        },
        {
          "scene_number": 3,
          "description": "Problem solved (just barely): Asher finds the info, re-edits the TikTok, feeling relieved."
        }
      ],
      "chapter_purpose": "This is a major turning point where both A-plot and B-plot themes converge. Asher makes significant progress in emotional self-management with direct support from his parents' newly acquired growth mindset.",
      "foreshadowing_elements": "Asher's ability to navigate this crisis foreshadows his success at the event. The family's teamwork strengthens their bond.",
      "cliffhanger_or_transition": "The TikTok is finished, but the stress of the near-disaster leaves Asher nervous about the actual presentation tomorrow."
    },
    {
      "chapter_number": 8,
      "chapter_title": "Deep Breaths and Decodable Notes",
      "estimated_word_count": 1100,
      "setting_details": "Asher's bedroom, practicing his presentation; the school auditorium, setting up for the event at Golden Gate Elementary.",
      "characters_present": [
        "Asher Cohen",
        "Mom (Sarah)",
        "Stepdad (David)",
        "Lily",
        "Noah"
      ],
      "plot_summary": "The morning of the Pet Adoption Awareness event, Asher is a bundle of nerves. He practices his presentation in front of his family, using his revised notes which now include simpler, more decodable words and visual cues from Ms. Elena's strategies. When he stumbles on a word, instead of lashing out, he takes a deep breath, remembers Ms. Elena's advice, and tries again. His parents offer specific encouragement, praising his effort and resilience, rather than just telling him to be 'good.' Even Noah and Lily offer supportive words, creating a more harmonious family dynamic. At school, Asher helps his mom set up his display, feeling a quiet sense of accomplishment.",
      "emotional_beats": "Asher feels intense nervousness, but also a growing sense of self-control and confidence as he applies his new strategies. His family feels proud and supportive.",
      "skill_focus_integration": "Focuses on Asher's perseverance and grit ('reading resilience') and emotional self-management (deep breaths, trying again). Parents actively use their 'growth mindset' to provide specific, encouraging feedback. Demonstrates consistency between home and school strategies.",
      "contemporary_hook_usage": "Asher practices his presentation, which incorporates his TikTok, making sure his words are clear and his research well-articulated.",
      "dialogue_highlights": [
        "\"Deep breath, Asher. Remember 'pre-da-tor',\" Mom coaches, pointing to his revised note card.",
        "\"You got it, Ash! That was a tricky one, but you stuck with it,\" Noah cheered, a rare moment of sibling support.",
        "\"It feels… less scary when I break it down,\" Asher admits, a small smile playing on his lips."
      ],
      "scene_breakdown": [
        {
          "scene_number": 1,
          "description": "Morning practice: Asher practices his presentation with his family, applying new reading/emotional strategies."
        },
        {
          "scene_number": 2,
          "description": "Family support: Family offers specific, growth-mindset aligned encouragement."
        },
        {
          "scene_number": 3,
          "description": "Event setup: Asher and Mom set up his display at school, a moment of calm before the storm."
        }
      ],
      "chapter_purpose": "Shows Asher actively applying his emotional self-management and reading resilience skills. Demonstrates the family's growth mindset in action, reinforcing the supportive environment.",
      "foreshadowing_elements": "Asher's successful practice builds anticipation for the actual event. The family's newfound harmony sets a positive tone.",
      "cliffhanger_or_transition": "Asher stands before his display, the auditorium filling with people, a mix of excitement and nerves bubbling inside him."
    },
    {
      "chapter_number": 9,
      "chapter_title": "The Spotlight Moment",
      "estimated_word_count": 1050,
      "setting_details": "Golden Gate Elementary auditorium, during the Pet Adoption Awareness event.",
      "characters_present": [
        "Asher Cohen",
        "Mom (Sarah)",
        "Stepdad (David)",
        "Lily",
        "Noah",
        "Mrs. Davis",
        "Ms. Elena",
        "various classmates and parents"
      ],
      "plot_summary": "It's Asher's turn to present. He steps up to his display, and for a moment, his mind goes blank. His heart pounds. But instead of shutting down, he takes a deep breath, remembering his strategies. He starts his presentation, showing his 'Day in the Life of a Ferret' TikTok. Midway through, a technical glitch causes his video to freeze. Asher feels a surge of panic, but this time, he manages it. He calmly explains the situation, improvises, and continues his presentation using his notes, highlighting key facts about ferret care and why they make great pets. His parents watch, beaming with pride, not just for his facts, but for his poise."
    }
  ]
}